<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/zuNVqw_v8zE?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    D&rsquo;o&ugrave; vient l&rsquo;id&eacute;e&thinsp;?
                </h2>
                <p>
                    Le stationnement en ville peut &ecirc;tre assez fastidieux. En effet, combien de fois avez-vous tourn&eacute; en rond en sacrant pour vous trouver une place de stationnement&thinsp;? En tout cas, nous oui&thinsp;!
                </p>
                <h2>
                    Qu&rsquo;est-ce que l&rsquo;application fait&thinsp;?
                </h2>
                <p>
                    DestinatR vous servira de guide dans la recherche d&rsquo;un stationnement. Effectivement, l&rsquo;application se sert des donn&eacute;es sur l&rsquo;emplacement des stationnements, payantes ou non, pour pr&eacute;dire l&rsquo;emplacement d&rsquo;un stationnement &agrave; proximit&eacute; de la destination. Son efficacit&eacute; est donc optimale dans les grandes villes.
                </p>
                <h2>
                    Comment l&rsquo;avons-nous construite&thinsp;?
                </h2>
                <p>
                    Nous avons fait une application Android native en kotlin pour le frontend. Nous avons &eacute;galement utilis&eacute; l'API de Google Maps. Pour le backend, nous avons utilis&eacute; Node.js, Express.js, Typescript et une base de donn&eacute;es MongoDB.
                </p>
                <h2>
                    Quelles &eacute;taient les difficult&eacute;s que nous avons rencontr&eacute;es&thinsp;?
                </h2>
                <p>
                    Nous avons eu de la difficult&eacute; &agrave; impl&eacute;menter le machine learning. De plus, il a fallu standardiser les donn&eacute;es de stationnements des diff&eacute;rentes villes pour permettre l&rsquo;utilisation de toutes les donn&eacute;es d&eacute;sir&eacute;es. Nous avons pris plus de temps de d&eacute;veloppement que pr&eacute;vu &agrave; cause de ces fonctionnalit&eacute;s.
                </p>
                <h2>
                    De quoi sommes-nous fiers?
                </h2>
                <p>
                    Nous sommes arriv&eacute;s avec une application fonctionnelle et conviviale tout en utilisant des jeux de donn&eacute;es de diff&eacute;rentes villes.
                </p>
                <h2>
                    Qu&rsquo;avons-nous appris&thinsp;?
                </h2>
                <p>
                    Nous avons beaucoup appris sur le d&eacute;veloppement Android natif et sur l'analyse de donn&eacute;es ouvertes.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/google-maps">
                                google-maps
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            kotlin
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mongodb">
                                mongodb
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mongoose">
                                mongoose
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/typescript">
                                typescript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
