<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Lo que nos inspiro a llevar a cabo la realizaci&oacute;n de este proyecto fue la problem&aacute;tica que presenta el municipio en una actividad econ&oacute;mica tan importante para ellos, al expresarnos su gran necesidad de cambio, decidimos brindar de alguna forma un apoyo. En la b&uacute;squeda de informaci&oacute;n encontrar informaci&oacute;n tan reducida reafirmaba la falta de asesor&iacute;a administrativa que se tiene en la regi&oacute;n.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Una serie de cat&aacute;logos dentro de una pagina web que clasifica los servicios y los productos que brinda cada proveedor de la zona que se dedique a un rubro de la alfarer&iacute;a, con una serie de filtros para que otros proveedores y/o clientes minoristas, mayoristas y aquellos clientes espec&iacute;ficos puedan encontrar lo que buscan, incluso en algunos casos crear redes de trabajo para mejorar la captaci&oacute;n de clientes y proyectos.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Se realiz&oacute; la descarga de una plantilla de bootstrap y se le realizaron modificaciones y ediciones adaptandose a los requerimientos que externaban las diferentes asociaciones de alfareros con los que realizamos investigaciones. A manejarlo de manera para presentaci&oacute;n de proyecto aun no est&aacute; montada en ning&uacute;n espacio p&uacute;blico, las pruebas las realizamos de manera local.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    -Falta de censos e informaci&oacute;n en general sobre los talleres que est&aacute;n dentro del municipio de Dolores Hidalgo Cuna de la Independencia.
-La indiferencia que actualmente presentan los miembros de las asociaciones y por ende su falta de integraci&oacute;n en su trabajo. 
-Involucra a los peque&ntilde;os y a los grandes proveedores, para que mejore la captaci&oacute;n de clientes.
-Fomenta los procesos administrativos entre empresas para la generaci&oacute;n de networking.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Nuestro trabajo en equipo permiti&oacute; tener una din&aacute;mica laborar completa y que ayud&oacute; con la ejecuci&oacute;n de cada una de las tareas de manera eficiente y optimizada, nuestro acercamiento con los promotores y lideres de las asociaciones de alfareros nos sensibiliz&oacute; mucho sobre la problem&aacute;tica y las necesidades.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Nos enfocamos m&aacute;s en el apartado de edici&oacute;n, tambi&eacute;n sobre el trabajo en equipo en &aacute;reas que no necesariamente son nuestro fuerte y en como acercarnos con aquellas personas que son un motor econ&oacute;mico y por la costumbre son poco considerados.
                </p>
                <h2>
                    What's next for Alfareros de Dolores
                </h2>
                <p>
                    Nuestra intenci&oacute;n es que este proyecto de negocio brinde servicios m&aacute;s espec&iacute;ficos para diferentes rubros econ&oacute;micos y generando informaci&oacute;n estad&iacute;stica con mayor certeza y que brinde mayor confianza y acercamiento a las personas para incluir procesos administrativos m&aacute;s espec&iacute;ficos.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
