<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    La inspiraci&oacute;n surgi&oacute; del deseo de querer concientizar a las personas de una manera diferente que solo mostrando informaci&oacute;n acerca del tema de donaci&oacute;n de organos. En su lugar, mostramos una historia que hable del tema y del que se sienta identificado el usuario.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    La aplicaci&oacute;n es una novela visual, la cual se encarga de presentar diferentes tipos de situaciones en torno a un tema en especifico y el usuario se encarga de tomar las decisiones tal y como si fuera el personaje principal de la historia.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Comenzamos realizando una lista de requerimientos, los cuales deseamos que tuvieran nuestra aplicaci&oacute;n. Una vez realizado lo anterior se enfoc&oacute; en optar por las tecnolog&iacute;as que nos permitieran resolver el problema. Por &uacute;ltimo se realiz&oacute; la programaci&oacute;n y todo lo relacionado a ello.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    El principal problema que se present&oacute; fue el tiempo. 24 horas para realizar y tener una aplicaci&oacute;n funcional aunado a una complicaci&oacute;n al momento de elegir el problema result&oacute; un tanto complicado para todo el equipo, ya que todos quer&iacute;an comenzar a pesar de no tener fijado el producto final.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Dentro del equipo estamos orgullosos de haber sido capaces de crear una aplicaci&oacute;n innovadora y funcional, asimismo pudimos hacer uso de las distintas habilidades de los integrantes del equipo.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Hemos aprendido lo mucho que nos falta para considerarnos buenos programadores, la tecnologia avanza y nosotros debemos movernos con ella. De igual manera el trabajar con dem&aacute;s personas con distintas personalidades e ideas resulta enriquecedor tanto como estudiante como en lo personal.
                </p>
                <h2>
                    What's next for AmaresDonar
                </h2>
                <p>
                    Para esta aplicaci&oacute;n tenemos mucho m&aacute;s ideas, entre ellas implementar m&aacute;s historias con mucho m&aacute;s finales cada uno diferente entre si como sea posible, lo que hace de nuestra aplicaci&oacute;n un programa que puede aportar mucho m&aacute;s horas de jugabilidad que una aplicaci&oacute;n com&uacute;n.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/photoshop">
                                photoshop
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/JairDiaz22/AmaresDonar" rel="nofollow" target="_blank" title="https://github.com/JairDiaz22/AmaresDonar">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
