<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="360237" data-title="AppApacho Logo" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/237/datas/original.jpg">
                            <img alt="AppApacho &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/237/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                AppApacho Logo
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiraci&oacute;n
                </h2>
                <p>
                    El amor por la vida de nuestros seres queridos.
                </p>
                <h2>
                    Lo que hace
                </h2>
                <p>
                    Appapacho es una gama de Wearable conectados a una plataforma innovadora que permite llevar el registro de los signos vitales de nuestros seres queridos. Al mismo tiempo, la plataforma nos conecta con los expertos en el cuidado y salud, permitiendo peque&ntilde;as consultas remotas y la capacidad programar citas presenciales de manera eficaz, as&iacute; como leer rese&ntilde;as y calificaciones sobre estos especialistas. Apoyamos a  prevenir complicaciones futuras y llevamos un registro de cualquier anomal&iacute;a detectada por el Wearable y en caso de ser necesario el dispositivo permite visualizar en tiempo real al paciente.
                </p>
                <h2>
                    La forma en que lo hicimos
                </h2>
                <p>
                    AppApacho nace de la combinaci&oacute;n de el cari&ntilde;o y la necesidad de saber en todo momento como se encuentran las las personas que mas queremos.
Para el desarrollo de nuestro proyecto hemos utilizado las herramientas tecnol&oacute;gicas a nuestro alcance como Arduino, Raspberry Pi, Tecnolog&iacute;as Web y M&oacute;viles, junt&aacute;ndolas con algunos sensores y entornos de programaci&oacute;n para as&iacute; llevar a la realidad el prototipo m&iacute;nimo viable de nuestro proyecto.
                </p>
                <h2>
                    Modelo de Negocios
                </h2>
                <p>
                    Para llevar a AppApacho necesitamos los siguientes Socios clave:
                </p>
                <p>
                    M&eacute;dicos: Ellos ser&aacute;n un motor importante de la ejecuci&oacute;n de nuestro ecosistema.
Hospitales y Cl&iacute;nicas: Ellos podr&iacute;an ser un impulso para que la comunidad medica se una al ecosistema.
                </p>
                <p>
                    Actividades Clave que realizaremos son:
                </p>
                <p>
                    Monitoreo de las personas por medio de Wearable(En la primera etapa propios, en la segunda incluir a terceros).
Crear y llevar un historial de dichos monitoreos.
Conectar personas con profesionales: Esto para permitirles micro consultas(dudas que se envian a 5 m&eacute;dicos especialistas en determinada &aacute;rea para que ellos retro alimenten ) y de ser necesario programar una consulta presencial(en la primera etapa directo en las cl&iacute;nicas y en la segunda etapa visitas a domicilio)
Tener un directorio de m&eacute;dicos por especialidad, localizaci&oacute;n y calificaci&oacute;n
                </p>
                <p>
                    Recursos Clave:
                </p>
                <p>
                    En la primera etapa se requieren los siguientes recursos clave:
Hardware: para la fabricaci&oacute;n e interacci&oacute;n directa con el paciente.
Servidores: para sustentar la disponibilidad de las aplicaciones.
Marca: Para tener un respaldo de imagen y confianza de los usuarios.
Aplicaci&oacute;n web y m&oacute;vil: son el motor de todo.
Marco Legal: se requiere de un respaldo para poder operar bajo las normas que establece el pa&iacute;s.
En la segunda etapa:
Campa&ntilde;a masiva de publicidad.
M&aacute;s servidores en proporci&oacute;n de los usuarios.
                </p>
                <p>
                    Propuestas de valor(Lo que nos hace especiales):
                </p>
                <p>
                    Somos una forma de llevar un monitoreo constante de bebes y miembros de la familia que requieren un cuidado especial .
Somos una forma de conectarte con los expertos en el &aacute;rea del cuidado y la salud.
Llevar un expediente del estado cl&iacute;nico de pacientes de una forma sencilla y sin papel.
Micro consultas por medio de AppApacho.
Directorio y calificaci&oacute;n de los m&eacute;dicos.
Programaci&oacute;n y recordatorio de citas.
Relaci&oacute;n entre personas ya que se tendr&iacute;a una forma m&aacute;s r&aacute;pida de contacto.
Relaci&oacute;n cercana con los m&eacute;dicos.
Recordatorios especiales (Alerta de toma de medicamento,etc).
                </p>
                <p>
                    Canales de distribuci&oacute;n:
                </p>
                <p>
                    Redes Sociales.
Blogs.
Visitas presenciales a doctores, cl&iacute;nicas y hospitales para invitarlos a unirse.
Clientes("Recomendaci&oacute;n de persona a persona").
                </p>
                <p>
                    Publico Objetivo (ordenados por prioridad)
                </p>
                <ol>
                    <li>
                        Padres de reci&eacute;n nacidos.
                    </li>
                    <li>
                        M&eacute;dicos
                    </li>
                    <li>
                        Padres y/o familiares de enfermos cr&oacute;nicos, o discapacitados.
                    </li>
                    <li>
                        Familiares de adultos mayores.
                    </li>
                    <li>
                        Personas interesadas en llevar un mejor control de su salud.
                    </li>
                </ol>
                <p>
                    Estructura de Costes:
                </p>
                <p>
                    Los costos m&aacute;s significativos son:
Servidores: pueden llegar a significar un 30% de los gastos totales anuales.
Hardware para la producci&oacute;n de Wearable: 70%  del valor total a la venta, al ser un valor que depender&iacute;a de la demanda, no fijo pero si relevante.
Costos de envi&oacute;:5-10% de valor total a la venta, al ser un valor que depender&iacute;a de la demanda, no fijo pero si relevante.
Dominio: de $500 a $800 anuales, basado en el precio actual y calculando una inflaci&oacute;n prevista para el 2017 del 3.47% anual, cifras de Banxico.
Marketing: se plantea una inversi&oacute;n de $20,000 en la publicidad Bimestrales.
                </p>
                <p>
                    Fuentes de ingreso:
                </p>
                <p>
                    Paquetes Premium: diversos paquetes que incluir&iacute;an una cantidad de micro consultas y consultas, seg&uacute;n la especialidad requerida y los acuerdos logrados con los especialistas, as&iacute; como un historial m&aacute;s detallado.
Comisiones en servicios: se cobrara una comisi&oacute;n del 5-15% en cada servicios(micro consulta, consulta o reporte) esto no aplica para los paquetes premium.
Ventas dentro de la app: se pretende en una segunda etapa tener una peque&ntilde;a tienda electr&oacute;nica donde se podr&iacute;an adquirir los Wearable y productos de libre venta referentes al sector salud(omitiendo medicamentos).
                </p>
                <h2>
                    Retos a los que nos enfrentamos
                </h2>
                <p>
                    Desarrollo y dise&ntilde;o de Wearable.
Desarrollo de la plataforma en el tiempo menor posible, con alta calidad y seguridad.
Falta de Material.
Aceptaci&oacute;n de la sociedad medica y la uni&oacute;n con sus pacientes.
                </p>
                <h2>
                    Logros de los que nos sentimos orgullosos
                </h2>
                <p>
                    Mantener el proyecto en pie pese a las adversidades que surgieron durante el desarrollo del prototipo.
La forma de organizaci&oacute;n y distribuci&oacute;n del trabajo en el equipo.
Proponer un ecosistema innovador que ayudara a mejorar la calidad de vida de muchas personas.
                </p>
                <h2>
                    Lo que aprendimos
                </h2>
                <p>
                    Aprendimos nuevas tecnolog&iacute;as para el desarrollo.
manejo de sensores.
trabajo colaborativo
marcos legales
                </p>
                <h2>
                    Lo siguiente en AppApacho
                </h2>
                <p>
                    Corto plazo:
Desarrollo de la plataforma que sustentara el ecosistema
Desarrollo de prototipos para los diferentes perfiles antes mencionados
                </p>
                <p>
                    Largo plazo:
Volver a AppApacho una startup mexicana que desarrolle tecnolog&iacute;a Wearable y una plataforma innovadora enfocada a la salud y a la forma en la que se accede a ella.
Creaci&oacute;n de prototipos mas avanzados y adaptables a distintos perfiles.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/arduino">
                                arduino
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/json">
                                json
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/raspberry-pi">
                                raspberry-pi
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Hackamano2016/Appapacho" rel="nofollow" target="_blank" title="https://github.com/Hackamano2016/Appapacho">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
