<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="869374" data-title="Concept" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/869/374/datas/original.png">
                            <img alt="Append X &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/869/374/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Concept
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="869375" data-title="Append X for every one !" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/869/375/datas/original.png">
                            <img alt="Append X &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/869/375/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Append X for every one !
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Les personnes souffrant d'un handicap ont du mal &agrave; pouvoir s'int&eacute;grer dans des &eacute;quipes que ce soit pour des projets ou des &eacute;v&egrave;nements ou tout simplement des sorties. Pourquoi ne pas les aider &agrave; faire cela simplement ?
En ce qui concerne le nom, puisque le but est de rassembler les personnes, nous l'avons appel&eacute; Append, et &eacute;tant donn&eacute; que les personnes sont anonymes, alors Append X.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Append X est une plateforme web visant &agrave; briser les diff&eacute;rences et favoriser l&rsquo;inclusion, et ce en regroupant diff&eacute;rentes personnes anonymement et de sorte &agrave; diversifier les personnes, afin de cr&eacute;er des &eacute;quipes qui r&eacute;aliseront des projets, organiseront des &eacute;v&egrave;nements, accompliront des actions&hellip;
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Nous avons commenc&eacute; par faire un long brainstorming pour bien d&eacute;finir le besoin et la solution qui y rem&eacute;die, puis nous avons commenc&eacute; &agrave; faire la conception papier, incluant les diagrammes de classes, la conception de la BDD en mod&egrave;le relationnel, ainsi que de r&eacute;diger un document comportant la description du concept, les fonctionnalit&eacute;s, l'impact, et surtout pourquoi choisir notre solution. Ensuite, nous nous sommes r&eacute;partis les t&acirc;ches de design/d&eacute;veloppement afin d'optimiser notre rendement et de travailler en &eacute;quipe efficacement et nous avons d&eacute;cid&eacute; des technologies &agrave; utiliser. Enfin, nous sommes pass&eacute;s &agrave; la r&eacute;alisation !
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Le th&egrave;me &eacute;tant tr&egrave;s abstrait, il a fallu d&eacute;j&agrave; bien le comprendre. On doit avouer que trouver une id&eacute;e adapt&eacute;e au th&egrave;me n'&eacute;tait pas une tasse de th&eacute;... Nous sommes pass&eacute; par environ 7 id&eacute;es diff&eacute;rentes, &agrave; chaque feedback des mentors nous modifions notre concept et &ccedil;a nous menait &agrave; en red&eacute;finir un autre... Bref, un vrai calvaire. Mais heureusement, nous avons fini par valider une id&eacute;e vers 3h du matin, il fallait ensuite qu'on commence et qu'on ait un premier r&eacute;sultat avant 9h, un coup de pression suppl&eacute;mentaire qui s'ajoute &agrave; la fatigue. Au final, nous avons r&eacute;ussi &agrave; surmonter ces obstacles en &eacute;quipe et en avons tir&eacute; une exp&eacute;rience inoubliable.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Nous avons cr&eacute;&eacute; une &eacute;quipe tr&egrave;s soud&eacute;e !
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Accepter la vision de chacun, voir les choses du point de vue de l'autre, travailler en &eacute;quipe, et nous avons &eacute;galement acquis des comp&eacute;tences et de l'exp&eacute;rience suppl&eacute;mentaire en d&eacute;veloppement
                </p>
                <h2>
                    What's next for Append X
                </h2>
                <p>
                    Cr&eacute;er plusieurs versions d'append X d&eacute;di&eacute;s selon le domaine, du genre Append X Business dans l'esprit de la cr&eacute;ation d'&eacute;quipes de projets lucratifs, Append X Travel avec la possibilit&eacute; d'exchange pour d&eacute;couvrir de nouvelles cultures et traditions...
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/adobe-illustrator">
                                adobe-illustrator
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            adobe-xd
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/firebase">
                                firebase
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react">
                                react
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/aminebma/Appendx" rel="nofollow" target="_blank" title="https://github.com/aminebma/Appendx">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
