<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="558495" data-title="Forslag" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/495/datas/original.png">
                            <img alt="Arbeidslivsdata &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/495/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Forslag
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Hvert &aring;r er det 40 personer I Norge som aldri kommer hjem fra jobben. De d&oslash;r i en arbeidsulykker. Hvert &aring;r skader 24 00 mennesker seg p&aring; jobben. Hvert &aring;r gjennomf&oslash;rer Arbeidstilsynet 17 000 tilsyn, og en rekke virksomheter blir stoppet. Arbeidstilsynet gj&oslash;r en uvurderlig jobb. Det er viktig &aring; vise fram det arbeidet de gj&oslash;r for &aring; redde liv og hindre skade.
                </p>
                <h2>
                    Whati it does
                </h2>
                <p>
                    Dette er et nettsted som du kan opps&oslash;ke for &aring; finne ut hvilke bedrifter som er kontrollert, hvilke som er stanset, hvilket som har blitt ilagt tvangsmulkt.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Utgangspunktet er Arbeidstilsynets database over tilsynsvirksomheten. Den mangler imidlertid b&aring;de navn p&aring; virksomhetene og posisjonsopplysninger. Jeg har organisasjonsnummeret og henter da bedriftsnavnet fra Enhetsregisteret, posisjonsopplysningene henter jeg fra Kartverket ved hjelp av Javascript.
                </p>
                <p>
                    Ufra databasen kan jeg dermed tagge alle 17 000 tilsynene som ble gjennomf&oslash;rt. Forel&oslash;pig presenterer jeg dataene i Googlemaps.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Det var ingen programmerere p&aring; v&aring;r gruppe og databasekompetansen er begrenset, s&aring; jeg har slitt med &aring; f&aring; til en s&oslash;kbar og h&aring;ndterbar database. Det siste steget &aring; f&aring; databaseinformasjonen over p&aring; et lekrere kart enn Googlemaps er heller ikke gjennomf&oslash;rt
                </p>
                <h2>
                    Accomplishments that I&rsquo;m proud of
                </h2>
                <p>
                    Jeg er stolt av &aring; ha visualisert data som vanligvis ligger skjult.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Jeg har l&aelig;rt om databaseh&aring;ndtering og verkt&oslash;yy for geotagging.
                </p>
                <h2>
                    What&rsquo;s next for Arbeidslivsdata
                </h2>
                <p>
                    Jeg skal f&aring; s&oslash;rge for &aring; finansiere ferdig utvikling av prosjektet slik at det blir en levende hjemmeside.
                </p>
                <p>
                    Dette kan ogs&aring; bli en mal for flere tjenester som geotagger hendelser i arbeidslivet.
                </p>
                <h2>
                    Dataset we used
                </h2>
                <p>
                    Tilsynsdatabasen til Arbeidstilsynet
Enhetsregisteret
Kartverkets adressedatabase
                </p>
            </div>
        </div>
    </body>
</html>
