<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="360114" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/114/datas/original.png">
                            <img alt="Arma tu canasta &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/114/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Nuestra inspiraci&oacute;n
                </h2>
                <p>
                    Tenemos la visi&oacute;n de que la confiter&iacute;a es universal, por eso hemos decidido apoyar a nuestros productores mexicanos  especializados en la dulceria artesanal de Estados como Michoac&aacute;n, Quer&eacute;taro, Puebla, Guanajuato, entre otros. Este tipo de dulces tienen la ventaja de contener ingredientes naturales y dejar a un lado los conservadores y sustancias artificiales.
                </p>
                <p>
                    Durante el 2006 M&eacute;xico export&oacute;
                    <strong>
                        377 millones de d&oacute;lares
                    </strong>
                    de todo tipo de dulces, vendiendo un promedio anual de
                    <strong>
                        60 mil toneladas
                    </strong>
                    del producto principalmente a Norteam&eacute;rica y Am&eacute;rica Latina.
                </p>
                <p>
                    Tan solo en diciembre de 2015,
                    <strong>
                        566 personas a nivel global
                    </strong>
                    (solo con lenguas nativas ingl&eacute;s y espa&ntilde;ol) buscaron por dulces artesanales y mexicanos, y esta cifra va en aumento, seg&uacute;n informaci&oacute;n de Google Trends. Y aunque los dulces en general est&aacute;n destinados principalmente a Estados Unidos y Canad&aacute;,  tambi&eacute;n otros pa&iacute;ses son receptores de estos productos nacionales. Entre ellos est&aacute;n Costa Rica, Guatemala, Jap&oacute;n, El Salvador, Honduras, Brasil, Puerto Rico, Venezuela, Colombia y Gran Breta&ntilde;a.
                </p>
                <p>
                    En resumen, sabemos que estos productos mexicanos artesanales tienen un
                    <strong>
                        AMPLIO MERCADO
                    </strong>
                    y una
                    <strong>
                        ALTA DEMANDA
                    </strong>
                    , en consecuencia, un gran beneficio para los productores mexicanos.
                </p>
                <p>
                    Adem&aacute;s, pretendemos apoyar a los artesanos locales, espec&iacute;ficamente del &ldquo;Pueblo m&aacute;gico&rdquo; de Tequisquiapan, Quer&eacute;taro, entregando los pedidos de dulces en canastas de distintos tama&ntilde;os hechas de mimbre por dichos artesanos. Este sector artesanal es una
                    <strong>
                        fuente importante de ingresos
                    </strong>
                    para las familias de los productores artesanales de Tequisquiapan.
                </p>
                <h2>
                    &iquest;Qu&eacute; deseamos lograr?
                </h2>
                <p>
                    Simple, ampliar el mercado de los productores nacionales de dulces artesanales y artesan&iacute;as de mimbre involucr&aacute;ndolos directamente en la comercializaci&oacute;n de sus dulces a trav&eacute;s de nuestra plataforma a nivel nacional e internacional.
                </p>
                <h2>
                    Din&aacute;mica de compra
                </h2>
                <p>
                    Como valor agregado a nuestro producto, cada pedido de dulces que se haga a trav&eacute;s de nuestra plataforma llevar&aacute; consigo una breve rese&ntilde;a de cada dulce contenido e informaci&oacute;n del productor que elabor&oacute; el dulce con la intenci&oacute;n de conocer m&aacute;s sobre la tradici&oacute;n de este tipo de productos artesanales. Adem&aacute;s tendr&aacute;s la opci&oacute;n de usar este servicio para un regalo y que el paquete contenga una tarjeta con el remitente y una breve felicitaci&oacute;n.
                </p>
                <p>
                    <strong>
                        Proceso de compra
                    </strong>
                </p>
                <p>
                    <strong>
                        1. Entra a nuestra tienda.
                    </strong>
                    En la tienda podr&aacute;s encontrar nuestro cat&aacute;logo de dulces artesanales.
                </p>
                <p>
                    <strong>
                        2. Selecciona tus dulces.
                    </strong>
                    Una vez que est&eacute;s en la tienda podr&aacute;s comenzar a armar tu canasta dando clic en "Agregar a Canasta" en el dulce de tu elecci&oacute;n.
                </p>
                <p>
                    <strong>
                        3. Comienza a comprar.
                    </strong>
                    Da clic en "Canasta" y podr&aacute;s seleccionar cuantas unidades de cada dulce deseas comprar, o en su defecto, eliminar alg&uacute;n dulce de la canasta y a continuaci&oacute;n da clic en "Comprar".
                </p>
                <p>
                    <strong>
                        4. Forma de pago.
                    </strong>
                    En esta secci&oacute;n deber&aacute;s seleccionar tu forma de pago preferida y llenar los datos correspondientes del pago y env&iacute;o. Adem&aacute;s podr&aacute;s seleccionar si el paquete se trata de un regalo y tendr&aacute;s que proporcionarnos los datos de tu destinatario.
                </p>
                <p>
                    <strong>
                        5. Env&iacute;o.
                    </strong>
                    Tu paquete ser&aacute; entregado hasta la puerta de tu casa para que tengas la mayor comodidad y satisfacci&oacute;n. &iexcl;DISFRUTA TUS DULCES!
                </p>
                <h2>
                    Negocio
                </h2>
                <p>
                    Tenemos la seguridad de que este modelo de comercializaci&oacute;n tiene una gran
                    <strong>
                        rentabilidad
                    </strong>
                    para nosotros y un
                    <strong>
                        aumento considerable de ventas
                    </strong>
                    para los productores locales de dulces artesanales y tejedores de mimbre. Estamos conscientes de la
                    <strong>
                        amplia demanda
                    </strong>
                    que existe sobre estos productos a nivel nacional e internacional y el r&aacute;pido crecimiento de las ventas online.
                </p>
                <p>
                    El productor SIEMPRE obtendr&aacute; ganancias netas iguales ya que nosotros seremos los encargados de la distribuci&oacute;n y venta de sus productos, as&iacute; como de los gastos de publicidad, marketing y posicionamiento.
                </p>
                <p>
                    Despu&eacute;s de los gastos de operaci&oacute;n, determinaremos un precio final del producto para obtener una
                    <strong>
                        utilidad
                    </strong>
                    del mismo, teniendo siempre en cuenta evitar un aumento excesivo del precio final al cliente. Este precio final depender&aacute; del pa&iacute;s de destino de acuerdo a diversos factores como tipo de transporte necesario, tiempo de entrega, tipo de cambio, etc.
                </p>
                <p>
                    Como punto extra, deseamos implementar un servicio de suscripcion mensual donde a los usuarios suscritos se les enviar&aacute; un surtido aleatorio de dulces seleccionados por los productores artesanales como los mejores. Adem&aacute;s ser&aacute;n beceficiarios de ofertas exclusivas.
                </p>
                <p>
                    Finalmente, tenemos la intenci&oacute;n y el objetivo de lograr acuerdos con los productores para obtener
                    <strong>
                        mejores precios
                    </strong>
                    dependiendo de la demanda de los productos, para que tanto ellos, nosotros y los clientes finales se vean beneficiados. Adem&aacute;s de atraer divisas internacionales al pa&iacute;s.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react">
                                react
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://ec2-52-34-67-24.us-west-2.compute.amazonaws.com/" rel="nofollow" target="_blank" title="http://ec2-52-34-67-24.us-west-2.compute.amazonaws.com/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                ec2-52-34-67-24.us-west-2.compute.amazonaws.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
