<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Team Members: Kristi Str&oslash;m Lie, Kristian Aln&aelig;s, Rune Myrland, Rolf Lie
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    N&aring;r noen kommer i siste &oslash;yeblikk til bussen lurer de ofte p&aring; om den har g&aring;tt eller ikke. Det er to timer til neste buss kommer. Det hadde v&aelig;rt kjekt &aring; kunne vite dette med en gang.
                </p>
                <h2>
                    What it does:
                </h2>
                <p>
                    Askeladden er en Facebook Messenger og Chatbot som henter ut ruteinfo fra Norsk Reiseinformasjon. Bussene kan sende sanntidsdata til Norsk Reiseinformasjon. Boten skal hente ut denne og fortelle om bussen du skal p&aring; allerede har passert.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Vi bruker et nodejs-bibliotek som heter Botkit. Dette st&oslash;tter plattformer som Facebook Messenger, Slack og Twilio. Brukerne kan dermed snakke med boten via mange forskjellige plattformer. For &aring; hente opplysninger fra Norsk Reiseinformasjon gj&oslash;r vi REST-sp&oslash;rringer.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Per idag er det relativt f&aring; busser som sender sanntidsdata til Norsk Reiseinformasjon. Dette er b&aring;de en utfordring og en forretningsmulighet. Vi har ogs&aring; litt problemer med &aring; parse JSON-dataene fra APIet til Norsk Reiseinformasjon.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Vi har en fungerende prototype som gj&oslash;r brukeren i stand til &aring; chatte med boten via Facebook Messenger.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Facebook har nylig &aring;pnet et API for utvikling av boter for Messenger. Det vil v&aelig;re stort trykk p&aring; lansering av slike tjenester framover og vi tror at bot-grensesnitt vil f&aring; mye st&oslash;rre utbredelse enn hva vi ser idag. Det er ogs&aring; en rimelig teknologi og utvikle.
                </p>
                <h2>
                    What's next for @Askeladden
                </h2>
                <p>
                    Fase 1: F&aring; konseptet til &aring; fungere med et lokalt busselskap p&aring; H&oslash;nefoss med begrenset funksjonalitet - ruteopplysning og sanntidsinformasjon om bussene.
Fase 2: Selge l&oslash;sningen til andre busselskaper. Videreutvikle med nye finesser som brukerne vil ha.
Fase 3: Kommersialisere l&oslash;sningen bredt i hele Norden.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            norsk-reiseinformasjon
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
