<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="833954" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/833/954/datas/original.jpeg">
                            <img alt="Aula+ &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/833/954/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Somos un equipo que trabajamos en una universidad que tiene un porcentaje muy alto de estudiantes extranjeros. Algunas titulaciones las impartimos en ingl&eacute;s pero la mayor&iacute;a se imparten en espa&ntilde;ol. Para ayudarles a mejorar su conocimiento de espa&ntilde;ol y poder mejorar as&iacute; su integraci&oacute;n acad&eacute;mica y social nuestro equipo de transformaci&oacute;n digital hemos creado esta skill que estamos seguros les puede ayudar de una forma l&uacute;dica y eficaz a mejorar el nivel de espa&ntilde;ol.
                </p>
                <p>
                    Con nuestra skill, el usuario puede interactuar de varias formas: puede elegir aumentar vocabulario, practicar la escucha, hacer test y aprender gram&aacute;tica con ejercicios orales. La skill Aula+ est&aacute; pensada para mejorar cualquier nivel de espa&ntilde;ol. Queremos preparar ejercicios de nivel b&aacute;sico, medio y avanzado aunque en esta demo, tenemos preparados ejercicios de nivel A1
                </p>
                <p>
                    Cuando el usuario se conecta por primera vez, Alexa le pregunta si quiere hacer una prueba de nivel, o realizar directamente ejercicios de un nivel determinado. Alexa ofrece escoger entre los niveles A1, A2, B1, B2, C1 y C2. Cuando el estudiante elige un nivel determinado, entonces Alexa le da 4 opciones: gram&aacute;tica del d&iacute;a, vocabulario del d&iacute;a, ejercicios de audio o pruebas de nivel. El usuario puede interactuar con todos los tipos de ejercicios preparados. Una vez termina las prueba propuestas, Alexa le env&iacute;a una mensaje a su correo electr&oacute;nico con la puntuaci&oacute;n obtenida. Hemos visto que esta funci&oacute;n podemos desarrollarla con la API Game ON SDK pero en estos momentos no es posible implementarla puesto que se necesita autorizaci&oacute;n por parte de Amazon. No obstante, la hemos desarrollado con el env&iacute;o de la informaci&oacute;n a una base de datos externa que usaremos para explotar con Power bi (herramienta para crear cuadros de mando)
Mediante la API Reminders, Alexa recuerda al usuario a una hora determinada que tiene disponible la lecci&oacute;n del d&iacute;a. La Skill est&aacute; conectada al servicio de Dynamo BD para mantener el listado (clasificaci&oacute;n) de todos los usuarios. 
Si el usuario quiere, puede preguntar por su situaci&oacute;n en el ranking para saber el grado de avance
                </p>
                <p>
                    En un futuro nos gustar&iacute;a desarrollar esta skill en m&aacute;s idiomas y contemplamos la posibilidad de usar pantallas para realizar m&aacute;s tipos de ejercicios.
                </p>
                <p>
                    Nuestra skill ha sido construida directamente en la funci&oacute;n Lambda usando el almacenamiento de Bucket S3. Adem&aacute;s para el env&iacute;o de los mensajes al correo electr&oacute;nico, hemos usado Microsoft Flow y para crear los cuadros de mando con los resultados, hemos trabajado con Power BI. Para las m&eacute;tricas de uso de nuestra skill se crea autom&aacute;ticamente una hoja de c&aacute;lculo en Microsoft Excel que luego analizamos con Power BI.
                </p>
                <p>
                    Hemos aprendido que las posibilidades con los asistentes de voz son muchas y que adem&aacute;s el uso de esta tecnolog&iacute;a va a ser esencial en un futuro. Las nuevas generaciones ya est&aacute;n acostumbradas a buscar todo tipo de informaci&oacute;n a trav&eacute;s de voz. Por otro lado, queremos investigar y profundizar en las posibilidades de a&ntilde;adir APIs para mejorar todo tipo de interacciones con el usuario.
                </p>
                <p>
                    Por &uacute;ltimo, nos gustar&iacute;a a&ntilde;adir que nos ha encantado participar en este evento por su interesante reto y su gran organizaci&oacute;n. Much&iacute;simas gracias!
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            api
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            bucket
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            dynamo
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/excel">
                                excel
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/flow">
                                flow
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            lamda
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            powerbi
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            s3
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://bit.ly/2knIMRA" rel="nofollow" target="_blank" title="http://bit.ly/2knIMRA">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                bit.ly
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
