<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="487016" data-title="SplashScreen /registro" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/487/016/datas/original.jpg">
                            <img alt="AzomaG &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/487/016/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                SplashScreen /registro
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    o   El estr&eacute;s laboral en M&eacute;xico es un grave problema a nivel social y econ&oacute;mico, con problemas y hechos comprobables que perjudican a la sociedad. La forma en c&oacute;mo se libera el estr&eacute;s si no es tratando perjudicando la salud del trabajador.
o   Disminuye la productividad de las empresas, haci&eacute;ndolas menos rentables y competitivas.
o   La sociedad del rendimiento genera seres agotados y cansados, que la &uacute;nica manera que tienen para parar es enferm&aacute;ndose.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Se propone una aplicaci&oacute;n que nos permita fomentar las actividades para el desastres y llevar una serie de controles y seguimientos de un individuo que est&eacute; siendo afectado del estr&eacute;s. El proyecto proponemos abarca, desde recomendaciones de estrategias de desarrollo psicol&oacute;gico virtuales hasta invitar al usuario a la profunda valoraci&oacute;n social de la dignidad humana pasando por el cuidado del descanso y el tiempo libre, el fomento de la cultura y el deporte, la promoci&oacute;n de las actitudes y actividades solidarias, la protecci&oacute;n y el respaldo a la familia, la recuperaci&oacute;n del sentido del pudor en la moda y la publicidad, y un largo etc.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Desarrollado sobre React Native para la versi&oacute;n m&oacute;vil, la versi&oacute;n de administraci&oacute;n del portal web fue desarrollada sobre Angular JS, y los servicios web fueron montados con Heroku. Usa Smartphone, navegador web. En siguientes etapas se usaran dispositivos wearables para obtener feedback del estado de &aacute;nimo y f&iacute;sico del usuario.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Curva de aprendizaje, ingenieria de software, teamwork
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Presentacion, idea y generacion de valor
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    nuevas tecnologias
                </p>
                <h2>
                    What's next for AzomaG
                </h2>
                <p>
                    Desarrollo a conciencia de la aplicacion y uso de wearables
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/angular-js">
                                angular.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/heroku">
                                heroku
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react-native">
                                react-native
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            rest
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
