<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Beskrivelse av Badetemperaturer
                </p>
                <ol>
                    <li>
                        Hvilken kategori du konkurrerer i?
                    </li>
                </ol>
                <p>
                    Geodata
                </p>
                <ol>
                    <li>
                        Forklaring p&aring; hvordan tjenesten/l&oslash;sningen l&oslash;ser et spesifikt problem, forbedrer en situasjon og/eller leverer konkrete fordeler til de som skal bruke den.
                    </li>
                </ol>
                <p>
                    Badetemperaturer er en nettside (etter hvert en app) som viser deg n&oslash;yaktig temperatur i havet. Du kan s&oslash;ke p&aring; plasser, eller bruke din n&aring;v&aelig;rende plassering, slik at du f&aring;r opp egnede badeplasser i n&aelig;rheten med info om temperatur.
                </p>
                <p>
                    Eksempler p&aring; f&oslash;lgende problemer som l&oslash;ses: 
&bull; Er det fint v&aelig;r 1. juni kan det allikevel v&aelig;re vanskelig &aring; vite temp i vannet. Det samme gjelder p&aring; seinh&oslash;sten. Hvor mange grader er det egentlig? 
&bull; Isbadere er opptatt av hvor mange grader det er i vannet grunnet sikkerhet, og generelt behov for &aring; vite temperatur. Isbading er ogs&aring; definert som temperaturer under 2 grader.
&bull; Sj&oslash;-&oslash;rret-fiskere er opptatt av n&aring;r b&oslash;rstemarkene svermer, for da blir &oslash;rreten helt g&aelig;rn. B&oslash;rstemarken svermer bare p&aring; v&aring;ren n&aring;r temperaturen i havet er 6-8 grader.
&bull; Du er p&aring; bilferie langs kysten i Norge, eller er p&aring; vei til K&oslash;benhavn. Hvor kan du stoppe &aring; bade?
&bull; Tjenesten viser deg kart over alle omr&aring;der hvor bading er mulig. P&aring; den m&aring;ten kan man finne steder som f&aring; mennesker er, dersom man &oslash;nsker ro. Dette gj&oslash;r det ogs&aring; mulig &aring; se hvor man kan ferdes uten &aring; tr&aring;kke inn alle hager og private brygger som ligger langs strandsonen.
                </p>
                <ol>
                    <li>
                        Hvem som er med p&aring; laget, med kontakt informasjon (e-post / telefon).
                    </li>
                </ol>
                <p>
                    Anders Gire Dahl
                    <a href="mailto:gire.dahl@gmail.com" rel="nofollow">
                        gire.dahl@gmail.com
                    </a>
                    , 94 43 98 13
                </p>
                <p>
                    H&aring;var Skaugen
                    <a href="mailto:hskaugen@gmail.com" rel="nofollow">
                        hskaugen@gmail.com
                    </a>
                </p>
                <p>
                    Henrik Olsgaard, 4678 4679
                    <a href="mailto:henrikholsgaard@gmail.com" rel="nofollow">
                        henrikholsgaard@gmail.com
                    </a>
                </p>
                <p>
                    Mats Walle Almeland
                    <a href="mailto:walle.mats@gmail.com" rel="nofollow">
                        walle.mats@gmail.com
                    </a>
                    , 48138836
                </p>
                <p>
                    Erik Haider Fors&eacute;n, 470 50 032
                    <a href="mailto:erik@forsen.no" rel="nofollow">
                        erik@forsen.no
                    </a>
                </p>
                <ol>
                    <li>
                        Link(er) til datasett som benyttes av bidraget.
                    </li>
                </ol>
                <p>
                    Potensiell tilgjengelig strandsone:
                    <a href="https://kartkatalog.geonorge.no/metadata/statistisk-sentralbyra/potensielt-tilgjengelig-strandsone/560095e6-a6ac-4894-9f83-493f929eb327" rel="nofollow">
                        https://kartkatalog.geonorge.no/metadata/statistisk-sentralbyra/potensielt-tilgjengelig-strandsone/560095e6-a6ac-4894-9f83-493f929eb327
                    </a>
                </p>
                <p>
                    Havtemperatur:
                    <a href="https://kartkatalog.geonorge.no/metadata/meteorologisk-institutt/havtemperatur/7c34646c-4895-48f2-8c19-cb2ede7700fb" rel="nofollow">
                        https://kartkatalog.geonorge.no/metadata/meteorologisk-institutt/havtemperatur/7c34646c-4895-48f2-8c19-cb2ede7700fb
                    </a>
                </p>
                <ol>
                    <li>
                        Hvem m&aring;lgruppen er.
                    </li>
                </ol>
                <p>
                    Badeglade
Isbadere
&Oslash;rret-fiskere
Friluftslivsfolk 
Bilferie langs kysten
                </p>
                <ol>
                    <li>
                        Kort redegj&oslash;relse for forretningsideen.
                    </li>
                </ol>
                <p>
                    Badetid er en nettside (etter hvert en app) som viser deg n&oslash;yaktig temperatur i havet, samt potensielle egnede strandsoner (lett terreng uten innmark). Du kan s&oslash;ke p&aring; plasser, eller bruke din n&aring;v&aelig;rende plassering, slik at du f&aring;r opp egnede badeplasser i n&aelig;rheten med info om temperatur.
                </p>
            </div>
        </div>
    </body>
</html>
