<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="404902" data-title="Tela do aplicativo" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/902/datas/original.png">
                            <img alt="Bambino &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/902/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Tela do aplicativo
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Grande parte dos jovens ainda realizam transa&ccedil;&otilde;es com dinheiro em esp&eacute;cie. Ent&atilde;o nos perguntamos o porque de eles n&atilde;o utilizarem cart&otilde;es. Conclu&iacute;mos que na maioria das vezes os pais tem receios de que os filhos n&atilde;o tenham maturidade suficiente para ter controle do pr&oacute;prio dinheiro.
                </p>
                <p>
                    H&aacute; pouco tempo atr&aacute;s, era inconceb&iacute;vel que crian&ccedil;as e jovens tivessem seus pr&oacute;prios aparelhos telefones. Mas hoje em dia a realidade &eacute; diferente. N&oacute;s acreditamos que em um futuro pr&oacute;ximo os jovens ter&atilde;o um maior controle do seu pr&oacute;prio dinheiro e que eles portar&atilde;o cada vez menos dinheiro em esp&eacute;cie.
                </p>
                <p>
                    Pensando nisso, n&oacute;s resolvemos desenvolver uma solu&ccedil;&atilde;o que empodera os jovens e garante sua educa&ccedil;&atilde;o financeira.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    O produto consiste de um cart&atilde;o pr&eacute;-pago virtual para jovens.
                </p>
                <p>
                    Como pai, voc&ecirc; ter&aacute; acesso aos gastos do seu filho bem como op&ccedil;&otilde;es de dep&oacute;sitos autom&aacute;ticos peri&oacute;dicos.
                </p>
                <p>
                    Como filho, voc&ecirc; participar&aacute; de um "jogo": ao controlar seus gastos durante o m&ecirc;s e economizar de maneira consciente, voc&ecirc; ganhar&aacute; pontos de experi&ecirc;ncia e trof&eacute;us que poder&atilde;o ser convertidos em pr&ecirc;mios interessantes. Nada de conjunto de panelas ou torradeira, os pr&ecirc;mios incluem, por exemplo, cart&otilde;es presentes nas diversas lojas de aplicativos e jogos.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Em um primeiro momento, n&oacute;s definimos as tarefas e montamos um cronograma para implementarmos e entregarmos o projeto a tempo. Definido isso, n&oacute;s dividimos a equipe em 3 times: interface de usu&aacute;rio, backend e visualiza&ccedil;&atilde;o de dados.
                </p>
                <p>
                    Para a interface de usu&aacute;rio, utilizamos HTML5, CSS3, Javascript (jQuery) e Twitter Bootstrap. Escolhemos esse conjunto de tecnologias pois elas proporcionam um experi&ecirc;ncia responsiva (computador, tablet e mobile) e s&atilde;o amplamente suportadas.
                </p>
                <p>
                    Para o backend, utilizamos Ruby on Rails e SQLite. Esse stack foi escolhido pois permite um desenvolvimento &aacute;gil, como &eacute; requerido por um ambiente de hackathon.
                </p>
                <p>
                    Para a visualiza&ccedil;&atilde;o de dados, utilizamos a biblioteca gr&aacute;fica D3.js. Utilizamos essa biblioteca porque &eacute; moderna, poderoso e muito legal. :)
                </p>
                <p>
                    Por fim, para a demonstra&ccedil;&atilde;o hospedamos a aplica&ccedil;&atilde;o na nuvem da Digital Ocean.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    O maior desafio que tivemos foi encontrar um modelo de educa&ccedil;&atilde;o financeira que se adequasse as crian&ccedil;as, pois lidar com dinheiro &eacute; um assunto sens&iacute;vel ainda mais nessa faixa et&aacute;ria. Por isso, a concep&ccedil;&atilde;o do produto foi cautelosa afim de refor&ccedil;ar comportamentos que visam o amadurecimento financeiro dos jovens.
                </p>
                <p>
                    E &eacute; claro os v&aacute;rios bugs que surgiram e o sono da madrugada.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Estamos orgulhosos de termos pensado e trabalhado em uma ideia que acreditamos que ser&aacute; parte do futuros dos pagamentos no Brasil e possivelmente no mundo.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Lidar com dinheiro &eacute; dif&iacute;cil. Com o dos outros, mais ainda.
Al&eacute;m dos desafios t&eacute;cnicos, desenvolver um produto no mercado financeiro tem empecilhos burocr&aacute;ticos, sociais e &eacute;ticos.
                </p>
                <h2>
                    What's next for Bambino
                </h2>
                <p>
                    Mediante a aceita&ccedil;&atilde;o da ideia, a m&eacute;dio prazo n&oacute;s precisamos polir a interface, melhorar a infraestrutura e incrementar a seguran&ccedil;a. A longo prazo, poder&iacute;amos estender para m&uacute;ltiplas plataformas e ampliar as op&ccedil;&otilde;es de recompensas.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/d3-js">
                                d3.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/jquery">
                                jquery
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ruby-on-rails">
                                ruby-on-rails
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/lucasmoreira/Bambino" rel="nofollow" target="_blank" title="https://github.com/lucasmoreira/Bambino">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="http://104.236.41.195" rel="nofollow" target="_blank" title="http://104.236.41.195">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                104.236.41.195
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
