<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    La organizaci&oacute;n y cultura de pa&iacute;ses donde el uso de bicicleta es muy extendido.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Solo muestra un mapa :(, pero deber&iacute;a haber mostrado los talleres de bicicletas que existen en la ciudad, las gasolineras donde se puede echar aire a las llantas, beneficios para cilcistas (restaurantes que ofrecen algo gratis por llegar en bici, o estacionamiento para ciclistas), opci&oacute;n para trazar tu ruta y compatirla con tu circulo de amigos o alg&uacute;n grupo. Tambi&eacute;n se pens&oacute; en mostrar esa informaci&oacute;n solo si es relevante a la ruta trazada, asi como una opci&oacute;n para imprimirlo como tr&iacute;ptico por si no se quiere depender del celular y pensando en aquellos que no siempre est&aacute;n pegados al celular.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Usamos Ember.js para crear una SPA que mostrara con ayuda de mapbox.js un mapa con informaci&oacute;n relevante para los ciclistas as&iacute; como la opci&oacute;n de crear rutas.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Desarrollar un prototipo usable en poco tiempo y sin ayuda (nos hizo falta un backend developer y un dise&ntilde;ador)
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Nunca hab&iacute;a usado ember-cli ni mapbox.js asi que me siento orgulloso de haber aprendido a usar estas herramientas. Solo eso...
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Reaprend&iacute; que no tengo que asumir nada, ya que perd&iacute; mucho tiempo debido a esto. Como ejemplo, al hacer un wrapper para mapbox.js en Ember est&eacute; no se renderizaba. Cre&iacute; que era problema con los assets, despu&eacute;s con la implementaci&oacute;n del wrapper, y al final result&oacute; ser que mapbox.js al crear la instancia del map este no define una altura por default al elemento del dom donde se renderiza, cosa que asum&iacute; hacia como otras librerias. Al final solo le di una altura fija al elemento y todo fino. Deb&iacute; haber empezado por lo simple.
                </p>
                <h2>
                    What's next for bicio
                </h2>
                <ul>
                    <li>
                        Seguir con el desarrollo y crear una API con flask para consumir los datos con ember-data y volcar todos los datos en una BD relacional.
                    </li>
                    <li>
                        Pulir la idea
                    </li>
                    <li>
                        Darle promoci&oacute;n una vez que exista un prototipo usable
                    </li>
                </ul>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://eduarbo.github.io/bicio/" rel="nofollow" target="_blank" title="https://eduarbo.github.io/bicio/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                eduarbo.github.io
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
