<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiraci&oacute;n
                </h2>
                <p>
                    Transformar todos los procedimiento f&iacute;sicos y manuales de firmas manuscritas a procedimientos electr&oacute;nicos y en l&iacute;nea con plena validez legal en el Per&uacute; implementando una identidad digital (soberana) que permitir&aacute;:
                </p>
                <ul>
                    <li>
                        Disponibilidad 24x7 para firmar, certificar y recibir cualquier documento con valor legal.
                    </li>
                    <li>
                        Acceso a servicios sin desplazamiento f&iacute;sico.
                    </li>
                    <li>
                        Ahorro de costos operativos y consumibles.
                    </li>
                    <li>
                        Privacidad, seguridad y no repudio en las transacciones evitando fraudes y manipulaci&oacute;n de los documentos certificados.
                    </li>
                    <li>
                        Seguridad jur&iacute;dica.
                    </li>
                    <li>
                        Contribuci&oacute;n al medio ambiente gracias al cero papel.
                    </li>
                    <li>
                        Acelerar la implantaci&oacute;n de soluciones de gobierno electr&oacute;nico teniendo en el centro al ciudadano.
                    </li>
                </ul>
                <h2>
                    Qu&eacute; estamos haciendo
                </h2>
                <p>
                    Una soluci&oacute;n que permite generar, firmar y certificar documentos digitales con plena valides jur&iacute;dica en el Per&uacute; que sean inmutables e incorruptibles desde el momento de su creaci&oacute;n manejando un esquema de identidad soberana para cada uno de los ciudadanos en el Per&uacute;.
                </p>
                <h2>
                    C&oacute;mo lo hemos construido
                </h2>
                <p>
                    Somos un grupo de profesionales expertos en temas de Infraestructura Oficial de Firma Electr&oacute;nica en el pa&iacute;s, firmas digitales, sello de tiempo, tecnolog&iacute;as de registro distribuido DLT/Blockchain e implementaci&oacute;n de arquitecturas computacionalmente el&aacute;sticas y desarrollo de software.
                </p>
                <p>
                    Hemos tenido conversaciones con empresas en donde hemos identificado una necesidad y un gran problema alrededor de la automatizaci&oacute;n de los procesos de firma digital y electr&oacute;nica con valor legal y seguridad jur&iacute;dica.
                </p>
                <p>
                    Gracias a esta necesidad es que hemos planteado nuestra soluci&oacute;n de firma y certificaci&oacute;n de documentos soportado por una identidad digital con valor legal, seguridad jur&iacute;dica, transparencia e inmutabilidad de los documentos certificados.
                </p>
                <p>
                    Igualmente hemos tenido conversaciones de validaci&oacute;n de la soluci&oacute;n con notarios que han visto una oportunidad de innovaci&oacute;n en sus procesos convencionales al sumarse como parte de los actores de la soluci&oacute;n.
                </p>
                <p>
                    De otro lado hemos tenido retroalimentaci&oacute;n muy positiva con usuarios finales que ser&aacute;n los grandes beneficiarios de la soluci&oacute;n.
                </p>
                <h2>
                    Desaf&iacute;os que encontramos
                </h2>
                <p>
                    Los retos que encontramos en este proyecto han sido m&uacute;ltiples pero podemos mencionar los siguientes:
                </p>
                <ul>
                    <li>
                        Poder generar una identidad digital para los ciudadanos en el Per&uacute; que tenga valor legal y ofrezca seguridad jur&iacute;dica.
                    </li>
                    <li>
                        Poder involucrar a los notarios en la soluci&oacute;n y tengan los incentivos suficientes para adoptar la soluci&oacute;n.
                    </li>
                    <li>
                        Implementar un esquema de trazabilidad e inmutabilidad seguro y confiable de los documentos gestionados.
                    </li>
                    <li>
                        Implementar un modelo de negocios con claros incentivos y beneficios para todas las partes.
                    </li>
                    <li>
                        Implementar aplicaciones de una f&aacute;cil usabilidad con una muy buena experiencia usuaria.
                    </li>
                </ul>
                <h2>
                    Logros de los que estamos orgullosos
                </h2>
                <p>
                    Los logros de los que estamos orgullosos al d&iacute;a de hoy son los siguientes:
                </p>
                <ul>
                    <li>
                        Haber implementado una soluci&oacute;n de f&aacute;cil uso, segura y transparente para todos los involucrados.
                    </li>
                    <li>
                        Haber dise&ntilde;ado un esquema para involucrar a los notarios de una manera positiva y beneficiosa para ellos.
                    </li>
                    <li>
                        Haber implementado un esquema de generaci&oacute;n de identidad digital que cumpla con las mas altas exigencias jur&iacute;dicas en temas de documentos y certificados legales.
                    </li>
                    <li>
                        Haber implementado aplicaciones de un muy f&aacute;cil uso y una muy buena experiencia usuaria.
                    </li>
                </ul>
                <h2>
                    Lo que aprendimos
                </h2>
                <p>
                    Ufffff un mont&oacute;n de cosas, muchas experiencias vividas y saber que existe un grupo de personas con muchas ganas de solucionar problemas sociales y de gran impacto con un fuerte soporte tecnol&oacute;gico y experimentando con el potencial de las tecnolog&iacute;as de registro distribuido DLT/Blockchain. El equipo experto en Blockchain aprendi&oacute; mucho de la regulaci&oacute;n nacional y la Infraestructura oficial de firmas electr&oacute;nicas en el Per&uacute; y el equipo experto en firmas digitales aprendi&oacute; de las tecnolog&iacute;as de registro distribuido DLT/Blockchain con lo cual hicimos un complemento perfecto para el desarrollo de la presente soluci&oacute;n.
                </p>
                <h2>
                    &iquest;Qu&eacute; sigue para BigMagia - LoRecibi?
                </h2>
                <p>
                    El siguiente paso para el proyecto es el compromiso del equipo de BigDavi y Magia.Digital para poner en producci&oacute;n esta soluci&oacute;n
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/azure">
                                azure
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/blockchain">
                                blockchain
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/django">
                                django
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/postgresql">
                                postgresql
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react-native">
                                react-native
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            web3
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://docs.google.com/presentation/d/1dmAOw2hNF39psnADY88RVbT0pqknUxtPdx86C7GxyAU/edit?usp=sharing" rel="nofollow" target="_blank" title="https://docs.google.com/presentation/d/1dmAOw2hNF39psnADY88RVbT0pqknUxtPdx86C7GxyAU/edit?usp=sharing">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                docs.google.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
