<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Som b&aring;de travel sm&aring;barnsmor og klima- og milj&oslash;sjef i Ringerike kommune ville Bente gjerne b&aring;de spare tid i hverdagen og lokke folk til andre reisem&aring;ter enn &aring; kj&oslash;re hver sin bil.
Selv i H&oslash;nefoss har vi bilk&oslash;er som alle irriterer seg over og mange bruker un&oslash;dig mye tid p&aring; &aring; komme seg til og fra jobb, barnehage, skole og aktiviteter. For eksempel er det midt i H&oslash;nefoss et stort idrettsanlegg. Parkeringsplassen er full og smale gater har mye trafikk. 68% av klimagassutslippene i Ringerike kommer fra veitrafikk.
De fleste kj&oslash;rer hver sin bil. Det finnes ikke en samlet l&oslash;sning og funksjoner for &aring; avtale samkj&oslash;ring/g&aring;ing og sykling p&aring; ett sted. Og dette burde jo v&aelig;re mulig &aring; f&aring; til!
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    BliMe l&oslash;ser denne problemstillingen ved at den gj&oslash;r det enklere for foreldre &aring; koordinere samkj&oslash;ring til barnas fritidsaktiviteter
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    "Cleverly we started with a map". 
Ved &aring; ta utgangspunkt i et grunnkart brukte vi javascript, CSS, html5 og leaflet til &aring; finne en m&aring;te &aring; presentere denne l&oslash;sningen.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Koordinater fra Vegvesenets datasett var i ulikt format, UTM33 - ikke longitude og latitude. 
Var ogs&aring; vanskelig &aring; finne en m&aring;te &aring; f&aring; visjonen til &aring; ha en praktisk nytte for brukeren som n&oslash;dvendigvis ikke var en klima-orientert l&oslash;sning. Det m&aring;tte v&aelig;re mer verdi utover &aring; spare milj&oslash;et for brukeren.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    At vi klarte overkomme utfordringene med datasett og komme med et produkt.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    &Aring; bruke business model canvas.
&Aring; skalere ned ideen v&aring;r til en konkret l&oslash;sning ved &aring; ta hensyn til brukerbehovet.
                </p>
                <h2>
                    What's next for BliMe
                </h2>
                <p>
                    &Aring; f&aring; alle idrettslag, organisasjoner og bedrifter i Norge til &aring; BliMe!
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            kartverkets-wms-tjenester
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/leaflet-js">
                                leaflet.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            meteorologisk-institutt-vaerdata
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            vegkart
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/AndreasCanAtakan/Hack4No-project" rel="nofollow" target="_blank" title="https://github.com/AndreasCanAtakan/Hack4No-project">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
