<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="286993" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/286/993/datas/original.png">
                            <img alt="Bols&otilde;es S&atilde;o Paulo &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/286/993/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Com a grande quantidade de carros em vias movimentadas como a Fern&atilde;o Dias, &eacute; certo que haver&aacute; engarrafamentos e muitos acidentes no tr&acirc;nsito, al&eacute;m do stress e o tempo gasto na ida ao trabalho causando desgaste aos motoristas, diminuindo o tempo com a familia ou reduzindo a produtividade no trabalho. Al&eacute;m disso, os acidentes muitas vezes causados a ciclistas est&atilde;o muito mais frequentes, ciclistas esses que est&atilde;o perdendo seu espa&ccedil;o para os carros. A partir desses problemas, surge a ideia de implata&ccedil;&atilde;o de bols&otilde;es de carros e aplicativos para facilitar a gest&atilde;o de todo esse fluxo automobilistico.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    A ideia de implantar bols&otilde;es nao &eacute; uma novidade, o minist&eacute;rio p&uacute;blico e a USP ja pensavam nessa implanta&ccedil;&atilde;o em seu campus desde 2014. Mas a necessidade deles est&atilde;o cada vez maiores por toda cidade de S&atilde;o Paulo, e a utiliza&ccedil;&atilde;o de softwares e aplicativos faz o uso mais efetivo pois, existe uma necessidade do condutor em saber se h&aacute; vagas no bols&atilde;o que deseja estacionar, e tamb&eacute;m se os &ocirc;nibus que ele precisa pegar est&aacute; perto do estacionamento. Assim, h&aacute; uma aceita&ccedil;&atilde;o dessa ideia pois o utilizador ter&aacute; a certeza de uma vaga e que ir&aacute; chegar no hor&aacute;rio em seu trabalho ou local desejavel.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    O Aplicativo &eacute; composto pelas seguintes fun&ccedil;&otilde;es:
                </p>
                <p>
                    -Localizar meu carro: Essa fun&ccedil;&atilde;o &eacute; capaz de marcar o local onde voc&ecirc; estacionou e nao se perder dentro do bols&atilde;o, claro que &eacute; so uma alternativa pois com um ticket de estacionamento &eacute; possivel localiza-lo atrav&eacute;s de um indice.
                </p>
                <p>
                    -Mapa ou Mapa de bols&otilde;es: &Eacute; capaz de mostrar todos os lugares onde h&aacute; bols&otilde;es na regi&atilde;o, assim voc&ecirc; consegue se conduzir at&eacute; o local, sempre optando pelo melhor caminho.
                </p>
                <p>
                    -Hor&aacute;rio de Onibus: &Eacute; possivel que se verifique o horario de todos os onibus que passar&aacute; naquela regi&atilde;o com base 
em uma estimativa e os dados fornecidos sobre a companhia de transporte publico.
                </p>
                <p>
                    -Ver vaga: Com um sistema integrado aos bolsoes &eacute; poss&iacute;vel verificar se h&aacute; vagas neles e quantas, com um mapa do interior dos bols&otilde;es exibindo os locais exatos no momento, um sistema todo online e rapido.
                </p>
                <p>
                    -News: Os bols&otilde;es v&atilde;o aliviar o fluxo de transito, mas &eacute; inevit&aacute;vel ocorrer um engarrafamento, um acidente ou problemas na pista, com a fun&ccedil;&atilde;o News &eacute; possivel ver informa&ccedil;&otilde;es atulizadas sobre o transito, quais vias est&atilde;o congestionadas, quais est&atilde;o de livre acesso e etc.
                </p>
                <p>
                    -Duvidas?: Com uma novidade &eacute; normal acontecerem duvidas, como entrar em contato e outros. Assim, essa fun&ccedil;&atilde;o dinobiliza de um FAQ e ainda formas de contato.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    O tempo de desenvolvimento desse conteudo e das ideias foram realizadas em menos de 24hrs, pois tendo conhecimento do desafio 24hrs antes da data de entrega n&atilde;o &eacute; possivel desenvolver tais tarefas.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Mudar o fluxo dos carros ou procurar rotas alternativas n&atilde;o resolver&aacute; o problema de transito em S&atilde;o Paulo, a unica solu&ccedil;&atilde;o &eacute; facilitar que as pessoas usem mais onibus e assim reduzir o fluxo de carros. Desta maneira, o Bols&otilde;es S&atilde;o Paulo gerencia e facilita a aplica&ccedil;&atilde;o dessa iniciativa.
                </p>
                <h2>
                    What I learned
                </h2>
                <h2>
                    What's next for Bols&otilde;es S&atilde;o Paulo
                </h2>
                <p>
                    Os bols&otilde;es ainda n&atilde;o est&atilde;o implantados nas principais avenidas de S&atilde;o Paulo, ent&atilde;o, com a constru&ccedil;&atilde;o desse projeto h&aacute; a necessidade de um sistema r&aacute;pido e simplificado para ser integrado ao aplicativo Bols&otilde;es S&atilde;o Paulo.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
