<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="643746" data-title="Site web" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/643/746/datas/original.png">
                            <img alt="Canop&eacute;e ETS UQAM &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/643/746/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Site web
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nous ne savions pas ce qu'&eacute;tait la canop&eacute;e avant de voir le jeu de donn&eacute;es disponible sur donn&eacute;es Qu&eacute;bec. &Eacute;tant curieux, nous avons d&eacute;cid&eacute; d'explorer ces donn&eacute;es pour en apprendre davantage sur le sujet.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Notre app permet de voir la progression et la r&eacute;gression de la canop&eacute;e en comparant les donn&eacute;es d'ann&eacute;es diff&eacute;rentes pour un m&ecirc;me territoire.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Nous avons utilis&eacute; des librairies Python pour manipuler les donn&eacute;es et g&eacute;n&eacute;rer des statistiques &agrave; partir de celles-ci. Ensuite, nous avons utilis&eacute; React pour pr&eacute;senter ces donn&eacute;es dans une application web.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Les donn&eacute;es de 2007 et 2015 pour la ville de Montr&eacute;al n'&eacute;taient pas exactement sous le m&ecirc;me format. En effet, les donn&eacute;es de 2007 &eacute;taient s&eacute;par&eacute;es par quartier. Il a fallu remanier la structure pour pouvoir &eacute;tablir une comparaison entre 2015 et 2007.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Nous sommes contents d'avoir r&eacute;ussi &agrave; manipuler les donn&eacute;es ouvertes pour en g&eacute;n&eacute;rer une repr&eacute;sentation graphique. Nous croyons que ceci peut faire de notre un outil pour les gens qui &eacute;tudient la canop&eacute;e.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Nous avons appris que les donn&eacute;es ouvertes ne sont pas toujours faciles &agrave; manipuler. Comme mentionn&eacute; pr&eacute;cedemment, les donn&eacute;es d'une m&ecirc;me ville pour deux ann&eacute;es diff&eacute;rentes &eacute;taient pr&eacute;sent&eacute;es dans des formats diff&eacute;rents. Il a fallu faire preuve de d&eacute;brouillardise pour faire face &agrave; ce probl&egrave;me.
                </p>
                <h2>
                    What's next for Canop&eacute;e ETS UQAM
                </h2>
                <p>
                    La r&eacute;alisation de cette application nous a permis de se familiariser avec les donn&eacute;es ouvertes. Si elle n'a pas d'application r&eacute;elle, elle aura au moins servi &agrave; nous rendre compte de l'importance et de la pertinence de ces donn&eacute;es.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/flask">
                                flask
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react">
                                react
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            rest-api
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
