<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="788446" data-title="Sistema" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/788/446/datas/original.jpeg">
                            <img alt="Car Security System &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/788/446/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Sistema
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="788559" data-title="Shock" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/788/559/datas/original.jpeg">
                            <img alt="Car Security System &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/788/559/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Shock
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Estamos participando por el premio del dominio:
dominio: elgatitoprofetaprotectordelaseguridad.com
                    <a href="elgatitoprofetaprotectordelaseguridad.com" rel="nofollow">
                        link
                    </a>
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    M&eacute;xico enfrenta una situaci&oacute;n creciente en el robo de autopartes, al darnos cuenta de esta problem&aacute;tica, aunado a experiencias propias decidimos tomar acci&oacute;n.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Se trata de un sistema autom&aacute;tico que se activa cuando el usuario pone en marcha la alarma de autom&oacute;vil y se encuentra est&aacute;tico. Al momento de sentir un siniestro, el sistema notifica al propietario con la finalidad de entrar a un portal de internet que permite saber el estado del coche y tomar acciones pertinentes tales como prender un alarma o tiene la posibiidad de dar una descarga el&eacute;ctrica.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Tomamos como base una Raspberry Pi3 la cu&aacute;l nos permiti&oacute; desarrolllar c&oacute;digo en python, con ello implementamos c&oacute;digo apartir de librerias libres de GPIO para interactuar con el mundo f&iacute;sico, y el framework de flask para crea un servidor local. Por otra parte, la descarga el&eacute;ctrica se constuy&oacute; con de manera modular con aislamiento &oacute;ptico para proteger la circuiter&iacute;a interna. El sistema de alto voltaje esta compuesto por un chip TL-494, el cual es un multivibrador astable controlado por fibra &oacute;ptica para evitar ruido en los sistemas digitales. Todo este sistema controla un transformador de 18v de entrada hasta 20kv en su salida. Posteriormente el voltaje entra a un multiplicador de ganancia 3 para aumentar la salida hasta 60kv.
                </p>
                <h2>
                    Challenges I ran into.
                </h2>
                <p>
                    La fallida implementaci&oacute;n de Netcat con Named Pipes para tener una latencia peque&ntilde;a que p&eacute;rmita una imagen fluida en el servidor, luego otra problema que tuvimos fue la coordinaci&oacute;n de todos los framework y subprocesos corriendo al mismo tiempo, el hardware a utilizar y por &uacute;ltimo el tiempo.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Logramos implementar el sistema de detecci&oacute;n de cambios de inclinaci&oacute;n del veh&iacute;culo, adem&aacute;s de poder enlazarlo con el framework de Flask para poder encender o apagar los sistemas, y proporcionar video en una red local.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Se aprendi&oacute; al desarrollo de partes en conjunto, adem&aacute;s de la lecci&oacute;n de trabajar por etapas y tiempos definidos para reducir los errores, tambi&eacute;n el desarrollo de c&oacute;digo html en conjunto con python, y el uso del giroscopio en una raspberry.
                </p>
                <h2>
                    What's next for Car Security System
                </h2>
                <p>
                    Lo siguiente del sistema, es acondicionarlo a un sistema que incluya los espejos del carro, con la final de tener una defensa adicional, adem&aacute;s de mejorar el sistema con una aplicaci&oacute;n m&oacute;vil y m&aacute;s amigable.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            altium
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/flask">
                                flask
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/hardware">
                                hardware
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            libraries
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            motion
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/raspberry-pi">
                                raspberry-pi
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
