<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="566615" data-title="site para colaboradores postarem missoes" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/566/615/datas/original.jpg">
                            <img alt="Cidadania Inteligente &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/566/615/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                site para colaboradores postarem missoes
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="566619" data-title="site para colaboradores postarem missoes" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/566/619/datas/original.jpg">
                            <img alt="Cidadania Inteligente &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/566/619/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                site para colaboradores postarem missoes
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="566621" data-title="app do usu&aacute;rio" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/566/621/datas/original.PNG">
                            <img alt="Cidadania Inteligente &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/566/621/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                app do usu&aacute;rio
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="566622" data-title="app do usu&aacute;rio" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/566/622/datas/original.PNG">
                            <img alt="Cidadania Inteligente &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/566/622/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                app do usu&aacute;rio
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Trabalhar com tecnologia de &uacute;ltima gera&ccedil;&atilde;o &eacute; muito motivador, contudo, o Brasil sofre de grandes d&eacute;ficits nas &aacute;reas mais b&aacute;sicas da sociedade, como na educa&ccedil;&atilde;o, que alicer&ccedil;a todos os outros componentes de uma na&ccedil;&atilde;o. Dessa forma o projeto proposto, tem o vi&eacute;s educativo, e busca integrar o desenvolvimento tecnol&oacute;gico com a participa&ccedil;&atilde;o social.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Esse &eacute; um aplicativo para adolescentes cursando ensino fundamental ou m&eacute;dio, onde os usu&aacute;rios interagem no formato semelhante a um jogo de RPG, realizando miss&otilde;es, estas sempre voltadas &agrave; tem&aacute;tica de cidadania. Ao concluir miss&otilde;es ele pode evoluir o n&iacute;vel de seu personagem, que se torna um melhor cidad&atilde;o, com possibilidade de expandir para que o personagem assuma profiss&otilde;es e evolua com elas. As miss&otilde;es n&atilde;o s&atilde;o criadas pelos adolescentes, mas sim por membros da sociedade que possam ter algum tipo de relev&acirc;ncia neste contexto. Exemplos s&atilde;o: professores, profissionais da sa&uacute;de, curadores de museus, pedagogos, bibliotec&aacute;rios, outros funcion&aacute;rios do governo e outros. 
Existem muitas possibildades de miss&oacute;es para serem criadas para os adolescentes. Citamos abaixo os exemplos presentes no projeto atualmente:
Ir at&eacute; um museu espec&iacute;fico da cidade, fazer um &ldquo;check-in&rdquo; no app e depois responder uma pergunta sobre a exposi&ccedil;&atilde;o do museu;
Pesquisar sobre a dengue, responder perguntas, procurar pontos de &aacute;gua parada na sua casa, tirar uma foto de um deles, elimin&aacute;-lo e finalmente tirar uma foto com o ponto corrigido;
Apontamentos de problemas e sugest&otilde;es que os usu&aacute;rios verificarem na cidade em que moram. Esses apontamentos podem ser coletados e diivulgados ao governo e socidade;
Outras miss&otilde;es relacionadas ao bem estar social e reciclagem.
Todas as iniciativas que envolvem fotos, e outros tipos de respostas que n&atilde;o podem ser definidas automaticamente, passam pela aprova&ccedil;&atilde;o de um colaborador cadastrado no aplicativo.
Da mesma forma que o usu&aacute;rio &eacute; recompensado com conquistas e experi&ecirc;ncia para evoluir seu personagem caso realize miss&otilde;es, ele perde &ldquo;vida&rdquo; caso demore muito entre uma miss&atilde;o e outra.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    N&oacute;s quebramos o desenvolvimento em duas grandes &aacute;reas: estrutural e conte&uacute;do.
Estrutural, ou tamb&eacute;m codifica&ccedil;&atilde;o, foi dividida em back-end e front-end - partes independentes, mas que se comunicam. O back-end &eacute; um servidor Ruby on Rails que tanto serve json para o front-end m&oacute;vel, quanto controla o front-end web. O front-end m&oacute;vel &eacute; um web-app constru&iacute;do com PhoneGap baseando o framework onsen-ui, escrito em JavaScript.
A parte de conte&uacute;do teve foco em levantar informa&ccedil;&otilde;es para a cria&ccedil;&atilde;o de um contexto real para as miss&otilde;es baseado em problemas concretos - principalmente com prop&oacute;sito de apresenta&ccedil;&atilde;o.
Como pr&aacute;tica geral, n&oacute;s adotamos muitos m&eacute;todos &aacute;geis, por exemplo definimos como objetivo um MVP - Minimum Viable Product, Produto M&iacute;nimo Vi&aacute;vel.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    inicialmente, o maior desafio foi na proposi&ccedil;&atilde;o das atividades que iriam compor o game, j&aacute; que o objetivo era fazer um mecanismo interativo que prendesse a aten&ccedil;&atilde;o do p&uacute;blico alvo. com a defini&ccedil;&atilde;o do tema, as dificuldades t&eacute;cnicas surgiram principalmente no desenvolvimento da interface do app. Al&eacute;m disso, devido ao prazo estabelecido, o recorte tem&aacute;tico teve que ser pensado de forma que pudesse integrar tanto a participa&ccedil;&atilde;o do usu&aacute;rio, quanto a participa&ccedil;&atilde;o de stakeholders provenientes de diversos estratos sociais.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Durante o per&iacute;odo proposto para o desenvolvimento do projeto, foi gratificante elaborar o escopo de um mecanismo tecnol&oacute;gico que integra &aacute;reas diversas relacionadas ao desenvolvimento de cidades inteligentes. Al&eacute;m disso, a alta escalabilidade da plataforma tamb&eacute;m transmite ao grupo motiva&ccedil;&atilde;o para dar continuidade ao projeto, buscando ampliar a quantidade de usu&aacute;rios cadastrados, de forma a impactar mais na din&acirc;mica urbana contempor&acirc;nea.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Al&eacute;m dos conhecimentos desenvolvidos no &acirc;mbito t&eacute;cnico-acad&ecirc;mico envolvendo linguagens como Rails, Ruby, Phonegap, onsen ui, HTML, CSS e implementa&ccedil;&atilde;o de frameworks em aplicativos, tamb&eacute;m foram essenciais para a elabora&ccedil;&atilde;o do projeto as pesquisas acerca das &aacute;reas estruturais abordadas, bem como a pesquisa sobre o m&eacute;todo &aacute;gil (Lean) para o desenvolvimento, compila&ccedil;&atilde;o e implanta&ccedil;&atilde;o das ideias.
                </p>
                <h2>
                    What's next for Cidadania Inteligente
                </h2>
                <p>
                    Durante o per&iacute;odo de desenvolvimento conseguimos realizar o aplicativo com alguns exemplos de &ldquo;miss&otilde;es&rdquo; e &ldquo;problemas apontados&rdquo; pelo usu&aacute;rio, al&eacute;m de um site informativo com um espa&ccedil;o de sugest&otilde;es destinado aos stakeholders. O potencial do aplicativo est&aacute; concentrado em sua simplicidade e alta possibilidade de expans&atilde;o, tanto de p&uacute;blico alvo como de &aacute;reas atingidas. A conex&atilde;o professor-aluno &eacute; um grande diferencial do aplicativo, porque atrav&eacute;s dele, &eacute; poss&iacute;vel aprimorar o sistema educacional brasileiro, dinamizando conte&uacute;dos mon&oacute;tonos e, pelo sistema de gamifica&ccedil;&atilde;o, criar uma bonifica&ccedil;&atilde;o dentro de mat&eacute;rias espec&iacute;ficas. Para as atividades realizadas nas ruas, como as visitas a patrim&ocirc;nios culturais e apontamento de problemas, h&aacute; uma grande oportunidade de complementar com proje&ccedil;&otilde;es de realidade aumentada e uma interface similar &agrave; do jogo &ldquo;Pokemon Go&rdquo;. O aplicativo pode mudar o futuro da sociedade brasileira, aprimorando as no&ccedil;&otilde;es de cidadania e criando h&aacute;bitos nos jovens que poder&atilde;o perdurar por muitos anos.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            onsen-ui
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/phonegap">
                                phonegap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ruby-on-rails">
                                ruby-on-rails
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
