<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Team:
                    <strong>
                        TheMast3rs
                    </strong>
                    Ilyas Rahhali
Amine Bellahsen
Salim Benkirane
Abderrahim Khalifa
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Qui d&rsquo;entre nous n&rsquo;a jamais rencontr&eacute; la frustration de devoir sortir ses ordures seulement pour se retrouver devant des poubelles remplies &agrave; ras bord ? Ou encore de vivre &agrave; c&ocirc;t&eacute; de poubelles qui d&eacute;bordent constamment la veille pr&eacute;c&eacute;dent leur ramassage, conf&eacute;rant une teinte olfactive et visuelle d&eacute;licieuse au paysage ? Devant descendre &agrave; chaque fois pour v&eacute;rifier si une poubelle est remplie ou non, les entreprises de ramassage d&rsquo;ordures peuvent effectuer des routes loin d&rsquo;&ecirc;tre optimales, g&acirc;chant temps, argent et essence ; de pr&eacute;cieuses ressources.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    C'est pour faire face &agrave; cette probl&eacute;matique que Clean M entre en jeu. Notre solution permet de surveiller l'&eacute;tat de remplissage des poubelles en temps r&eacute;el, optimisant ainsi chaque tourn&eacute;e pour les poubelles les plus remplies en ne perdant pas de temps &agrave; v&eacute;rifier celles qui ne sont pas encore pr&ecirc;tes. Finie la n&eacute;gligence des poubelles &agrave; l&rsquo;&eacute;tat critique. Clean M permet aussi d'acc&eacute;der aux statistiques et &agrave; l&rsquo;historique de remplissage de chaque poubelle, fournissant alors une pr&eacute;diction pr&eacute;cise du temps restant pour un remplissage complet de la poubelle.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Nous avons utilis&eacute; le framework Flask et leaflet pour construire l'application ainsi que des algorithmes de clustering non supervis&eacute; et des algorithmes de VRP (vehicle routing problem) pour la tourn&eacute;e de v&eacute;hicule. Nous avons d&eacute;ploy&eacute; notre application sur Heroku.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    La documentation de leaflet &eacute;tant particuli&egrave;rement alambiqu&eacute;e, ce fut un d&eacute;fi de la d&eacute;coder et d'utiliser le service rapidement et correctement. Par ailleurs, &eacute;tant donn&eacute;e la courte dur&eacute;e de la comp&eacute;tition, nous n'avons pas pu lancer d'optimisation des routes de ramassage des camions poubelles car le probl&egrave;me de VRP est NP-difficile, et les meilleurs algorithmes prennent des jours (parfois des semaines) pour donner un routage optimal. On a alors d&ucirc; utiliser une heuristique plus rapide mais ne donnant pas une solution aussi bonne.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Nous sommes fiers d'avoir pu, pour la premi&egrave;re fois, concevoir une application web utilisant des donn&eacute;es de g&eacute;olocalisation ainsi qu'un suivi en temps r&eacute;el de plusieurs &eacute;l&eacute;ments en y int&eacute;grant un algorithme d'optimisation. Nous serions honor&eacute;s de voir le gain consid&eacute;rable de confort conf&eacute;r&eacute; aux citoyens ainsi qu'aux entreprises de ramassage de d&eacute;chets.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Nous avons appris &eacute;norm&eacute;ment de cette exp&eacute;rience, notamment sur le codage d&rsquo;une application web, le fonctionnement r&eacute;el des algorithmes d'optimisation de tourn&eacute;e de v&eacute;hicule ainsi que le fait d'apporter de la valeur &agrave; la ville est possible m&ecirc;me pour les &eacute;tudiants !
                </p>
                <h2>
                    What's next for Clean M
                </h2>
                <p>
                    Les prochaines &eacute;tapes pour Clean M sont l&rsquo;am&eacute;lioration de l'algorithme de routage optimal et l&rsquo;ajout de certaines fonctionnalit&eacute;s comme la possibilit&eacute; d'ajout et la suppression de poubelles, la possibilit&eacute; d'ajouter des &eacute;v&eacute;nements &agrave; une zone (affectant ainsi le taux de remplissage des poubelles dans la zone), d'ajouter une heatmap avec diff&eacute;rentes couleurs suivant la criticit&eacute; de la zone, une fonctionnalit&eacute; de suivi de performance (malus pour poubelles pleines n&eacute;glig&eacute;es et poubelles vides visit&eacute;es). Nous comptons aussi ajouter par la suite la possibilit&eacute; de diff&eacute;rencier entre les poubelles de d&eacute;chets compostables et non compostables (et peut &ecirc;tre aussi recyclables ou non).
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/flask">
                                flask
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ibm-watson">
                                ibm-watson
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/leaflet-js">
                                leaflet.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/ai404/clean-m-project" rel="nofollow" target="_blank" title="https://github.com/ai404/clean-m-project">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
