<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Equipo 32
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Falta de tiempo (para comer entre clases, horario laboral, etc), filas y lleno desmedido en restaurantes.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Al generar un usuario, se permite el acceso a la p&aacute;gina con un mapa que marca tu ubicaci&oacute;n y muestra los restaurantes m&aacute;s cercanos. Al seleccionar alg&uacute;n restaurante mostrar&aacute; su men&uacute;, y promociones permitiendo escoger cantidades y ordenar la comida v&iacute;a internet, tiene como reserva una tarjeta de cr&eacute;dito que proporcionar&aacute; el usuario para cargarle el importe, o la opci&oacute;n de pago en efectivo al llegar al restaurante. Al haber realizado el pedido desplegar&aacute; el tiempo aproximado de preparaci&oacute;n.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Se desarroll&oacute; en HTML, CSS y Javascript, usando HTML como estructura, y modificando sus elementos con CSS y la librer&iacute;a de Javascript JQuery, se utiliz&oacute; la API de Maps para desplegar el mapa.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    El lenguaje de programaci&oacute;n orientada a objetos como Javascript, cuenta de varias funciones ya predeterminadas, desconocidas por el equipo que debimos investigar.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Desarrollo de una p&aacute;gina web, interactiva.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Dichos lenguajes de programaci&oacute;n, el conocimiento de una estructura ligada a diversos archivos, trabajo en equipo, manejo de versiones.
                </p>
                <h2>
                    What's next for CMeal
                </h2>
                <p>
                    Mejorar el back-end y front-end del proyecto, hacerlo m&aacute;s efectivo, tal vez desarrollar una aplicaci&oacute;n m&oacute;vil.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/acmp1/CMeal" rel="nofollow" target="_blank" title="https://github.com/acmp1/CMeal">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
