<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Crowdfunding
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Colab prop&otilde;e-se a ser um portal que permite que pesquisadores anunciem as necessidades de recursos para o prosseguimento de sua pesquisa. Os projetos s&atilde;o cadastrados diretamente por docentes da USP com identidade confirmada. As necessidades dos projetos podem estar em tr&ecirc;s categorias: material, pessoal ou financeira. As car&ecirc;ncias materiais dizem respeito a equipamentos, mat&eacute;rias primas ou quaisquer outros insumos. Pessoas f&iacute;sicas ou jur&iacute;dicas podem entrar em contato diretamente com os respons&aacute;veis do projeto, caso tenham interesse de fazer uma doa&ccedil;&atilde;o ou empr&eacute;stimo.
Na parte de necessidades de pessoas, os pesquisadores podem anunciar a precis&atilde;o por profissionais de certas &aacute;reas que queiram colaborar com o projeto. Por fim, atrav&eacute;s se&ccedil;&atilde;o de necessidades financeiras, ser&aacute; poss&iacute;vel efetuar doa&ccedil;&otilde;es de quantias de dinheiro que ser&atilde;o depositadas em uma conta da Universidade destinada para esse fim e, posteriormente, repassada ao projeto em quest&atilde;o. &Eacute; importante ressaltar, que as doa&ccedil;&otilde;es ou empr&eacute;stimos realizados atrav&eacute;s dessa plataforma n&atilde;o oferecem quaisquer contrapartidas materiais ou financeiras, a n&atilde;o ser a contribui&ccedil;&atilde;o &agrave; pesquisa nacional.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    N&oacute;s usamos o framework Google MDL
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Diferenciais de outras plataformas
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Realizamos uma proposta que ajudar&aacute; a pesquisa
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Trabalho em equipe e a necessidade de um git
                </p>
                <h2>
                    What's next for Colab
                </h2>
                <p>
                    Backend
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/json">
                                json
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            mdl
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://www.linux.ime.usp.br/~andrewlopes/colab/index.html" rel="nofollow" target="_blank" title="https://www.linux.ime.usp.br/~andrewlopes/colab/index.html">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                www.linux.ime.usp.br
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://linux.ime.usp.br/~pedrohba/colab/" rel="nofollow" target="_blank" title="https://linux.ime.usp.br/~pedrohba/colab/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                linux.ime.usp.br
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
