<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    <a href="https://github.com/pedro823/HackathonUSP17" rel="nofollow">
                        https://github.com/pedro823/HackathonUSP17
                    </a>
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Conectoma surgiu a partir da necessidade de conectar alunos interessados em bolsas acad&ecirc;micas e professores. A plataforma se prop&otilde;e a facilitar a troca de informa&ccedil;&otilde;es e o contato entre as partes.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    A nossa p&aacute;gina principal disponibiliza uma lista de bolsas acad&ecirc;micas completa, com o nome do pesquisador respons&aacute;vel, &aacute;reas de conhecimento, palavras-chave, descri&ccedil;&atilde;o da pesquisa e outros. 
O docente poder&aacute; se cadastrar no site e publicar suas bolsas de pesquisa. Os estudantes podem visualizar as entradas e se inscrever nas que desejar.
A pesquisa pode ser feita de acordo com categorias como institui&ccedil;&atilde;o, &aacute;rea de conhecimento, palavras-chave e categoria de bolsa.
Fora isso, temos uma p&aacute;gina que mostrar&aacute; os docentes cadastrados na plataforma, e tamb&eacute;m o Ranking de Universidades e Institutos que mais disponibilizam bolsas.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    A nossa plataforma funciona em PHP. A p&aacute;gina principal disponibiliza o conte&uacute;do dinamicamente, de acordo com as publica&ccedil;&otilde;es dos docentes. O usu&aacute;rio docente, uma vez logado, tem acesso &agrave; submiss&atilde;o de propostas. A filtragem &eacute; feita atrav&eacute;s de classes implementadas em JS e HTML. A ferramenta de pesquisa procura por palavras-chave em cada entrada no banco de dados.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Inicialmente tentamos usar a framework ReactJS, que apresentou diversas dificuldades. Depois disso partimos de um template mais simples de HTML/CSS/JS e constru&iacute;mos o back-end de PHP.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Conseguimos implementar uma p&aacute;gina de login funcional, e uma p&aacute;gina principal com conte&uacute;do din&acirc;mico. Al&eacute;m disso o layout amadureceu ao longo do desenvolvimento, e o produto final est&aacute; bem acabado. Conseguimos, no tempo dado, montar uma base boa para o futuro crescimento do projeto.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Foi muito interessante ganhar experi&ecirc;ncia de trabalho de grupo num projeto real, com aplica&ccedil;&atilde;o concreta.
                </p>
                <h2>
                    What's next for Conectoma
                </h2>
                <p>
                    Temos uma base muito boa para escalar o projeto facilmente numa janela de tempo razoavelmente curta. O projeto poderia atender os alunos do IME e de outros institutos em pouco tempo.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/jquery">
                                jquery
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
