<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="378679" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/378/679/datas/original.png">
                            <img alt="contingencyAlert &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/378/679/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nos motiv&oacute; el conocer que la poblaci&oacute;n mexicana tiene grandes problemas de salud, y saber que podemos ayudar a la poblaci&oacute;n haciendo una aplicaci&oacute;n informativa con el objetivo de que las personas se enteren cuando haya una posible contingencia en el pa&iacute;s.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    contingencyAlert tiene la funcionalidad de recabar y censar informaci&oacute;n espec&iacute;fica del sentir de los usuarios para generar indicadores de una posible alerta de contingencia al detectar un patron de usuarios con algun problema en especifico y una area especifica. La aplicaci&oacute;n permite recabar la informaci&oacute;n y enviarla a un servidor para el almacenamiento y procesamiento de la informaci&oacute;n , posteriormente generar graficas e indicadores geolocalisables en un mapa de todos los usuarios con algun problema.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Nuestro proyecto esta desarrollado en varias tecnologias ya establecidas y que son algunas de las mas populares, como son Android Studio para la creaci&oacute;n de la aplicaci&oacute;n, un servidor PHP para el manejo de la informaci&oacute;n entrante y un servidor MySQL para el elmacenamiento de la informaci&oacute;n.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    contingencyAlert nace de la idea de apoyar a la sociedad de alguna forma,  en darles indicadores de que algo rraro puede estar sucediendo en la zona. Para el desarrollo de contingencyAlert hemos utilizado herramientas tecnologicas de desarrollo  como Android Studio , un IDE para crear aplicaciones moviles en android, una de las plataformas mas populares de dispositivos moviles, un servidor apache para manerar la recepcion de la informaci&oacute;n, en la red, y un servidor MySQL para el almacenamiento de la informaci&oacute;n.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Recursos clave software espec&iacute;fico para la realizaci&oacute;n de aplicaciones m&oacute;viles (android studio) un tel&eacute;fono con sistema operativo android con la api 16de android estudio versi&oacute;n 4.2 de android base de datos sq lite una computadora con 4gb en ram (minimo) 250gb en disco duro procesador inter core i5 o superior tarjeta gr&aacute;fica gforce xt925
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Nuestra aplicaci&oacute;n puede informar en tiempo real a la poblaci&oacute;n sobre las posibles contingencias que puedan ocurrir y asi de esta forma  se pueda tomar medidas precautorias para su prevenci&oacute;n
                </p>
                <h2>
                    What's next for contingencyAlert
                </h2>
                <p>
                    Redes Sociales. Blogs. Visitas presenciales a doctores, cl&iacute;nicas y hospitales para invitarlos a unirse. Clientes ("Recomendaci&oacute;n de persona a persona").
P&uacute;blico objetivo:
Usuarios de Smartphone que osilan ente los 18 y 40 a&ntilde;os de edad 
Paquetes Premium: diversos paquetes que incluir&iacute;an una cantidad de micro consultas y consultas, seg&uacute;n la especialidad requerida y los acuerdos logrados con los especialistas, as&iacute; como un historial m&aacute;s detallado. Comisiones en servicios: se cobrara una comisi&oacute;n del 5-15% en cada servicio
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
