<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="833965" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/833/965/datas/original.png">
                            <img alt="Vida saludable &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/833/965/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Esta skill nace con la idea de lograr una vida saludable promoviendo el ejercicio f&iacute;sico. Hemos creado esta skill bas&aacute;ndonos en experiencias personales y orientando a ese colectivo que no tiene tiempo de ir a gimnasios, salir a correr o hacer otro tipo de deporte.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Mediante comandos de voz, ofrece entrenamientos personales con distintos niveles de dificultad. Para cada nivel hay cuatro ejercicios distintos, en rondas de 20 segundos de actividad con 10 de descanso. Alexa gu&iacute;a en todo el proceso indicando el ejercicio a realizar y el comiendo y finalizaci&oacute;n del mismo.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Usando Amazon Alexa como asistente virtual y AWS en Kotlin para el back. Ejemplo de conversaci&oacute;n:
                    <a href="https://docs.google.com/document/d/1wvgY1QE0htZJWqQJXVoa4DYqoF_KfpyHbLZxsi30Ez0/edit?usp=sharing" rel="nofollow">
                        https://docs.google.com/document/d/1wvgY1QE0htZJWqQJXVoa4DYqoF_KfpyHbLZxsi30Ez0/edit?usp=sharing
                    </a>
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Algo que no hemos podido implementar ha sido la posibilidad de tener diferentes pistas de audio a la misma vez, por ejemplo, una lista de Spotify y las ordenes de Alexa durante el entreno. Adem&aacute;s hemos tenido que cubrir huecos de tiempo que eran silencios creando audios propios y esto ha ralentizado aparte de afectar a otras cosas que quer&iacute;amos hacer que no nos ha dado tiempo durante el hackaton.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    La creaci&oacute;n de una skill funcional a nivel de tipos de entrenamiento y poder mandarla a certificaci&oacute;n. Crear una skill + resolver los retos comentados arriba han sido muy interesantes.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Hemos aprendido, sobre todo, c&oacute;mo usar SSML en muchas casu&iacute;sticas que nos permiten mejorar la experiencia del usuario con nuestra skill. Est&aacute; enviada y en beta
                </p>
                <h2>
                    What's next for Vida Saludable
                </h2>
                <p>
                    Se nos han quedado varias cosas en el tintero:
                </p>
                <ul>
                    <li>
                        Generar ejercicios de forma m&aacute;s din&aacute;mica. Meter monetizaci&oacute;n comprando m&aacute;s paquetes de ejercicios para los distintos niveles de dificultad
                    </li>
                    <li>
                        Integrar m&uacute;sica durante las fases de realizaci&oacute;n de un ejercicio
                    </li>
                    <li>
                        Dar soporte a dispositivos Alexa con pantalla
                    </li>
                    <li>
                        Tener la capacidad de gestionar preferencias (ejercicios por g&eacute;nero, discapacidad, edad, condici&oacute;n f&iacute;sica, etc)
                    </li>
                </ul>
                <p>
                    Icons made by
                    <a href="https://www.flaticon.com/authors/smalllikeart" rel="nofollow">
                        smalllikeart
                    </a>
                    from
                    <a href="https://www.flaticon.com/" rel="nofollow">
                        www.flaticon.com
                    </a>
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/amazon-alexa">
                                amazon-alexa
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/amazon-web-services">
                                amazon-web-services
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            kotlin
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/kinisoftware/alexa-healthy-life" rel="nofollow" target="_blank" title="https://github.com/kinisoftware/alexa-healthy-life">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://docs.google.com/document/d/1wvgY1QE0htZJWqQJXVoa4DYqoF_KfpyHbLZxsi30Ez0/edit?usp=sharing" rel="nofollow" target="_blank" title="https://docs.google.com/document/d/1wvgY1QE0htZJWqQJXVoa4DYqoF_KfpyHbLZxsi30Ez0/edit?usp=sharing">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                docs.google.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
