<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="558488" data-title="f&oslash;rste side" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/488/datas/original.jpg">
                            <img alt="NORUSH &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/488/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                f&oslash;rste side
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="558489" data-title="andre side" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/489/datas/original.jpg">
                            <img alt="NORUSH &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/489/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                andre side
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="558490" data-title="brukeren velger blant spisesteder" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/490/datas/original.jpg">
                            <img alt="NORUSH &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/490/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                brukeren velger blant spisesteder
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Det finnes omtrent 2-6 prosent av befolkningen som f&aring;r en panikklidelse en eller annen gang i l&oslash;pet av livet. Rundt to tredeler av disse er kvinner. For oss &aring; reise til eller fra jobb i en stappfull buss eller sitte i en bil som st&aring;r fast i en k&oslash; i en tunnel er en stor utfordringen. Men det er ogs&aring; utfordring for byens milj&oslash; og luftkvalitet n&aring;r alle m&aring; dra hjem samtidig, blir lange k&oslash;er enda lenger.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    V&aring;r l&oslash;sningen gir brukeren et valg: reise hjem n&aring; og bruke XXX ekstra minutter i k&oslash; eller bruke den tiden her i byen og finne noe som passer deg og dine interesser. For eksempel, du kan g&aring; p&aring; museet som finnes i n&aelig;rheten (du har lyst &aring; bes&oslash;ke den, men har alltid d&aring;rlig tid :)), du kan g&aring; p&aring; kino eller finne et koselig spisested. Hva med &aring; g&aring; en tur i butikken for &aring; handle? Det er uendelig mange spennende muligheter. Valget er ditt!
                </p>
                <h2>
                    How we will build it
                </h2>
                <p>
                    <strong>
                        Datasets we are going to use:
                    </strong>
                    Kartverket: WMS-tjenester
Statens vegvesen: trafikkdata
Underskog.no: aktivitetskalender for Oslo.
NSB: data om forskinkelse(?)
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Folk med panikklidelser kan faktisk ha forskjellige symptomer eller oppleve forskjellige symptomer i forskjellige tidspunkter. Det kan v&aelig;re en utfordring &aring; designe en l&oslash;sning som passer aller angstformer. Det er ogs&aring; et sensitivt tema og det kan v&aelig;re utfordrende &aring; finne personer som kan delta i testing og gi tilbakemeldinger. Heldigvis det finnes flere organisasjoner som kan hjelpe med &aring; finne de riktige personer (for eksempel,
                    <a href="http://angstringen.no" rel="nofollow">
                        http://angstringen.no
                    </a>
                    ).
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    V&aring;r l&oslash;sningen er f&oslash;rst og fremst passer for folk med angst og panikklidelse for de har spesiell behov til &aring; unng&aring; stresssituasjoner. Men alle andre ogs&aring; kan benytte NORUSH appen. For eksempel den kan v&aelig;re nyttig for de som nettopp har flyttet til byen og vil bli bedre kjent. Eller for de som ogs&aring; hater rushtrafikk og vil satse p&aring; noe annet enn &aring; st&aring; i k&oslash;. I tillegg er det bedre for milj&oslash;et hvis en del bilister kan vente med &aring; kj&oslash;re hjem, i stedet for &aring; &ldquo;hjelpe&rdquo; &aring; lage enda st&oslash;rre k&oslash;er.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    En ide som ble inspirert av en person kan dekke en st&oslash;rre ettersp&oslash;rsel.
Det finnes mange fantastiske mennesker som vil hjelpe.
                </p>
                <h2>
                    What's next for NORUSH
                </h2>
                <p>
                    F&oslash;rst vi kan sette NORUSH med oppgitt funksjonalitetet ut i livet som betaversjon. Teste appen med de relevante brukerne, f&aring; tilbakemeldinger om n&oslash;dvendige forbedringer og jobbe videre med app-utviklingen. 
For eksempel, vi kan ta i bruk data om tog forskinkelse.
Vi kan ogs&aring; bruke machine learning og gi brukeren end&aring; bedre opplevelsen: basert p&aring; tidligere valg appen kan plassere tilbud i en riktig rekkef&oslash;lge (mer etterspurt tilbud vises f&oslash;rst).
                </p>
                <p>
                    <strong>
                        Prototype-design: Ann Kristin St&oslash;veren
                    </strong>
                </p>
            </div>
        </div>
    </body>
</html>
