<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    <strong>
                        Fran&ccedil;ais
                    </strong>
                    De nos jours, le recyclage des d&eacute;chets est un enjeu des plus important. Plus pr&eacute;cis&eacute;ment, pour des raisons environnementales et financi&egrave;res, on se doit de bien trier les d&eacute;chets que nous produisons. Malgr&eacute; les mesures mises en place pour trier les d&eacute;chets, comme les diff&eacute;rents bacs de d&eacute;chets, la probl&eacute;matique r&eacute;side dans le fait que la plupart des citoyens ne savent pas dans quel bac vont leurs d&eacute;chets. C&rsquo;est pourquoi nous avons d&eacute;cid&eacute; de cr&eacute;er un programme pour aider les gens &agrave; mieux trier leurs d&eacute;chets. Ce programme entre dans la cat&eacute;gorie de d&eacute;veloppement durable de ville intelligente.
                </p>
                <p>
                    <strong>
                        English
                    </strong>
                    Nowadays, waste recycling is an important challenge. To be precise, for environmental and financial reasons, we have to sort the trash we produce. Even with the measures put in place, such as the different trash bins available for sorting, there is still the issue that most citizens do not know which item goes into what bin. Therefore, we have decided to create a program to help people better sort their trash. This program is part of the sustainable development in the smart city.
                </p>
                <h2>
                    What it does // Ce que &ccedil;a fait
                </h2>
                <p>
                    <strong>
                        Fran&ccedil;ais
                    </strong>
                    Le programme prends une photo &agrave; partir de l'internet ou d'une base de donn&eacute;e et analyse l'image avec l'API "Computer Vision" d'Azure. En utilisant la sortie de la machine, qui consiste de mots-cl&eacute;s, il &eacute;tait possible de d&eacute;terminer dans quelle poubelle un certain type de d&eacute;chet appartenait. De plus, l'utilisateur est en mesure de retrouver cette m&ecirc;me information en faisant une recherche.
                </p>
                <p>
                    <strong>
                        English
                    </strong>
                    The program takes a picture from the web or a database and analyzes the picture with the Computer Vison API from Azure. Using the output of the machine, which consists of keywords, it was possible to determine into what bin each type of trash would go into. Additionally, the user is able to find that information with a search query.
                </p>
                <h2>
                    How we built it // Comment on l'a construit
                </h2>
                <p>
                    <strong>
                        Fran&ccedil;ais
                    </strong>
                    Nous avons import&eacute;s un API avec l'aide d'un mentor. La fonctionnalit&eacute; de tri a &eacute;t&eacute; cod&eacute;e avec une base de donn&eacute;e afin de trier les cat&eacute;gories de d&eacute;chets et de poubelles. Ensuite, le GUI a &eacute;t&eacute; construit puis impl&eacute;ment&eacute; afin que le programme soit fonctionnel.
                </p>
                <p>
                    <strong>
                        English
                    </strong>
                    We imported the API with the help of a mentor. The sorting functionality was coded with a database to sort the categories of trash and bins. Then, the GUI was built and implemented so that the program could be functional.
                </p>
                <h2>
                    Challenges we ran into // Les d&eacute;fis rencontr&eacute;s
                </h2>
                <p>
                    <strong>
                        Fran&ccedil;ais
                    </strong>
                    Nous avons chang&eacute; de language de programmation &agrave; mi-chemin. Au d&eacute;but, nous avions essay&eacute; d'importer l'API avec Java, par contre, il y avait plusieurs probl&egrave;mes avec cette m&eacute;thode. En fin de compte, nous avions d&eacute;cid&eacute; d'essayer avec python et, heureusement, cela a fonctionn&eacute;.
                </p>
                <p>
                    <strong>
                        English
                    </strong>
                    We changed programming language halfway. At first, we tried importing the API with Java, however there were a lot of issues with that method. In the end, we decided to try with python and, thankfully, it worked.
                </p>
                <h2>
                    Accomplishments that we're proud of // Accomplissements auquel nous sommes fi&egrave;res
                </h2>
                <p>
                    <strong>
                        Fran&ccedil;ais
                    </strong>
                    Nous avons r&eacute;ussi &agrave; faire fonctionner notre programme en seulement 24h, et ce en changeant de langage de programmation &agrave; mi-chemin. De plus, nous sommes des &eacute;tudiantes de premi&egrave;re ann&eacute;e et nous avons tout de m&ecirc;me r&eacute;alis&eacute; un projet dans lequel nous avions aucune connaissance ou presque.
                </p>
                <p>
                    <strong>
                        English
                    </strong>
                    We managed to make a program that works in the time that we had, even with the added hurdle of changing the programming language halfway. Also, we're first year students and we still managed to finish a project in which we almost had no prior knowledge.
                </p>
                <h2>
                    What we learned // Ce que nous avons appris
                </h2>
                <p>
                    <strong>
                        Fran&ccedil;ais
                    </strong>
                    &Ecirc;tre mieux prepar&eacute; pour notre prochain Hackathon, c&rsquo;est-&agrave;-dire faire le brainstorming au pr&eacute;alable et s&rsquo;assurer que le projet est r&eacute;alisable en 24h. Nous avons &eacute;galement appris un nouveau langage de programmation, comment utiliser des APIs et le logiciel Qt.
                </p>
                <p>
                    <strong>
                        English
                    </strong>
                    Be better prepared before a hackathon. We could have brainstormed ideas before the hackathon in order to be sure that the project is possible in 24h. We also learned another programming language and how to use APIs in addition to the Qt program.
                </p>
                <h2>
                    What's next for deTRItus // La suite pour deTRItus
                </h2>
                <p>
                    <strong>
                        Fran&ccedil;ais
                    </strong>
                    Cr&eacute;ation d&rsquo;une application mobile avec l&rsquo;ajout de certaines fonctionnalit&eacute;s tel que :
                </p>
                <ul>
                    <li>
                        Ajout d&rsquo;un GPS avec les lois de tri des d&eacute;chets propres &agrave; chaque ville
                    </li>
                    <li>
                        Ajout des horaires et des emplacements des centres de collecte de d&eacute;chets proche de votre emplacement (tel que les friperies, collectes de d&eacute;chets &eacute;lectroniques, d&eacute;chets chimiques, etc.)
                    </li>
                </ul>
                <p>
                    Commercialisation :
                </p>
                <ul>
                    <li>
                        Application gratuite pour les utilisateurs
                    </li>
                    <li>
                        Possibilit&eacute; de mon&eacute;tisation aupr&egrave;s des villes
                    </li>
                </ul>
                <p>
                    <strong>
                        English
                    </strong>
                    Creation of a mobile application with the addition of the following functionalities:
                </p>
                <ul>
                    <li>
                        Adding GPS implementation and changing waste categories according to each cities regulations.
                    </li>
                    <li>
                        Adding the hours and the places of the waste collection centres close to our current location (i.e. thrift shops, collection of electronic waste, chemical waste, etc.)
                    </li>
                </ul>
                <p>
                    Commercialization:
                </p>
                <ul>
                    <li>
                        Free mobile app for the users
                    </li>
                    <li>
                        Possible revenue from the cities available in the app
                    </li>
                </ul>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            api
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/qt">
                                qt
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/kadesc/Hackatown2020" rel="nofollow" target="_blank" title="https://github.com/kadesc/Hackatown2020">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
