<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="558478" data-title="Skjermbilde1" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/478/datas/original.png">
                            <img alt="Arbeidsmarkedsbarometer &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/478/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Skjermbilde1
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="558479" data-title="Skjermbilde2og3" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/479/datas/original.png">
                            <img alt="Arbeidsmarkedsbarometer &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/479/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Skjermbilde2og3
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Innleveringsskjema #hack4no 2017
                </h2>
                <p>
                    Navn p&aring; laget  : Arbeidsmarkedsbarometer- Who&rsquo;s  Hot and Who&rsquo;s NOt
Navn p&aring; deltakerne : Tov Are Jacobsen,  Silje Andersen, Rupinder Kaur Sethi
                </p>
                <h2>
                    Inspirasjon
                </h2>
                <p>
                    Vi har lagt ut data som vi ikke har pulisert tidligere.
                </p>
                <p>
                    Manglende mobilitet er en identifisert problemstilling i arbeidsmarkedet, som hindrer et enda mer velfungerende arbeidsmarked der det er match mellom tilbud og ettersp&oslash;rsel. Mange blir fanget av bransjen de jobber i eller stedet de bor. En analyse av hva som skjedde med oljeingeni&oslash;rene, viste at yrkesmobiliteten var st&oslash;rre enn antatt.
                </p>
                <p>
                    Vi mener kan stemme for andre yrker ogs&aring; og &oslash;nsker &aring; vise dette til flere, slik at flere blir inspirert til &aring; flytte p&aring; seg til bransjer der etterspr&oslash;rselen er stor.
                </p>
                <h2>
                    Kort oppsummering av l&oslash;sningen:
                </h2>
                <p>
                    Vi lager en l&oslash;sning hvor brukeren kan legge inn sitt yrke og f&aring; forslag p&aring; hvilke bransjer som ansetter den yrkesgruppen n&aring;. Videre kan brukeren klikke p&aring; bransje og f&aring; en geografisk visning.
                </p>
                <h2>
                    Hvilke data er brukt
                </h2>
                <ul>
                    <li>
                        Antall nye ansatte med yrke, n&aelig;ring, geografi  i AA register 2016
                    </li>
                    <li>
                        Mangel p&aring; arbeidskraft v&aring;r 2017
                    </li>
                    <li>
                        Aktive ledige stillinger fra nav.no
                    </li>
                </ul>
                <h2>
                    Forretningsmodell:
                </h2>
                <p>
                    Vi lager en l&oslash;sning som vi fritt gj&oslash;r tilgjengelig  for flere akt&oslash;rer slik at man oppn&aring;r st&oslash;rre kunnskap om arbeidsmarkedet for enkeltpersoner og organisasjoner,  som igjen bidrar til &aring; &oslash;ke yrkes- og bransjemobilitet i det norske arbeidsmarkedet.
                </p>
                <h2>
                    Teknologivalg/koding:
                </h2>
                <p>
                    Mobiltilpasset webl&oslash;sning hvor hele tjenesten er basert p&aring; anonyme datasett som er tilgjengelig i &laquo;skyen&raquo; noe som gj&oslash;r det mulig med rask skalering av tjenesten dersom den viser seg &aring; v&aelig;re popul&aelig;r.
                </p>
                <p>
                    Den tekniske leveransen er tenkt som en 3-tier applikasjon, hvor prosesser for innh&oslash;sting av data fra &aring;pne kilder og tekstanalyse populerer en hurtig database i skya som er optimalisert for hastighet. Statiske assets til grensesnittet b&oslash;r enkelt kunne leveres via et innholdsdistribusjonsnettverk.
                </p>
                <ul>
                    <li>
                        Enkel API tilgang for alle elementer i l&oslash;sningen, inklusiv autocomplete for s&oslash;k etter yrke.
                    </li>
                    <li>
                        En web-basert referansel&oslash;sning som skjermbilder.
                    </li>
                </ul>
                <p>
                    Alt skal v&aelig;re &aring;pent, slik at andre akt&oslash;rer i markedet kan integrere funksjonaliteten for &aring; &oslash;ke verdien av egne produkter.
                </p>
            </div>
        </div>
    </body>
</html>
