<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    El hambre de contribuir con nuestros conocimientos tecnol&oacute;gicos de manera favorable en el desarrollo econ&oacute;mico, social y cultural de Dolores Hidalgo Cuna de la Independencia, ya que representa el inicio de nuestra pertenencia como mexicanos.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Se busca crear un _ Ecosistema Tur&iacute;stico _ en la ciudad de Dolores Hidalgo en el que las distintas actividades econ&oacute;micas y tur&iacute;sticas logren una sinergia al convivir entre ellas y as&iacute; lograr un mayor desarrollo econ&oacute;mico, todo ello centr&aacute;ndose en ofrecer experiencias que le generen v&iacute;nculos emocionales a los turistas y por consecuencia, prefieran alargar su estad&iacute;a en la ciudad. Esto se lograr&aacute; con el uso de tecnolog&iacute;as, tales como, una plataforma web en la que se den a conocer las distintas experiencias que se pueden vivir en el lugar, pantallas en puntos estrat&eacute;gicos de la ciudad con implementaci&oacute;n de realidad aumentada y un mapa virtual did&aacute;ctico de los puntos de mayor inter&eacute;s.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    El sitio web, el mapa did&aacute;ctico y la implementaci&oacute;n fueron creados con html, javascript y php. Tambi&eacute;n se utiliz&oacute; la API de Snapchat, sin embargo, se espera a&uacute;n la respuesta de la empresa para el uso de algunos filtros creados en la misma plataforma.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    La burocracia de Snapchat para su uso, falta de conexi&oacute;n entre las distintas herramientas desarrolladas y la carencia de informaci&oacute;n precisa sobre el turismo en la ciudad.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    La soluci&oacute;n de las adversidades que se nos presentaban a lo largo del evento, tanto t&eacute;cnicos, como de conocimientos.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Desarrollo Javascript y creaci&oacute;n de un chatbot
                </p>
                <h2>
                    What's next for DHI Experiences
                </h2>
                <p>
                    Si se consigue apoyo, darle seguimiento para su aplicaci&oacute;n real.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            bot
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            chatfuel
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/facebook">
                                facebook
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
