<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Le co&ucirc;t de la vie &agrave; Montr&eacute;al devient tr&egrave;s difficile &agrave; absorber pour les Montr&eacute;alais classes sociales non ais&eacute;es. Les petits logements se louent &agrave; des prix dans les 4 chiffres, pourtant, les revenus n'augmentent pas proportionnelement. On observe, sur les m&eacute;dias sociaux, un mouvement d'entraide &eacute;mergent, une &eacute;conomie de partage est in&eacute;vitable. Les gens se comptent par dizaines de milliers sur les groupes facebook de dons ou la vente est interdite et les personnes dans le besoin trouve rapidement de l'aide. Parallement, on observe aussi que un grand nombre de Montr&eacute;alais donnent des objets de grandes valeur, par la simple motivation d'aider son suivant. Nous somme donc face a une probl&eacute;matique urbaine majeure, et un grand bassin d'utilisateurs potentiels. Or il ne semble exister aucune application logicielle d&eacute;di&eacute;e &agrave; ce type de mouvement.
                </p>
                <h2>
                    Ce que l'app fait
                </h2>
                <p>
                    Essentiellement, l'app a pour objectif de donner un outil plus efficace que les groupes existants sur les m&eacute;dias sociaux, permettre des recherches par cat&eacute;gories pour les dons et les demandes d'aide. Utiliser un syst&ecirc;me de "Karma" pour motiver plus de gens a joindre le mouvement en motivant les gens a donner au suivant.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Il s'agit, pour le moment, d'une app web reposant sur une architecture traditionelle
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Nous no sommes pas experts en web, ni en base de donn&eacute;e, pour cette raison nous avons pass&eacute; plus de temps &agrave; nous battre avec css/html que sur la logique et l'interface de notre application qui se veut persuasive par motivation.
                </p>
                <h2>
                    Ce dont on est fier
                </h2>
                <p>
                    L'esprit bienfaisant derri&egrave;re l'id&eacute;e et le fait d'avoir mis en &eacute;vidence une prob&eacute;matique criante pour laquelle peu d'outil existent
                </p>
                <h2>
                    Ce qu'on a appris
                </h2>
                <p>
                    Angular n'aime pas jquery
experience avec html/css/js
                </p>
                <h2>
                    Et ensuite, pour Donner au suivant:
                </h2>
                <p>
                    Am&eacute;lioration de l'interface utilisateur, nottament un impl&eacute;mentation motivante du Karma
Questionnement majeur au niveau de la s&eacute;curit&eacute; et de la pr&eacute;vention d'abus
Impl&eacute;mentation d'api publicitaire pour assurer la maintenance et la persistance de l'app
Portage sur platteformes mobiles
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            classic-web-html-js-css-sql
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/michaellt/hackatown" rel="nofollow" target="_blank" title="https://github.com/michaellt/hackatown">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
