<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="433232" data-title="#drittfrittkampanjen - 2015 (bilde hentet fra kampanjen)" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/232/datas/original.jpg">
                            <img alt="DrittFritt &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/232/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                #drittfrittkampanjen - 2015 (bilde hentet fra kampanjen)
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433234" data-title="Kampanjen #drittfritt - 2015" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/234/datas/original.jpg">
                            <img alt="DrittFritt &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/234/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Kampanjen #drittfritt - 2015
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433236" data-title="Milj&oslash;stasjoner" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/236/datas/original.jpg">
                            <img alt="DrittFritt &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/236/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Milj&oslash;stasjoner
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433243" data-title="Milj&oslash;stasjon" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/243/datas/original.jpg">
                            <img alt="DrittFritt &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/243/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Milj&oslash;stasjon
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433244" data-title="Eat shit and die(t)" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/244/datas/original.jpg">
                            <img alt="DrittFritt &ndash; screenshot 5" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/244/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Eat shit and die(t)
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433235" data-title="Ett sjakktrekk!" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/235/datas/original.jpg">
                            <img alt="DrittFritt &ndash; screenshot 6" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/235/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Ett sjakktrekk!
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433242" data-title="Forn&oslash;yde innbyggere" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/242/datas/original.jpg">
                            <img alt="DrittFritt &ndash; screenshot 7" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/242/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Forn&oslash;yde innbyggere
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspirasjon
                </h2>
                <p>
                    Inspirasjon er hentet fra en kampanje i Troms&oslash;. #Drittfritt, en kampanje i 2015, som skulle oppfordre f&aring; folk til &aring; plukke opp hundedritt. Utfordringen gikk ut p&aring; &aring; ta bilde relatert til hundedrittopplukking og tagge et bilde av dette p&aring; instagram. Kommunen, ved prosjektleder for Troms&oslash;markaprosjektet, var initiativtaker til dette og fikk med seg n&aelig;ringslivet (Troms&oslash; Veterin&aelig;rsenter) inn som en deltakende part i kampanjen. Motivasjonen for borgerne l&aring; i det &aring; f&aring; ett bilde publisert, p&aring; instagram, og muligheten for &aring; vinne ett flaxlodd.
                </p>
                <h2>
                    Problem/Behov
                </h2>
                <p>
                    <strong>
                        1. Hundedritt:
                    </strong>
                    Frustrasjon for borgere over &aring; tr&oslash; i hundedritt. Hundeeiere orker ikke b&aelig;re pose langt. Posene er et milj&oslash;problem.
                </p>
                <p>
                    <em>
                        Behov:
                    </em>
                    Flere bokser utplassert. Vite hvor man kan kaste drittposen.
                </p>
                <p>
                    <strong>
                        2. S&oslash;ppel:
                    </strong>
                    Sofaer, hvitevarer o.l. som folk slenger fra seg, i naturen. Marint s&oslash;ppel som flyter inn i fjordene, og blir liggende i fj&aelig;ra, er b&aring;de til sjenanse og et stort milj&oslash;problem. F&oslash;rer ogs&aring; til forurensning i form av lekkasjer fra kjemikalier m.m.
I tillegg gj&oslash;r dette stor skade p&aring; fugle- og fiskebestanden, som har kysten og havet, som matfat.
                </p>
                <p>
                    <em>
                        Behov:
                    </em>
                    En plass &aring; innrapportere om s&oslash;ppel, forurensning man kommer over, eller har samlet inn ved eget initiativ.
                </p>
                <p>
                    <strong>
                        <em>
                            Hva kan appen tilby?:
                        </em>
                    </strong>
                </p>
                <p>
                    <strong>
                        Hundedritt:
                    </strong>
                </p>
                <ul>
                    <li>
                        Avfallsbokser som vises i et kart i en mobil-app.
                    </li>
                    <li>
                        Innregistrering av eksisterende bokser fra bruker, samt egen husholdningsboks. (Da blir de lettere &aring; finne enn ett p&aring;klistret merke).
                    </li>
                    <li>
                        Registrering av hvor det burde v&aelig;re en avfallsboks, f.eks. i marka, popul&aelig;re turdestinasjoner.
                    </li>
                    <li>
                        Premiering av de som registrerer.
                    </li>
                </ul>
                <p>
                    <strong>
                        Nytteverdi:
                    </strong>
                    Hundeeiere f&aring;r ett hjelpemiddel, folk slipper &aring; irritere seg, skiporet blir rent, naturen slipper plast. I tillegg f&aring;r man hjelp fra bruker om hvor det er behov for bokser. Samfunnsmessig er dette til hjelp for kommunene som f&aring;r brukerne inn p&aring; banen, og en lettere m&aring;te &aring; administrere innrapportering ved bruk av databaser og nettsted.
                </p>
                <p>
                    <strong>
                        S&oslash;ppel:
                    </strong>
                </p>
                <ul>
                    <li>
                        Innrapportering (posisjonsdata).
                    </li>
                    <li>
                        Premiering av innrapportering
                    </li>
                </ul>
                <p>
                    <strong>
                        Nytteverdi:
                    </strong>
                    Kommunen f&aring;r innrapportert s&oslash;ppelregistreringene inn i en database, via appen til en portal (webside), som fungerer som ett verkt&oslash;y/hjelpemiddel. Det blir enklere for folk &aring; varsle om milj&oslash;synding, impulsiv s&oslash;ppelplukking, f.eks. i fj&aelig;ra, slik at kommunen kan hente avfallet. Trekker veksler fra REN KYST-prosjektet i markedsf&oslash;ringen. (Flere kommuner i Troms, med st&oslash;tte fra milj&oslash;direktoratet, har i prosjektet som m&aring;l &aring; informere om marin fors&oslash;pling, samt &aring; rydde kysten for s&oslash;ppelet).
                </p>
                <h2>
                    Hvordan bygde vi appen
                </h2>
                <p>
                    Vi startet med &aring; se p&aring; Leaflet sin dokumentasjon og veldig flotte begynnerguide for &aring; kunne ha litt forst&aring;else for hvordan man kan rendere
kart med JScript ressurser. N&aring;r vi ble mer komfortable begynte vi &aring; bytte ut Leaflet sin eksempelkode med v&aring;re egne koder og egne datasett.
For &aring; gj&oslash;re dette var det vitalt at vi studerte koden n&oslash;ye slik at vi kunne gj&oslash;re de endringene vi ville ha uten &aring; gj&oslash;re noe skade p&aring; resten
av funksjonaliteten.
                </p>
                <p>
                    Deretter utforsket vi verkt&oslash;ykassen som vi fikk her p&aring; hack4 og fant ut av hvordan man bruker markers og geolokasjon for eksempel.
                </p>
                <p>
                    Vi hadde ett relativt forvirrende datasett med JSON som beskrev med koordinater til hvor alle benker og hundebokser som finnes i Troms&oslash; er.
Etter &aring; ha brukt litt tid p&aring; &aring; rydde opp JSON dataen til &aring; bli nogenlunde lesbar s&aring; sammensatte vi en funskjon som sortere vekk all dataen vi ikke trengte
og en annen funskjon som satte opp fargerike mark&oslash;rer p&aring; alle koordinatene som kom seg gjennom filteret.
Disse mark&oslash;rene ble satt overraskende bra ut med de koordinatene vi ble gitt, vi har ikke sett ett eneste punkt som ser ut som de er inni ett hus eller
lignende, s&aring; vi klarte faktisk utrolig nok &aring; kartlegge hver eneste hundeboks i Troms&oslash; mens vi satt komfortabelt i H&oslash;nefoss.
                </p>
                <p>
                    Samtidig som vi utviklet nettsiden s&aring; var vi ogs&aring; i gang med &aring; lage en app som skulle kunne lese nettsiden og tillf&oslash;ye ekstra funksjonalitet.
Men dette var ikke s&aring; lett som vi f&oslash;rst hadde trodd fordi web klienten som brukes ville absolutt ikke gi oss lov til &aring; be om koordinatene v&aring;re. Vi fant
til slutt ut hva feilen var men det var ikke f&oslash;r vi fant ut alle m&aring;tene det ikke var galt og ett par samtaler med mentorene p&aring; kampus.
                </p>
                <h2>
                    Utfordringer vi m&oslash;tte p&aring; veien
                </h2>
                <p>
                    Underveis i prosessen var tankene rundt hvem som kan v&aelig;re samarbeidspartner til prosjektet og hvem skal v&aelig;re m&aring;lgruppe, da hundeeiere blir veldig snevert. Hvordan f&aring; til en type kjedet prosess hvor man fyller behovet til b&aring;de brukerene av appen, kommunen og innbyggerne/samfunnet. Mer om utfordringer i forrige avsnitt.
                </p>
                <h2>
                    Prestasjoner vi er ekstra forn&oslash;yde med
                </h2>
                <p>
                    Ideen er b&aring;de nytenkende, ett hjelpsomt verkt&oslash;y, milj&oslash;gevinst.
Som idehaver, og som teamleder for gruppa syns jeg det har v&aelig;rt ett utrolig godt samarbeid, og en lag&aring;nd som vitner om stor entusiasme, og iver for &aring; bringe en ideskisse, fra notater til en presentasjon, som innehar alle de tankene jeg hadde sett for meg, i tillegg til det at det vi underveis i prossessen kom frem til s&aring; mange nye l&oslash;sninger, for hvordan selve appen skulle kunne fungere i praksis. 
L&oslash;sningen med en webside som kan v&aelig;re en portal for &aring; samle alle innrapporterte data er noe som kom til etter man s&aring; behovet for &aring; kunne h&aring;ndtere de registreringene/rapporteringene, som kommer inn, men ogs&aring; en side som viser til enhver tid hva som er meldt inn. Denne siden skal ogs&aring; fungere som en infoside for appens funksjon, og samtidig v&aelig;re mulig &aring; bruke som en forvaltningsl&oslash;sning for kommunen.
                </p>
                <h2>
                    Hva vi l&aelig;rte
                </h2>
                <p>
                    Teamwork, p&aring; tvers av fagkompetanse er gull verdt!
Om hvordan man ved &aring; ha et innblikk i en annens spesialitet som til eksempel; programmeres verden, en designers, en GIS-ingeni&oslash;r kan samarbeide
                </p>
                <h2>
                    Veien videre for
                    <em>
                        Drittfritt
                    </em>
                </h2>
                <p>
                    Skal bli en realitet. Visjonene er klare for p&aring;bygning med milj&oslash;stasjoner; glass, metall, tekstil etc.
Brukermedvirkning. Samhandling og dialog, gjennom appen og nettsida.
Samarbeidspartnere m&aring; kontaktes. Kommunen, en naturlig medspiller. Milj&oslash;organisasjoner. Hundeklubber. Hundeorganisasjoner.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            filmora
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/json">
                                json
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/leaflet-js">
                                leaflet.js
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
