<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="745931" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/931/datas/original.jpg">
                            <img alt="ECommerceDeDemain &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/931/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Le projet part d'un constat assez simple. Aujourd'hui, si l'on souhaite acheter quelque chose, il n'y a pas ou peu de moyen de voir le rendu que cela aurait une fois mis chez nous. Seul notre imagination nous permet de visualiser ce que cel&agrave; donnera. L'imagination n'&eacute;tant pas fiable, il faut qu'une application puisse montrer le rendu chez nous lors d'un achat.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    L'application permet de visualiser un produit, et de la positionner dans la pi&egrave;ce grace &agrave; la technologie de r&eacute;alit&eacute; augment&eacute;. Ainsi, on peut placer compulsivement plusieurs objet d'un commerce en ligne dans la pi&egrave;ce, pour le rendu avec la r&eacute;alit&eacute; augment&eacute;, puis les acheter en quelques instants. Tout cela sera plus rapide et plus fiable qu'un achat en ligne classique ou que d'aller dans un magasin.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Lancer le projet sur Android Studio et compiler. Vous avez besoin d'un cellulaire sous Android 7.0 ou sup&eacute;rieur.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Je n'avais jamais utilis&eacute; AR-Core. C'est la premi&egrave;re fois que je d&eacute;veloppe une application en AR sur cellulaire. Ca semble un peu dur &agrave; prendre en main au d&eacute;part, mais apr&eacute;s quelques heures &ccedil;a va mieux.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Je suis fier d'avoir r&eacute;ussi &agrave; d&eacute;velopper la partie AR. J'ai crains au d&eacute;part que cela soit un peu trop gros pour moi seul, mais finalement &ccedil;a c'est bien pass&eacute;.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    J'ai appris &agrave; utiliser AR-core, et am&eacute;liorer mes comp&eacute;tences en Android.
                </p>
                <h2>
                    What's next for ECommerceDeDemain
                </h2>
                <p>
                    L'utilisation d'OpenCV pourrait fortement am&eacute;liorer les possibilit&eacute; de l'application. En effet, si l'application peut detecter les objets d&eacute;j&agrave; pr&eacute;sent dans la pi&egrave;ce, elle serait capable de pr&eacute;dire les produits les plus interessant pour l'utilisateur.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            ar-core
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            opengl-es
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Benjamin15/CommerceDeDemain" rel="nofollow" target="_blank" title="https://github.com/Benjamin15/CommerceDeDemain">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
