<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    A dificuldade dos jovens aprendizes de conseguir cart&otilde;es de cr&eacute;dito, por conta da falta de informa&ccedil;&otilde;es de risco e perfil financeiro das pessoas que est&atilde;o iniciando no mercado de trabalho.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Oferece ao jovem informa&ccedil;&otilde;es sobre o funcionamento dos investimentos em bolsa de valores, afim de tra&ccedil;ar um perfil financeiro com base em suas a&ccedil;&otilde;es dentro de uma plataforma educativa que simula investimentos na bolsa, com informa&ccedil;&otilde;es reais. Uma preocupa&ccedil;&atilde;o foi manter a plataforma simples, diferente de qualquer outro simulador encontrado.
O objetivo &eacute; prover seguran&ccedil;a &agrave;s institui&ccedil;&otilde;es fornecedoras de cr&eacute;dito, oferecendo um valor de seguro ap&oacute;s sugest&atilde;o e an&aacute;lise dos perfis mais seguros para libera&ccedil;&atilde;o de cr&eacute;dito.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Ap&oacute;s um longo brainstorm inicial, decidimos que tentar&iacute;amos solucionar o problema da falta de oferta de cr&eacute;dito a jovens com boa educa&ccedil;&atilde;o financeira.
Ent&atilde;o pensamos em alguma forma de beneficiar tanto o jovem (possibilitando descontos em suas faturas, em troca do fornecimento de seu perfil) quanto a institui&ccedil;&atilde;o (fornecendo seguro para os perfis considerados "sem risco de inadimpl&ecirc;ncia"
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Pensar em algum meio para extrair dados que n&atilde;o s&atilde;o encontrados facilmente, uma vez que &eacute; mais dif&iacute;cil a libera&ccedil;&atilde;o de cr&eacute;dito para iniciantes no mercado de trabalho.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Conseguimos desenvolver a maior parte do simulador de investimentos em uma noite, com participantes pouco experientes em hackathons.
Juntar pessoas com backgrounds muito variados em uma ideia em comum.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Aprendemos que investir em a&ccedil;&otilde;es &eacute; mais f&aacute;cil do que todos imagin&aacute;vamos, e que se surgirem mais produtos que facilitem o entendimento, mais pessoas estariam dispostas a investir desta maneira.
                </p>
                <h2>
                    What's next for Educa A&ccedil;&atilde;o
                </h2>
                <p>
                    Pensar em diversos outros meios para capta&ccedil;&atilde;o de perfis de risco em jovens, afim de poder captar mais informa&ccedil;&otilde;es e assim oferecer mais cr&eacute;dito aos mesmos.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/asp-net">
                                asp.net
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react">
                                react
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/redux">
                                redux
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
