<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="745618" data-title="Call Button" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/618/datas/original.JPG">
                            <img alt="eMErgency &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/618/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Call Button
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="745468" data-title="Home Screen" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/468/datas/original.PNG">
                            <img alt="eMErgency &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/468/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Home Screen
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Team
                </h2>
                <p>
                    MEAN
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Calling an ambulance can be a hassle when you are in a life or death situation.
Not anymore with eMErgency
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    eMErgency, si fonctionnelle, permet de lancer un appel aux services pr&eacute;hospitalier d'urgences en seul clique sur votre montre Fitbit. Un signal sera alors &eacute;mit et re&ccedil;u par une application utilis&eacute;e par les services ambulanciers. Cela permettra aux ambulanciers d'obtenir vos informations m&eacute;dicales telles que votre &acirc;ge, votre poids, vos m&eacute;dicaments, etc. Plus important encore, votre position sera envoy&eacute;e &agrave; l'application et celle-ci affichera un itin&eacute;raire pour se rendre jusqu'&agrave; vous.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Les API de Fitbit sont tr&egrave;s bien document&eacute;s ce qui nous a permis d'effectuer l'envoi des donn&eacute;es de la Fitbit assez rapidement. Le design quant-&agrave; lui &agrave; &eacute;t&eacute; r&eacute;alis&eacute; &agrave; l'aide de la technologie SVG et des feuilles de styles CSS. Puisque nous n'avons pas pu impl&eacute;menter l'application ambulance, nous n'avons rien impl&eacute;menter de plus. Sad reacts only...
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Understannding SVG. 
Making the Fitbit work (covers 90% of our challenges)
Trying to send data to a third party app... Before realizing we can't, unless we comply with the Fitbit Platform Terms of Service, we officially register our app, we implement an OAuth 2.0 authorization flow and two more steps...
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Le fonctionnement de la Fitbit a pris beaucoup de temps &agrave; cause de probl&egrave;mes techniques. Lorsqu'on a finalement r&eacute;ussi &agrave; impl&eacute;menter un programme sur la montre, nous avons &eacute;t&eacute; tr&egrave;s fi&egrave;rs.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Nous avons appris que, pour la prochaine fois, la gestion du temps est un enjeu crucial. Ceci est un enjeu que nous rencontrons &agrave; chaque projet, &agrave; chaque comp&eacute;tition, &agrave; chaque code que nous devons &eacute;crire. Par contre, cela est un enjeu qui est n&eacute;cessaire de se faire rappeller dans ce domaine. Nous avons &eacute;galement appris l'importance de l'amiti&eacute; et du travail en &eacute;quipe, comme dans pok&eacute;mon, car sans chaque membre de cette &eacute;quipe, le bateau qu'est eMErgency aurait couler plus profond qu'il n'est coul&eacute; en ce moment. En vrai, du cot&eacute; d&eacute;veloppement, il faudrait plus appeler cette application eWergency, mais cela ne fonctionne pas avec le concept et le jeu de mot ne serait pas aussi EPIC.
                </p>
                <p>
                    De plus, nous avons individuellement compris l'importance d'une documentation claire et bien faite. La Fitbit a une documentation compr&eacute;hensible et simple. Cela ne signifie pas que nous garantissons que toute documentation cr&eacute;&eacute; dans le futur par les membres de cette &eacute;quipe sera copr&eacute;hensible, simple ou m&ecirc;me existante. Cela est seulement une r&eacute;alisation que la documentation permet aux autres de coder avec les outils sans trop de difficult&eacute;.
                </p>
                <h2>
                    What's next for eMErgency
                </h2>
                <p>
                    La prochaine &eacute;tape serait de cr&eacute;er une vraie compagnie pour pouvoir faire des &eacute;changes de donn&eacute;es de la fitbit &agrave; une autre application mobile, ce qui nous a &eacute;t&eacute; refus&eacute;. Un pitch aux gens responsables des technologies des services d'urgence devrait &ecirc;tre accompli dans toutes les villes d'Am&eacute;rique du Nord, jusqu'&agrave; ce qu'on trouve des gens acceptant de tester la technologie. Une fois toute la technologie fonctionnelle, test&eacute;e et accept&eacute;e, il sera possible de gagner assez d'argent pour pouvoir acheter l'un des services sur internet permettant de transformer des textes en appels telephoniques, ce qui rendra l'application des ambulanciers d&eacute;su&egrave;te
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            svg
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/TristanCr/MEAN.git" rel="nofollow" target="_blank" title="https://github.com/TristanCr/MEAN.git">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
