<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="379942" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/379/942/datas/original.png">
                            <img alt="Sherbrooke: Mur &agrave; Mur &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/379/942/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="379943" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/379/943/datas/original.png">
                            <img alt="Sherbrooke: Mur &agrave; Mur &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/379/943/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nous avons remarqu&eacute; que les murals &agrave; travers Sherbrooke &eacute;taient des endroits touristiques imortantes, et nous voulions aid&eacute; les citoyens et les touristes &agrave; d&eacute;couvrir les diff&eacute;rents services &agrave; travers la ville qui leur est offert.
                </p>
                <h2>
                    Qu'est-ce qu'il fait
                </h2>
                <p>
                    Le programme est une sorte de chasse au tr&eacute;sor, o&ugrave; les utilisateurs doivent trouv&eacute;s et prendre en photos les murales de Sherbrooke pour d&eacute;couvrir des magasins ou des endroits touristiques. Prendre les photos d&eacute;bloquerait des accomplissements et des points sur une carte de l'API de google maps, apr&egrave;s que le syst&egrave;me reconnaisse que la photo sois bien d'une des murales.
                </p>
                <h2>
                    Comment nous l'avons b&acirc;tie
                </h2>
                <p>
                    Nous avons
                </p>
                <h2>
                    Obstacles rencontr&eacute;s
                </h2>
                <p>
                    Les murales n'&eacute;taient pas dans un jeu de donn&eacute;es, comme une personne nous a laiss&eacute;croire, alors nous avions d&ucirc; en faire une en cherchant des informations sur l'internet. Nous avions aussi choisi une id&eacute;e qui &eacute;tait bas&eacute; sur des syst&egrave;mes que nous n'avions jamais ou presque jamais utilis&eacute; avant, alors nous avions du apprendre et programmer en simultan&eacute;.
                </p>
                <h2>
                    Accomplissements d'on nous sommes fiers
                </h2>
                <p>
                    Nos diff&eacute;rentes parties du programme &eacute;taient bien fait, selon nous, et notre syst&egrave;me de reconnaisance photo &eacute;tait un moment qui nous a rendu tr&egrave;s heureux, m&ecirc;me si la combinaison des programmes &agrave; la fin a bris&eacute; notre logiciel.
                </p>
                <h2>
                    Ce que nous avons appris
                </h2>
                <p>
                    Nous avons appris &agrave; essayer d'impl&eacute;menter des choses que nous connaissons mieux, et non de chercher &agrave; faire quelque chose d'on nous ne savions presque rien avant et essayer d'apprendre en simultaner. Cette exp&eacute;rience &eacute;tait quand m&ecirc;me tr&egrave;s enrhichissante,
                </p>
                <h2>
                    Le futur
                </h2>
                <p>
                    Nous esp&eacute;rons travaill&eacute; sur le logiciel et le faire marcher durant cette &eacute;t&eacute;.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
