<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="378702" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/378/702/datas/original.png">
                            <img alt="FireControl Hidalgo &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/378/702/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    NOMBRE DEL PROYECTO: FireControl Hidalgo
INSPIRACI&Oacute;N: Nuestra inspiraci&oacute;n fue tomada de varios puntos en los que se destacan, la necesidad de encontrar una soluci&oacute;n a los incendios que se presentan en el Estado, tomando en cuenta que toda persona debe estar informada de tales acontecimientos y poder tomar precauciones. 
Otro punto de inspiraci&oacute;n es el hecho de encontrar una forma m&aacute;s r&aacute;pida de ubicar y reporta los incendios, a fin de que estos sean reportados a tiempo y se evite su crecimiento del mismo. 
Por eso es que nuestra soluci&oacute;n es una p&aacute;gina web ya que actualmente la mayor&iacute;a de las personas tienen acceso a la red, destacando que se podr&aacute; acceder a esta desde un dispositivo port&aacute;til o computadora de escritorio.
&iquest;QU&Eacute; ES LO QUE HACE EL PROYECTO? Consta de una p&aacute;gina web dirigida a todo p&uacute;blico con el fin de reportar incendios, est&aacute; contendr&aacute; un bot&oacute;n denominado S.O.S al cual al dar clic presentara informaci&oacute;n sobre la ubicaci&oacute;n donde se encuentra la persona que reporta el incendio por esta raz&oacute;n solo se preguntara a la persona cerca de qu&eacute; lugar se encuentra el incendio y como considera que es la situaci&oacute;n, baja, media o alta. Todo esto se reportara en una bit&aacute;cora para tener registro de todos los incendios el cual podr&aacute; ser visto en el bot&oacute;n de reportes de incendios y por &uacute;ltimo contendr&aacute; otro bot&oacute;n que indicara las zonas con m&aacute;s frecuencia de incendios para ayudar a los bomberos a tener en cuenta esas zonas y realizar rondas de vigilancia de incendios en estos lugares, cabe destacar que estar&aacute; disponible para que toda las personas lo vean,   lo cual ayudar&aacute; a que gente cercana a estos lugares tomen precauciones y de ser posible apoyar en el incendio.
MODELO DE NEGOCIO 
Para que el proyecto sea funcional se debe dar a conocer a todas las estaciones de bomberos y generarles privilegios de administrador, para que puedan obtener toda la informaci&oacute;n necesaria de las alertas que se reciban y as&iacute; atenderlas de inmediato.
Tambi&eacute;n debemos darla a conocer al p&uacute;blico para que conozcan este servicio y les ayude en casos de incendios.
EN QUE TECNOLOG&Iacute;AS EST&Aacute; DESARROLLADO EL PROYECTO: La p&aacute;gina web se est&aacute; desarrollando con PHP, HTML5, jQuery, AJAX y Bootstrap.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ajax">
                                ajax
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            ajx
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            html%
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            jason
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/jquery">
                                jquery
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mysql">
                                mysql
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
