<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="744113" data-title="Food4You" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/744/113/datas/original.png">
                            <img alt="Food4you by 4Head ༼ つ ◕_◕ ༽つ  &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/744/113/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Food4You
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="745891" data-title="home" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/891/datas/original.PNG">
                            <img alt="Food4you by 4Head ༼ つ ◕_◕ ༽つ  &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/891/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                home
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    <a href="https://drive.google.com/drive/folders/1ISCCfwIWUwQry2876LNeetaxynfnQGsI?usp=sharing" rel="nofollow">
                        https://drive.google.com/drive/folders/1ISCCfwIWUwQry2876LNeetaxynfnQGsI?usp=sharing
                    </a>
                </p>
                <p>
                    <strong>
                        ----------------------------FRENCH-------------------------
                    </strong>
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nous avons &eacute;t&eacute; inspir&eacute;s par une probl&eacute;matique selon laquelle des psychologues et d'autres sp&eacute;cialistes connexes nous ont rapport&eacute; que les personnes ayant une d&eacute;ficience intellectuelle avaient des difficult&eacute;s &agrave; effectuer plusieurs t&acirc;ches de la vie quotidienne. Une de ces t&acirc;ches consiste simplement &agrave; cuisiner.En effet, ces personnes doivent &ecirc;tre souvent grandement superviser pour faire ces taches ou encore, tout simplement incapables d'entreprendre ces t&acirc;ches.
                </p>
                <h2>
                    Ce que le projet accomplit
                </h2>
                <p>
                    Ce site web permet de d&eacute;composer des recettes complexes en sous-&eacute;tape plus simple ainsi qu'en illustrant chaque &eacute;tape afin de clarifier certaines nuances. De plus, ce site permet de r&eacute;aliser des commandes en ligne aupr&egrave;s d'&eacute;picerie afin que les personnes ayant des difficult&eacute;s a ce d&eacute;place ais&eacute;ment en ville, soit par transport en commun ou par transport autonome, puisse avoir acc&egrave;s a des aliments sans avoir besoin de supervision.
                </p>
                <h2>
                    comment l'avons-nous construit
                </h2>
                <p>
                    Nous avons utilis&eacute; le Framework React afin de cr&eacute;er notre site Web. Nous avons &eacute;galement utilis&eacute; AWS afin d'h&eacute;berger notre serveur. De plus, nous avons utilis&eacute; l'API de Walmart afin de r&eacute;aliser des commandes en ligne
                </p>
                <h2>
                    Defis rencontr&eacute;es
                </h2>
                <p>
                    Nous avons rencontr&eacute; des d&eacute;fis avec l'API Wal-Mart puisque cette API n'est pas tr&egrave;s bien document&eacute;e. De plus, nous n'avions pas fait de site Web avec React donc nous avons d&ucirc; apprendre ce framework rapidement.
                </p>
                <h2>
                    Accomplissements et fiert&eacute;s
                </h2>
                <p>
                    Nous sommes fiers d'avoir produit un site web permettant de rendre disponible des recettes &agrave; un public souvent oubli&eacute;. Nous sommes aussi fiers des apprentissages que nous avons faits en ce court laps de temps
                </p>
                <h2>
                    Apprentissages
                </h2>
                <p>
                    Nous avons appris &agrave; avoir une bonne estimation de nos capacit&eacute;s en fonction du temps accorder. &Agrave; travailler en &eacute;quipe et &agrave; bien communiquer les situations bloquantes et urgentes. Nous avons &eacute;galement appris plus profond&eacute;ment le framework React ainsi que le framework AWS
                </p>
                <h2>
                    Food4you dans le future
                </h2>
                <p>
                    La possibilit&eacute; d'inclure des recettes personnelles des utilisateurs pourrait &ecirc;tre un &eacute;l&eacute;ment important dans le d&eacute;veloppement futur de Food4you.
                </p>
                <p>
                    <strong>
                        ----------------------------ENGLISH-------------------------
                    </strong>
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    We were inspired by the problem that psychologists and other related specialists told us that people with intellectual disabilities had difficulty performing many tasks in their daily lives. One of these tasks is simply cooking. Indeed, these people must often be greatly supervised to do these tasks or else simply unable to undertake these tasks.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    This website allows you to break down complex recipes into simpler substeps as well as illustrating each step in order to clarify some nuance. In addition, this site makes it possible to place orders online at grocery stores so that people with difficulties can move around the city easily, either by public transport or by independent transportation, can have access to food without the need for supervision.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    We used the React Framework to create our website. We also used AWS to host our server. In addition, we have used the Walmart API to fulfill orders online
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    We encountered challenges with the walmart API since this API is not very well documented. In addition, we did not make a website with React so we had to learn this framework quickly.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    We are proud to have produced a website to make available recipes to an audience often forget. We are also proud of the learning we have done in this short span of time
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    We have learned to have a good estimate of our abilities as a function of time. To work in a team and to communicate well the situations blocking and urgent. We also learned more about the React framework and the AWS framework
                </p>
                <h2>
                    What's next for food4you
                </h2>
                <p>
                    The ability to include users' personal recipes could be an important element in the future development of Food4you.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/amazon-web-services">
                                amazon-web-services
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react">
                                react
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/typescript">
                                typescript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://dev.azure.com/youvachemam0926/Hackatown%202019/_git/Hackatown%202019" rel="nofollow" target="_blank" title="https://dev.azure.com/youvachemam0926/Hackatown%202019/_git/Hackatown%202019">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                dev.azure.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://drive.google.com/drive/folders/1ISCCfwIWUwQry2876LNeetaxynfnQGsI?usp=sharing" rel="nofollow" target="_blank" title="https://drive.google.com/drive/folders/1ISCCfwIWUwQry2876LNeetaxynfnQGsI?usp=sharing">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                drive.google.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="http://ec2-18-188-118-204.us-east-2.compute.amazonaws.com/" rel="nofollow" target="_blank" title="http://ec2-18-188-118-204.us-east-2.compute.amazonaws.com/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                ec2-18-188-118-204.us-east-2.compute.amazonaws.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
