<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="558266" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/266/datas/original.png">
                            <img alt="food for me &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/266/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Team members: 
Ann Helen Bergersen
Andreas Str&aelig;te
Cathrine Finnebraaten
Danny Javier Tapiero Luna
Jeppe Feld
Torbein Rein
                </p>
                <p>
                    Vi &oslash;nsker &aring; gj&oslash;re det sikrere &aring; spise ute, og hedre de spisestedene som tar allergi p&aring; alvor. 
Vi &oslash;nsker ogs&aring; &aring; motiverere de som ikke er like flinke til &aring; yte bedre
Samtidig som vi &oslash;nsker gj&oslash;re rapportering av kostuhell og manglende matmerking enklere.
                </p>
                <p>
                    Food For Me blir unik i sin oppbygging av smilefjes, rapportering, rating og design. 
Den blir lett og effektiv &aring; bruke, b&aring;de ved &aring; finne trygge steder &aring; spise, rapportere og vurdere. 
Vi &oslash;nsker &aring;  &aring;pne for &aring; lage en &rdquo;allergiprofil&rdquo; slik at man kan bruke andres allergiprofiler til &aring; vekte tilbakemeldinger. Som Netflix som gir filmanbefalninger.
( Det vil bli en dynamisk sammenligning i backend)
                </p>
                <p>
                    Vi m&aring; ta ta h&oslash;yde for GDPR ny lovgivning som kommer i mai.
                </p>
                <p>
                    Markedet for denne appen er enrom. I dag lever det 1,2 mill med allergi I Norge. Forskere mener dette tallet vil &oslash;ke til 3 mill innen 2030.
                </p>
                <p>
                    Hvor mye man kan gj&oslash;re med et godt team.
                </p>
                <p>
                    Jobbe videre med &aring; utvikle l&oslash;sningen, samt bygge kundemasse.
                </p>
                <p>
                    Appen gj&oslash;r det mulig &aring; planlegge og delta p&aring; sosiale aktiviteter p&aring; lik linje med alle andre mennesker.
Man slipper &aring; f&oslash;le seg til bry fordi man ikke kan spise noe, eller blir syk i l&oslash;pet av kvelden. 
Her svarer gjesten p&aring; hvordan de opplevde bes&oslash;ket, slik at andre gjester velge spisesteder ut fra andres tilbakemeldinger.
                </p>
                <p>
                    Datasets: 
Kartverket
Difi Mattilsyntes smilefjes ordning
Leaflet
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://lecturer-interaction-78001.netlify.com" rel="nofollow" target="_blank" title="https://lecturer-interaction-78001.netlify.com">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                lecturer-interaction-78001.netlify.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
