<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="360505" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/505/datas/original.jpg">
                            <img alt="Genofood &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/505/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="360506" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/506/datas/original.jpg">
                            <img alt="Genofood &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/506/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="360507" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/507/datas/original.jpg">
                            <img alt="Genofood &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/507/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="360508" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/508/datas/original.jpg">
                            <img alt="Genofood &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/360/508/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h1>
                    Genofood
                </h1>
                <p>
                    Actualmente en nuestro pa&iacute;s sufrimos de una crisis alimentaria. El sobrepeso, la obesidad y la diabetes son algunos ejemplos. &Eacute;stas son consecuencias de los malos h&aacute;bitos alimenticios arraigados en nuestra sociedad. El horario laboral y otras actividades que realizamos no nos permiten comer en un horario adecuado y la ignorancia de las personas sobre los alimentos saludables empeora el panorama. Adem&aacute;s de que resulta m&aacute;s barato ingerir una hamburguesa que comprar una ensalada. Las consecuencias son personas que se alimentan con lo que pueden a la hora que pueden.
                </p>
                <p>
                    Nosotros planteamos una soluci&oacute;n tecnol&oacute;gica, una plataforma, dirigida a cambiar los malos h&aacute;bitos alimenticios con base en una gu&iacute;a nutricional que explicaremos m&aacute;s adelante y con una red de distribuci&oacute;n inteligente pensada para ajustarnos a los horarios y el estilo de vida del usuario y favorecer la compra a productores locales.
                </p>
                <p>
                    Este proyecto est&aacute; dividido en fases.
                </p>
                <p>
                    Primera fase
                </p>
                <p>
                    Genofood busca solucionar el problema de la alimentaci&oacute;n con dos conceptos: Nutrigen&oacute;mica (el estudio de las interacciones entre el genoma y los nutrientes) y genotipos (informaci&oacute;n gen&eacute;tica que posee un organismo en particular) Ambos se unen para crear una teor&iacute;a de la alimentaci&oacute;n integral.
                </p>
                <p>
                    El genotipo de una persona se calcula seg&uacute;n su tipo de sangre y tomando ciertas medidas de su cuerpo, es decir, se realiza un genotipado en donde se determinan las variaciones espec&iacute;ficas que existen en el individuo. As&iacute;, lo que le hace bien a una persona, no tiene el mismo efecto en otra, incluso hasta podr&iacute;a enfermarlo. Todo esto est&aacute; basado en investigaciones recientes y es por eso que no existe la difusi&oacute;n adecuada y las personas ignoran la existencia de esta teor&iacute;a que plantea ser el futuro de la alimentaci&oacute;n.
                </p>
                <p>
                    El primer paso es calcular el genotipo del usuario. Para esto la persona debe llenar un formulario en la app, los campos que se llenar&aacute;n ser&aacute;n las mediciones de su cuerpo que &eacute;l mismo deber&aacute; hacer, como la altura, la longitud de los dedos, la longitud de sus piernas, su tipo de sangre, etc. Al calcularse el genotipo se le presenta al usuario sus caracter&iacute;sticas y el tipo de alimentos que se le recomienda ingerir. El siguiente paso es que el usuario escoja un platillo de los men&uacute;s (Se proporcionar&aacute; un rank) dise&ntilde;ados con base en su genotipo.
                </p>
                <p>
                    Tambi&eacute;n podr&aacute; escoger de un cat&aacute;logo al cocinero/chef m&aacute;s cercano a su &aacute;rea. &Eacute;ste recibir&aacute; una notificaci&oacute;n y preparar&aacute; el platillo escogiendo los proveedores de los ingredientes que ocupar&aacute; (Se proporcionar&aacute; un rank). Los pedidos se llevar&aacute;n a su hogar, oficina o cualquier lugar en donde el cliente est&eacute;. Para que esto sea posible, en esta primera fase, tendremos alianzas con proveedores (productores locales) y distribuidores como Kangou. Este sistema nos permitir&aacute; tener proveedores de alimentos que favorezcan el mercado local e independiente y una red de distribuci&oacute;n ecol&oacute;gica y funcional.
                </p>
                <p>
                    En esta aplicaci&oacute;n tambi&eacute;n se dar&aacute; atenci&oacute;n personalizada a cada usuario, implementando un set de reportes semanales o mensuales que registren la evoluci&oacute;n de su salud en datos como la medici&oacute;n de su presi&oacute;n, de su nivel de az&uacute;car, de su IMC o incluso su estado de &aacute;nimo. La atenci&oacute;n personalizada tambi&eacute;n ofrecer&aacute; contestar sus preguntas y darle recomendaciones alimenticias de acuerdo a su genotipo. Como un servicio extra, se pondr&aacute; en contacto a los usuarios con los nutri&oacute;logos que usen la Nutrigen&oacute;mica y los Genotipos. Todo esto es necesario ya que para mucha gente cambiar su dieta implica un esfuerzo hasta psicol&oacute;gico y emocional. Este contacto directo y la ayuda con men&uacute;s ya preparados son el apoyo necesario para que el usuario se alimente mejor, con el m&iacute;nimo de esfuerzo y que se sienta bien con este cambio.
                </p>
                <p>
                    El objetivo es usar la tecnolog&iacute;a para crear buenos h&aacute;bitos alimenticios, que se ajusten a los horarios laborales y familiares de las personas y que favorezca el consumo de productos locales basados en men&uacute;s dise&ntilde;ados bajo la teor&iacute;a de la nutrigen&oacute;mica y genotipos.
                </p>
                <p>
                    Los beneficios para los usuarios se traducir&aacute;n en una salud mejorada en poco tiempo: llegan a su peso y presentan menos enfermedades comunes como gripes o dolores estomacales. Si son constantes, en un futuro podr&aacute;n evitar enfermedades como diabetes, c&aacute;ncer, insuficiencia renal y otros padecimientos que devienen de una mala alimentaci&oacute;n por un largo periodo de tiempo. Los beneficios colaterales ser&aacute;n la cantidad de empleos que se generar&aacute;n, tanto por nuestras alianzas con proveedores y distribuidores, como con los cocineros/chef freelance que trabajar&aacute;n por men&uacute; y en el horario que &eacute;ste desee.
                </p>
                <p>
                    Segunda fase
                </p>
                <p>
                    En una segunda fase pretendemos que el usuario, adem&aacute;s de poder pedir los platillos preparados a donde desee, tambi&eacute;n pueda pedir s&oacute;lo los ingredientes para que &eacute;l mismo prepare una comida con base en su genotipo. En este caso el usuario podr&aacute; elegir directamente al productor local de nuestro cat&aacute;logo de proveedores (Se proporcionar&aacute; un rank) Para esto implementaremos un sistema de planeaci&oacute;n de recursos (ERP) y pretendemos organizar los productos de nuestros proveedores en mercados/locales que proveer&aacute;n tanto a los cocineros/chef como al usuario que s&oacute;lo orden&oacute; los ingredientes. &Eacute;stos mercados/locales estar&aacute;n en sitios estrat&eacute;gicos y los proveedores podr&aacute;n utilizar medios ecoamigables para transportar sus productos, como usar Carrot, por ejemplo.
                </p>
                <p>
                    Tambi&eacute;n en esta segunda fase planeamos revolucionar nuestro sistema de distribuci&oacute;n con ayuda de personas que se transportan en una bicicleta. El objetivo es que estas personas, sean estudiantes o se dediquen a otra cosa, utilicen su tiempo libre para hacer entregas a nuestros usuarios finales y generen ingresos en sus tiempos muertos con su propia bici adaptada adecuadamente para transportar los alimentos y preservarlos frescos y otros medios de transporte ecoamigables (se implementara un CRM)
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            laravel-php-framework
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/ingenieroruiz284/GenoFood" rel="nofollow" target="_blank" title="https://github.com/ingenieroruiz284/GenoFood">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="http://ingenieroruiz.com/hackamano/GenoFood/public/" rel="nofollow" target="_blank" title="http://ingenieroruiz.com/hackamano/GenoFood/public/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                ingenieroruiz.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
