<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    GeoLit
                </h2>
                <p>
                    GeoLit est une application permet de re&ccedil;evoir des informations ouvertes de _
                    <a href="https://www.donneesquebec.ca/fr/" rel="nofollow">
                        https://www.donneesquebec.ca/fr/
                    </a>
                    _. Elle g&eacute;n&eacute;re des graphes et interpr&ecirc;tre les donn&eacute;es bruts pour donner aux habitants de la ville de Montr&eacute;al et la ville de Laval des informations sur la qualit&eacute; de l'air de la ville, la foresterie urbaine et la temp&eacute;rature de surface de la ville. GeoLit vise la prise en conscience de l'environnement de ses utilisateurs. Ceux-ci sont en mesure de prendre connaissance du score attribu&eacute; au quartier o&ugrave; ils habitent, ce qui les sensibilise davantage &agrave; prendre des actions pour am&eacute;liorer directement leur r&eacute;gion et leur qualit&eacute; de vie, pour ainsi &ecirc;tre t&eacute;moin des changements.
                </p>
                <h2>
                    Conception
                </h2>
                <p>
                    GeoLit est programm&eacute; en Java avec l'utilisation de JavaFx comme librairie graphique. Nous avec &eacute;galement utilis&eacute; une librairie TileFx.
                </p>
                <h2>
                    D&eacute;fi
                </h2>
                <p>
                    La contrainte de temps nous a forc&eacute; &agrave; abandonner des fonctionnalit&eacute;s que nous voulions ajouter pour rendre l'application plus utile et esth&eacute;tique. Nous avons &eacute;galement eu de la difficult&eacute; &agrave; travailler avec certaines donn&eacute;es du portail &agrave; cause de leur taille immense.
                </p>
                <p>
                    <strong>
                        #Geotiff
                    </strong>
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/bloc97/HackQC2018_7/tree/fe08ec175b9e1eb7dd24ad04d4f457aaec82158d" rel="nofollow" target="_blank" title="https://github.com/bloc97/HackQC2018_7/tree/fe08ec175b9e1eb7dd24ad04d4f457aaec82158d">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
