<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspira&ccedil;&atilde;o
                </h2>
                <p>
                    Reportagem de senhora que ficou famosa na internet por fugir de uma entrevista, sendo que era um funcion&aacute;rio fantasma, al&eacute;m de outras reportagens que mostravam os danos que isso causa para o pa&iacute;s
                </p>
                <h2>
                    Oque faz
                </h2>
                <p>
                    Atrav&eacute;s do reconhecimento facial do servidor p&uacute;blico o app (android) identifica a localiza&ccedil;&atilde;o do mesmo, vendo se est&aacute; no local designado de trabalho
                </p>
                <h2>
                    Como montei
                </h2>
                <p>
                    A parte de an&aacute;lise de imagem foi feita com a biblioteca OpenCV inicialmente e posteriormente Machine Learning, linkado com manipula&ccedil;&atilde;o de imagem no MatLab. A localiza&ccedil;&atilde;o foi codificada no pr&oacute;prio Android Studio e a integra&ccedil;&atilde;o atrav&eacute;s de um app.
                </p>
                <h2>
                    Problemas que encontrei
                </h2>
                <p>
                    O c&oacute;digo da localiza&ccedil;&atilde;o foi algo que demorou para funcionar devido a problemas em bibliotecas majoritariamente e o machine learning n&atilde;o foi t&atilde;o preciso, devido a limita&ccedil;&atilde;o de tempo. O uso do NDK ( interfa&ccedil;e de convers&atilde;o de C++ para Java) e da convers&atilde;o do Java para sistema Android n&atilde;o funcionou de maneira correta, in&uacute;meros bugs e incompatibilidade de c&oacute;digos o impediram de funcionar corretamente.
                </p>
                <h2>
                    Feitos da qual estou orgulhoso
                </h2>
                <p>
                    A forma como foi feita o Machine Learning, dedica&ccedil;&atilde;o, aprendizado e principalmente o Android-Studio e seu funcionamento em rela&ccedil;&atilde;o as outras linguagens
                </p>
                <h2>
                    Oque aprendi
                </h2>
                <p>
                    Funcionamento do OpenCV, MatLab+Machine Learning, Android-Studio e sua linguaguem, Como criar interfaces
                </p>
                <h2>
                    Qual o pr&oacute;ximo passo do GhostBusters
                </h2>
                <p>
                    Integra&ccedil;&atilde;o entre as partes, formaliza&ccedil;&atilde;o do servidor, conversa com setor p&uacute;blico e disponibilizar aplicativo
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/c--3">
                                c++
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/google-maps">
                                google-maps
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/machine-learning">
                                machine-learning
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/matlab">
                                matlab
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/opencv">
                                opencv
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
