<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/2CR5FFh3DNM?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Notre projet fait face a l&rsquo;un des probl&egrave;mes du si&egrave;cle, l&rsquo;inaccessibilit&eacute; des personnes n&eacute;cessiteux aux soins, soit car ils font partie d&rsquo;une famille pauvre ou que l&rsquo;op&eacute;ration m&eacute;dicale soit couteuse, Il consiste &agrave; donner &agrave; ces gens-l&agrave; le droit &agrave; la vie, aux soins, aux m&eacute;dicaments toutes en gardent sa dignit&eacute;. 
Dans un premier temp le site va cibler cette tranche -des gens n&eacute;cessiteux, souffrent de maladies chronique ou qui n&eacute;cessite une intervention chirurgicale Urgente ou Couteuse, et leur faire b&eacute;n&eacute;ficier des soins gratuits, &ccedil;a va leur impacter ainsi que leur famille.
                </p>
                <p>
                    L&rsquo;Access a ce service sera simple, les patients vont passer une inscription sur le site, pour les assign&eacute;s &agrave; un docteur b&eacute;n&eacute;vole, pass&eacute; une consultation gratuite pour s&rsquo;assurer qu&rsquo;il n&eacute;cessite vraiment cette op&eacute;ration ou pas et aussi d&eacute;finir le montant exacte de cette derni&egrave;re. Comme &ccedil;a on pourra s&rsquo;assurer de la fiabilit&eacute; des informations affich&eacute; sur notre site at aussi nos patients. Et vous n&rsquo;aurais aucun doute lorsque vous effectuer vos donations.
                </p>
                <p>
                    On a d&eacute;j&agrave; commenc&eacute; sur la r&eacute;alisation de la plateforme, en attendant le recrutement des Programmeurs/Designers pour finalis&eacute; la plateforme ; comme &ccedil;a nos partenaires pouvant nous joindre (M&eacute;decin, donateur, h&ocirc;pitaux &hellip;)  Et lanc&eacute; le site.
Cot&eacute; marketing. On compte se baser sur les publicit&eacute;s r&eacute;seaux sociaux, Spot Tv, Radio, Platform, et aussi sur les locaux de nos partenaires (H&ocirc;pitaux et M&eacute;decins) pour assurer une durabilit&eacute; avec nos clients.
                </p>
                <p>
                    Pour ceux qui pose la question comment en va assurer le fonctionnement du site ou d&rsquo;o&ugrave; en va g&eacute;n&eacute;rer des gains : on aura Les frais des Annonces/ Publication cibl&eacute; sur le site, la ventes des produits (Bracelet, T-shirt, badge, casquette), un pourcentage de 3% sur chaque don effectuer, des dons pour le site, organisation des (GALAT), sponsoring etc&hellip; mais toujours en gardant l&rsquo;impacte humanitaire et sociale, la chose qui rendra les choses plus simple pour nous.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css3">
                                css3
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mysql">
                                mysql
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Akad-samy/givelife" rel="nofollow" target="_blank" title="https://github.com/Akad-samy/givelife">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
