<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="470757" data-title="Green Tree" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/470/757/datas/original.png">
                            <img alt="Green Tree &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/470/757/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Green Tree
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Le changement climatique est un probl&egrave;me global et important. En regardant nos voisins du sud, on comprend qu&rsquo;il y a besoin de sensibilisation au probl&egrave;me.
                </p>
                <p>
                    On a donc cr&eacute;&eacute; une application r&eacute;cup&eacute;rant les donn&eacute;es de la ville de Montr&eacute;al afin de montrer l&rsquo;effet des &eacute;missions de co2 des voitures par rapport &agrave; l&rsquo;absorption de co2 par les arbres de Montr&eacute;al selon l&rsquo;intersection. On peut donc observer quels sections de Montr&eacute;al sont plus vertes, et combien d&rsquo;arbres additionnels seraient n&eacute;cessaires afin de contrer le co2 des voitures.
                </p>
                <p>
                    Les donn&eacute;es de la ville proviennent du site de la ville Montr&eacute;al et de ses donn&eacute;es ouvertes sites, et les donn&eacute;es de consommation en co2 proviennent de la litt&eacute;rature scientifique et de sites gouvernementaux. On utilise la plateforme de donn&eacute;es ouvertes de la ville de Montr&eacute;al afin de visualiser l&rsquo;&eacute;quilibre pr&eacute;cis de co2 selon l&rsquo;intersection.
                </p>
                <p>
                    La difficult&eacute; technique est de compiler les r&eacute;sultats de fa&ccedil;on rapide. Ce n&rsquo;est cependant pas n&eacute;cessaire pour chaque requ&ecirc;te, mais il faut plus de puissance d&eacute;pendamment des donn&eacute;es et de la ville. Nous calculons le taux d&rsquo;absorption de co2 selon l&rsquo;esp&egrave;ce d&rsquo;arbre, et compilons les r&eacute;sultats par intersection selon les donn&eacute;es du moment afin de cr&eacute;er une carte interactive.
                </p>
                <p>
                    L&rsquo;application vise les villes et municipalit&eacute;s d&eacute;sirant conscientiser ses habitants &agrave; la quantifier de co2 g&eacute;n&eacute;r&eacute;.
                </p>
                <p>
                    Nous avons principalement utilise  Python pour effectuer l'analyze de donnees et ensuite avons creer un site avec bootstrap et google maps pour faire une visualization de l'utilisation des voitures et des arbres  presents a Montreal.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/github">
                                github
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            javascript-bootstrap
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://paultpt.github.io/green_tree/" rel="nofollow" target="_blank" title="https://paultpt.github.io/green_tree/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                paultpt.github.io
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
