<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h1>
                    BiSecurity
                </h1>
                <p>
                    En M&eacute;xico (y en el mundo) el robo de bicicletas es uno de los delitos m&aacute;s f&aacute;cil de cometer. Una de las razones es que no hay una manera sencilla de rastrear una bicicleta despu&eacute;s de ser robada.
                </p>
                <p>
                    Nuestro proyecto, abarcando el dominio de la seguridad, desea atacar este problema usando m&eacute;todos modernos de rastreo, combin&aacute;ndolos con estrategias de administraci&oacute;n de bases de datos y comunicaciones distribuidas.
                </p>
                <h2>
                    &iquest;Qu&eacute; consiste?
                </h2>
                <p>
                    El proyecto consiste en implementar un ID &uacute;nico a cada bicicleta que se compre (ID no es obligatorio para circular). Este ID de la bicicleta estar&aacute; registrado, para los prop&oacute;sitos de este proyecto, mediante un chip RFID. Mediante una plataforma, el usuario ciclista podr&aacute; mantener un registro de su bicicleta y, en caso de hurto, extrav&iacute;o o similar, reportarla como tal.
                </p>
                <p>
                    Cada estado (o municipio, seg&uacute;n convenga) mantendr&aacute; su propio registro de bicicletas, con m&iacute;nima dependencia del nivel nacional. La informaci&oacute;n de que bicicletas han sido robadas puede ser f&aacute;cilmente distribuida a nivel nacional. Todo esto divulgando pocos datos personales de los ciclistas.
                </p>
                <p>
                    Los gobiernos locales que se registren al sistema mantendr&aacute;n una red de sensores en lugares concurridos por bicicletas (intersecciones, ciclov&iacute;as, etc.). Cuando una bicicleta que ha sido reportada como robada sea detectada por un sensor, esto detonar&aacute; una alerta. Un aviso automatizado puede ser enviado al due&ntilde;o y a las autoridades correspondientes, y los datos de los sensores pueden ser usados para potencialmente dar con el criminal.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/c--3">
                                c++
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/sqlite">
                                sqlite
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/blackhawk42/Hackathon2019" rel="nofollow" target="_blank" title="https://github.com/blackhawk42/Hackathon2019">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
