<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="913885" data-title="Accueil" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/913/885/datas/original.PNG">
                            <img alt="Optimus Crime &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/913/885/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Accueil
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="913883" data-title="Pr&eacute;visions" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/913/883/datas/original.PNG">
                            <img alt="Optimus Crime &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/913/883/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Pr&eacute;visions
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="913884" data-title="&Agrave; propos" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/913/884/datas/original.PNG">
                            <img alt="Optimus Crime &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/913/884/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                &Agrave; propos
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    <strong>
                        Le probl&egrave;me:
                    </strong>
                    Depuis quelques ann&eacute;es, la masse salariale du corps policier de la ville de Montr&eacute;al ne cesse d&rsquo;augmenter alors que le nombre de 
patrouilleurs n&rsquo;augmente pas au m&ecirc;me rythme, la s&eacute;curit&eacute; publique est compromise.
                </p>
                <p>
                    <strong>
                        La solution :
                    </strong>
                    Le logiciel Optimus Crime permet donc aux villes d&rsquo;optimiser la r&eacute;partition des effectifs de leur corps policier pour ainsi faire 
une meilleure utilisation des fonds publics sans compromettre la s&eacute;curit&eacute; de la population. Optimus Crime analyse les donn&eacute;es recueillies 
sur les actes criminels commis &agrave; Montr&eacute;al durant les derni&egrave;res ann&eacute;es. Il pr&eacute;dit selon les territoires des postes de quartier les crimes 
qui seront commis dans les mois &agrave; venir.
                </p>
                <p>
                    <strong>
                        Le fonctionnement :
                    </strong>
                    &Eacute;tant subdivis&eacute; en 2 bin&ocirc;mes, 2 &eacute;tudiants ont travaill&eacute; sur les datasets et l'AI et les 2 autres ont travaill&eacute; sur le front-end. Gr&acirc;ces &agrave; l'acc&egrave;s aux donn&eacute;es publiques de la ville de Montr&eacute;al, nous avons pu obtenir la liste des crimes effectu&eacute;s lors des 5 derni&egrave;res ann&eacute;es sur le territoire de la ville. En utilisant le langage python et la librairie pandas, nous avons organis&eacute; les donn&eacute;es de selon chaque poste de quartier et chaque mois. La librairie sklearn a &eacute;t&eacute; utilis&eacute; pour faire les r&eacute;gressions lin&eacute;aires et plusieurs autres librairies ont &eacute;t&eacute; utilis&eacute; pour diverses utilit&eacute;s.
                    <br>
                    Pour le front-end, html et css ont &eacute;t&eacute; utilis&eacute; pour la mise en page et l'organisation du site. De plus, javascript a &eacute;t&eacute; utilis&eacute; pour l'entr&eacute;e du mois et de l'ann&eacute;e de pr&eacute;diction par l'utilisateur et pour afficher les r&eacute;sultats obtenus par l'AI, lors d'une demande.
                </p>
                <p>
                    <strong>
                        Notre &eacute;quipe :
                    </strong>
                    Notre &eacute;quipe est compos&eacute; de 4 &eacute;tudiants de Polytechnique Montr&eacute;al. Nous participions cette fin de semaine &agrave; notre premier hackathon.
                </p>
                <p>
                    <strong>
                        D&eacute;fis :
                    </strong>
                    Le d&eacute;veloppement de notre projet logiciel a &eacute;t&eacute; parsem&eacute; de plusieurs embuches autant pour le c&ocirc;t&eacute; AI et Datascience et que pour le Front-End. Pour la premi&egrave;re section, les principaux d&eacute;fis ont &eacute;t&eacute; l'apprentissage de python, l'utilisation de certaines librairies et la gestion de data-sets. Pour le Front-End, l'apprentissage de html et de css ainsi que de javascript ont &eacute;t&eacute; les principaux d&eacute;fis.
                </p>
                <p>
                    <strong>
                        Ce pourquoi nous sommes fiers :
                    </strong>
                    &Eacute;tant pour chacun notre premier hackathon, le fait simple d'avoir parvenu &agrave; compl&eacute;ter notre projet de A &agrave; Z constitue en soi un grand accomplissement.
                </p>
                <p>
                    <strong>
                        La suite pour Optimus Crime :
                    </strong>
                    &Agrave; part l'accumulation de donn&eacute;es au fil du temps qui augmentera la pr&eacute;cision des pr&eacute;dictions, un Back-end devrait &ecirc;tre constitu&eacute; pour que le site soit mis &agrave; jour en temps r&eacute;el depuis la base de donn&eacute;es de la ville de Montr&eacute;al. Plusieurs informations tels que le type de crimes, le moment de la journ&eacute;e et la pr&eacute;diction par jour au lieu de par mois pourraient &eacute;ventuellement &ecirc;tre ajout&eacute;s ainsi que d'autres fonctionnalit&eacute;s. De plus, une application mobile et un site web de meilleure qualit&eacute; pourraient &ecirc;tre d&eacute;velopp&eacute;s pour que l'utilisation par le client soit plus conviviale et agr&eacute;able.
                </p>
                <p>
                    Donn&eacute;es publiques provenant du site de la ville de Montr&eacute;al :
                    <a href="http://donnees.ville.montreal.qc.ca/dataset/actes-criminels" rel="nofollow">
                        http://donnees.ville.montreal.qc.ca/dataset/actes-criminels
                    </a>
                    Probl&eacute;matique :
                    <a href="https://www.journaldemontreal.com/2019/10/05/plus-chere-que-jamais-la-police" rel="nofollow">
                        https://www.journaldemontreal.com/2019/10/05/plus-chere-que-jamais-la-police
                    </a>
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            matplotlib.pylot
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/numpy">
                                numpy
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/pandas">
                                pandas
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            sklearn
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/MaximeCoteL/Optimus-Crime" rel="nofollow" target="_blank" title="https://github.com/MaximeCoteL/Optimus-Crime">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
