<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Le v&eacute;lo est le mode de transport urbain par excellence, pouvant &ecirc;tre entrepos&eacute; dans un appartement, n&eacute;cessitant une plus petite infrastructure que l'automobile, et permettant de parcourir rapidement les petites et moyennes distances de d&eacute;placement, typiques des grandes villes. De plus son utilisation s'inscrit dans le mouvement &eacute;coresponsable actuel, dans un mode de vie sain et actif et permet de contrer la s&eacute;dentarit&eacute; de plus en plus omnipr&eacute;sente. Toutefois, la cohabitation parfois difficile avec les automobiles ainsi que la m&eacute;connaissance du r&eacute;seau de pistes cyclables et des v&eacute;los en libre service peuvent repr&eacute;senter un d&eacute;triment pour les citoyens quant &agrave; l'utilisation de cet excellent mode de transport. Notre application vise &agrave; r&eacute;gler ce probl&egrave;me.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Dans sa mouture actuelle, JackBike permet de trouver le trajet le plus rapide entre deux points dans la ville de Montr&eacute;al en mettant &agrave; profit la localisation des bornes BIXI.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Notre projet est une application Andro&iuml;de programm&eacute;e en Java. Nous r&eacute;coltons des donn&eacute;es &agrave; partir du portail de la Ville de Montr&eacute;al sur la localisation des bornes BIXI, et utilisons ces informations ainsi que l'API de Google Maps pour trouver un trajet ad&eacute;quat.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    L'acc&egrave;s aux diff&eacute;rents APIs, ainsi que le d&eacute;verminage d'une application sur Andro&iuml;de furent particuli&egrave;rement difficile puisque nous n'avions pratiquement pas d'exp&eacute;rience dans ce domaine. D&ucirc; aux difficult&eacute;s rencontr&eacute;es &agrave; ce niveau, nous avons manqu&eacute; de temps pour impl&eacute;menter toutes les fonctionnalit&eacute;es que nous avions initialement pr&eacute;vues.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Avoir d&eacute;velopp&eacute; en si peu de temps une d&eacute;mo fonctionnelle pour une nouvelle plateforme.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    D&eacute;veloppement pour Andro&iuml;de, design d'interface avec XML, fonctionnement du format JSON, r&eacute;colte d'information par les APIs de Google.
                </p>
                <h2>
                    What's next for JackBike
                </h2>
                <p>
                    Ultimement, nous voudrions utiliser les donn&eacute;es de la ville de Montr&eacute;al sur le r&eacute;seau routier et de pistes cyclables afin d'attribuer une cote au chemin propos&eacute; en fonction de facteurs telles que l'achalandage des routes, la proximit&eacute; avec les voitures et la s&eacute;curit&eacute;.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            gbfs
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/google-directions">
                                google-directions
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/google-maps">
                                google-maps
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/json">
                                json
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/JSLemaire/Hackatown2020" rel="nofollow" target="_blank" title="https://github.com/JSLemaire/Hackatown2020">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
