<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Imagine que voc&ecirc; &eacute; um jovem no auge dos seus 20 anos e como um bom pertencente aos
                    <em>
                        millenials
                    </em>
                    , voc&ecirc; tende a ser muito imediatista, quer as coisas pra ontem, o quanto antes. Mas e quando voc&ecirc; tem um objetivo, ou at&eacute; mesmo um sonho, que n&atilde;o pode ser realizado da noite pro dia? O primeiro carro, uma viagem pra Disney e at&eacute; aquele interc&acirc;mbio ou mochil&atilde;o pela Europa que voc&ecirc; sempre quis fazer. Para esse tipo de dor, desenvolvemos o DreamUp: o seu conselheiro pessoal de finan&ccedil;as que vai te ajudar a atingir as suas metas (at&eacute; aquelas que parecem ut&oacute;picas) de forma inteligente.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    O DreamUp trata-se de um aplicativo web responsivo que voc&ecirc; pode acessar pelo seu celular. Ele pode ser integrado &agrave; sua conta banc&aacute;ria, de forma que os seus gastos (fixos e espor&aacute;dicos) possam ser analisados de forma simples, sendo poss&iacute;vel estabelecer quanto tempo falta para voc&ecirc; conseguir realizar aquela incrivel viagem para a Disney que voc&ecirc; sempre sonhou, por exemplo. Dessa forma, ele tenta te alertar se voc&ecirc; est&aacute; passando do limite, ou se est&aacute; no caminho certo, atuando, literalmente, como um conselheiro.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Utilizamos Ruby On Rails para a constru&ccedil;&atilde;o da aplica&ccedil;&atilde;o web, al&eacute;m de linguagens como HTML/CSS e Javascript , com bootstrap para fazer o
                    <strong>
                        front-end
                    </strong>
                    . Al&eacute;m disso, fizemos uso de tecnicas bastante conhecidas de UX para o desenvolvimento de produto, como o Design Sprint.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Em um primeiro momento, cogitamos usar algum servi&ccedil;o de MaaS, como prediction.io ou h2o.ai para realizar alguns modelos de predi&ccedil;&atilde;o e at&eacute; modelagem de comportamento, mas dado o tempo curto da Hackathon, resolvemos priorizar no que tinhamos maior expertise. O mesmo vale para algumas solu&ccedil;&otilde;es que pensamos para a implementa&ccedil;&atilde;o do conselheiro, como _chatbots_ou at&eacute; fazer uso de Progressive Web Apps.
Sendo assim, resolvemos focar no que t&iacute;nhamos maior conhecimento tecnico, uma vez que o tempo para desenvolvimento, mostrou-se extremamente escasso. Mas, novamente, levantamos solu&ccedil;&otilde;es v&aacute;lidas para o futuro da solu&ccedil;&atilde;o.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Ter conseguido completar o MVP dentro do prazo
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Muita coisa
                </p>
                <h2>
                    What's next for DreamUp
                </h2>
                <p>
                    Pensarmos em uma implementa&ccedil;&atilde;o mais a longo prazo, at&eacute; pensando em solu&ccedil;&otilde;es que visem implementa&ccedil;&otilde;es de modelos de Machine Learning e Intelig&ecirc;ncia Artificial para alguns casos espec&iacute;ficos ou at&eacute; mesmo uma plataforma mobile nativa ou, novamente, fazer o uso de Progressive Web App.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ruby">
                                ruby
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/bahbbc/hack-nubank" rel="nofollow" target="_blank" title="https://github.com/bahbbc/hack-nubank">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
