<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Shopync permet de trouver l&rsquo;itin&eacute;raire le plus optimis&eacute; en temps et/ou en argent pour faire ses achats de natures diverses. Que ce soit pour une &eacute;picerie d&rsquo;aliments, de v&ecirc;tements ou de quincaillerie, Shopync s&rsquo;occupera de vous guider dans votre horaire. En se servant des donn&eacute;es de Google Maps, il pourra trouver l&rsquo;itin&eacute;raire le plus court en se servant des heures d&rsquo;ouverture des magasins, de leur affluence, etc. Si vous voulez sp&eacute;cifier votre liste d&rsquo;achats, Shopync vous indiquera o&ugrave; aller pour trouver le plus de produits moins cher. Il trouvera les deux itin&eacute;raires les plus optimaux. Si vous vouliez un moindre co&ucirc;t, il vous indiquera combien cela co&ucirc;terait pour un itin&eacute;raire un peu plus court, et vice-versa. 
Il aurait fallu se servir des bases de donn&eacute;es de plusieurs magasins pour obtenir les produits disponibles ainsi que leur prix du moment. On aurait &eacute;galement utilis&eacute; les donn&eacute;es de Google Maps pour trouver des itin&eacute;raires en fonction des endroits et du moyen de transport. On pourrait &eacute;galement se sevir de Google Agenda pour que le programme se serve des moment libres que l'utilisateur a d&eacute;j&agrave;. On pourrait &eacute;galement cr&eacute;er un profil pour que l'utilisateur ait des magasins pr&eacute;f&eacute;r&eacute;s et des moyens de transport pr&eacute;f&eacute;r&eacute;s.
                </p>
                <p>
                    Membres de l'&eacute;quipe Les Bachelors : Camille Bourbonnais, Basil &Ccedil;apar, Amari Dissou et Hugo Fontaine
                </p>
                <p>
                    <strong>
                        aller dans shopync/app pour runner le tout et non Shopync
                    </strong>
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/angular-js">
                                angular.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/json">
                                json
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/typescript">
                                typescript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/amaridansface/hackatown-2019-bachelors" rel="nofollow" target="_blank" title="https://github.com/amaridansface/hackatown-2019-bachelors">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
