<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/ONwe7EIc-OQ?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                </ul>
            </div>
            <div>
                <h1>
                    HackathonHCVT
                </h1>
                <p>
                    Hackathon project
                </p>
                <ol>
                    <li>
                        <p>
                            M&ocirc; tả phần core
a. Phương ph&aacute;p sử dụng
Phương ph&aacute;p ch&iacute;nh l&agrave; collaborative filtering
b. M&ocirc; tả phương ph&aacute;p
                        </p>
                        <ul>
                            <li>
                                Ph&acirc;n t&iacute;ch thị hiếu người d&ugrave;ng: cho người d&ugrave;ng lựa chọn kh&oacute;a học n&agrave;o ưa th&iacute;ch hơn. 
Ch&uacute; th&iacute;ch: Theo phương ph&aacute;p cũ th&igrave; c&aacute;c kh&oacute;a học được đưa cho người d&ugrave;ng rating bằng thang điểm tuyệt đối (5 star base). Nhưng phương ph&aacute;p n&agrave;y gặp vấn đề l&agrave; điểm đ&aacute;nh gi&aacute; kh&ocirc;ng c&oacute; mức độ ph&acirc;n biệt cao hơn nữa việc cho điểm phụ thuộc v&agrave;o cảm x&uacute;c hiện thời của người d&ugrave;ng. H&ocirc;m nay vui người d&ugrave;ng c&oacute; thể cho 5 sao nhưng khi t&acirc;m trạng kh&ocirc;ng tốt th&igrave; c&oacute; thể người d&ugrave;ng chỉ cho 3 sao. Ngược lại, đối với phương ph&aacute;p đ&aacute;nh gi&aacute; giữa c&aacute;c kh&oacute;a học th&igrave; &iacute;t bị ảnh hưởng bởi t&acirc;m trạng hiện thời của người d&ugrave;ng.
                            </li>
                            <li>
                                T&iacute;nh điểm tương đồng trong thị hiếu của người d&ugrave;ng, với một người d&ugrave;ng th&igrave; độ tương đồng của những người d&ugrave;ng kh&aacute;c c&oacute; thể được đ&aacute;nh gi&aacute; th&ocirc;ng qua thị hiếu.
                            </li>
                            <li>
                                Gợi &yacute; kh&oacute;a học cho người d&ugrave;ng dựa v&agrave;o th&ocirc;ng tin của nhiều người d&ugrave;ng kh&aacute;c. Khả năng để một user sẽ th&iacute;ch một kh&oacute;a học sẽ được đ&aacute;nh gi&aacute; như sau:
Tổng số của sự ưa th&iacute;ch một người d&ugrave;ng kh&aacute;c x độ tương đồng giữa hai user
User A: 2 &gt; 4 &gt; 3 &gt; 1
User B: 4 &gt; 2&gt;  3 &gt; 1
User C: 2 &gt; 4 &gt; 3 &gt; 1
User D: 2&gt;  4 &gt; 3 &gt; 1
Nếu người d&ugrave;ng A, C đ&atilde; học: 4 -&gt; 3 -&gt; 2 v&agrave; người d&ugrave;ng D đ&atilde; học 4 -&gt; 3 th&igrave; gợi &yacute; cho người d&ugrave;ng D học kh&oacute;a học 2
                            </li>
                            <li>
                                Gợi &yacute; kh&oacute;a học tự động dựa v&agrave;o quy luật thống k&ecirc; (x đ&aacute;nh dấu đ&atilde; học):
                            </li>
                        </ul>
                        <p>
                            Kh&oacute;a học
User    1   2   3   4
A       x   x
                            <br>
                            B   x           x
C       x   x
                            <br>
                            D   x           x
E   x       x
                            <br>
                            F       x   x   x
G   x   x       x
H   x   x   x   x
                        </p>
                    </li>
                </ol>
                <p>
                    V&iacute; dụ:
T&iacute;nh độ tương đồng giữa hai kh&oacute;a học:
Kh&oacute;a học 1: US = [0, 1, 0, 1, 1, 0, 1, 1]
Kh&oacute;a học 2: US = [1, 0, 1, 0, 0, 1, 1, 1]
Kh&oacute;a học 3: US = [1, 0, 1, 0, 1, 1, 0, 1]
Kh&oacute;a học 4: US = [0, 1, 0, 1, 0, 1, 1, 1]
Độ tương đồng giữa 2 v&agrave; 1 l&agrave;:
US[course=2] . US[course=1] = 2 / 5
Độ tương đồng giữa 3 v&agrave; 2 l&agrave;:
US[course=3] . US[course=2] = 4 / 5
Nếu ng d&ugrave;ng học kh&oacute;a học 2 =&gt; gợi &yacute; kh&oacute;a học 3
b. Thuật to&aacute;n collaborative filtering cơ bản
                </p>
                <ul>
                    <li>
                        <p>
                            Memory based:
                        </p>
                    </li>
                    <li>
                        <p>
                            Model based
k-mean clustering
                        </p>
                    </li>
                </ul>
                <p>
                    where,
     &lsquo;||xi - vj||&rsquo; is the Euclidean distance between xi and vj.
     &lsquo;ci&rsquo; is the number of data points in ith cluster. 
     &lsquo;c&rsquo; is the number of cluster centers.
c. Thuật to&aacute;n t&iacute;nh độ ph&ugrave; hợp (dự đo&aacute;n rate)
                </p>
                <ul>
                    <li>
                        <p>
                            Distance base:
                        </p>
                    </li>
                    <li>
                        <p>
                            Recurrent neural network (deep learning)
                        </p>
                    </li>
                </ul>
                <ol>
                    <li>
                        Phần UI
a. Platform
Android
b. M&ocirc; tả chức năng ch&iacute;nh
                    </li>
                    <li>
                        Hiển thị những kh&oacute;a học đang được ưa th&iacute;ch nhất (tr&igrave;nh tự được phần đ&ocirc;ng người d&ugrave;ng đ&aacute;nh gi&aacute;)
                    </li>
                    <li>
                        Hiển thị phần survey để đ&aacute;nh gi&aacute; thị hiếu người d&ugrave;ng. Option kh&oacute;a học A, với kh&oacute;a học B
                    </li>
                    <li>
                        <p>
                            Hiển thị c&aacute;c kh&oacute;a học được recommend
                        </p>
                    </li>
                    <li>
                        <p>
                            C&ocirc;ng nghệ sử dụng
                        </p>
                    </li>
                </ol>
                <p>
                    a. Back-end technology
                </p>
                <ul>
                    <li>
                        Để t&igrave;m những người d&ugrave;ng tương đồng, ứng dụng c&oacute; ch&uacute;ng t&ocirc;i sử dụng thuật to&aacute;n: pearsonr (thư viện numpy) v&agrave; k-nearest neighbor (thư viện scikit-learn). B&ecirc;n cạnh đ&oacute; ch&uacute;ng t&ocirc;i cũng sử dụng thuật to&aacute;n k-mean clustering (thư viện scikit-learn) để t&igrave;m những cụm người d&ugrave;ng tương đồng. Thuật to&aacute;n n&agrave;y c&oacute; thể hạn chế được hiện tượng "profile injection attack".
                    </li>
                    <li>
                        Để t&iacute;nh được mức độ ph&ugrave; hợp của m&ocirc;n học với người d&ugrave;ng ch&uacute;ng t&ocirc;i c&oacute; hai phương ph&aacute;p. Phương ph&aacute;p thứ nhất l&agrave; t&iacute;nh điểm ph&ugrave; hợp bằng tổng của đ&aacute;nh gi&aacute; của c&aacute;c người d&ugrave;ng tương đồng nh&acirc;n với độ thương đồng. Phương ph&aacute;p thứ hai ch&uacute;ng t&ocirc;i sử dụng thuật to&aacute;n deep learning (thư viện tensorflow) cụ thể l&agrave; m&ocirc; h&igrave;nh recurrent neural network. Phương ph&aacute;p thứ hai c&oacute; thể tr&aacute;nh được overfitting do hiện tượng "profile injection attack".
b. Front-end technology
                    </li>
                    <li>
                        C&ocirc;ng cụ Android Studio
c. DB technology
                    </li>
                    <li>
                        MySQL
d. Programming languages
                    </li>
                    <li>
                        Python
                    </li>
                    <li>
                        Java
                    </li>
                    <li>
                        Android
                    </li>
                    <li>
                        SQL
                    </li>
                </ul>
                <p>
                    Link demo:
                    <a href="https://youtu.be/ONwe7EIc-OQ" rel="nofollow">
                        https://youtu.be/ONwe7EIc-OQ
                    </a>
                </p>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/chienptit941/HackathonHCVT" rel="nofollow" target="_blank" title="https://github.com/chienptit941/HackathonHCVT">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
