<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Dans les villes, il est difficile de faire des achats. En effet, les magasins sont nombreux et les produits vari&eacute;s. En tant que citoyen, nous voulons tous avoir le produit id&eacute;al et utiliser notre pouvoir d'achat efficacement. Comment savoir quels produits sont r&eacute;ellement les meilleurs parmi toutes les &eacute;tiquettes et r&eacute;ductions?
                </p>
                <h2>
                    Notre solution
                </h2>
                <p>
                    Heureusement, il y a le code barre! Ce code est unique &agrave; chaque produit et il est le m&ecirc;me peut importe le magasin. Notre application permet de lire ce code barre et fournir des informations essentielles pour choisir un produit. Vous voulez un produit local? Qui a utilis&eacute; peu d'eau? Toutes ces informations sont d&eacute;sormais &agrave; la port&eacute;e de votre main!
                </p>
                <h2>
                    Technologies
                </h2>
                <p>
                    Cette application est cr&eacute;e avec JQuery et Bootstrap. Nous avons opt&eacute; pour cette option afin d'assurer une portabilit&eacute; et une extensibilit&eacute; certaine.
                </p>
                <h2>
                    Les d&eacute;fis
                </h2>
                <p>
                    Nous avons &eacute;prouv&eacute; certaines difficult&eacute;s &agrave; trouver des API int&eacute;ressantes afin d'avoir des informations pertinentes sur les produits.
                </p>
                <h2>
                    Nos apprentissages
                </h2>
                <p>
                    Nous avons cr&eacute;&eacute; notre premi&egrave;re application web fonctionnelle sur un domaine. Nous avons beaucoup appris sur le language web et le hosting. Certains membres de l'&eacute;quipe ont appris sur le tas alors que d'autres ont approfondi leur compr&eacute;hension en expliquant des concepts aux autres.
                </p>
                <h2>
                    D&eacute;veloppement futur
                </h2>
                <p>
                    L'extensibilit&eacute; du syst&egrave;me est tr&egrave;s pr&eacute;sente. En effet, plusieurs fonctionnalit&eacute;s peuvent &ecirc;tre ajout&eacute;es &agrave; notre solution logicielle. Premi&egrave;rement, nous pouvons &eacute;tendre nos donn&eacute;es sur plusieurs crit&egrave;res tel que le prix et la valeur nutritive. Un syst&egrave;me de comparaison de produits sur plusieurs crit&egrave;res pourrait aussi &ecirc;tre impl&eacute;menter. Par exemple, apr&egrave;s un scan, le t&eacute;l&eacute;phone peut avertir qu'un item qui r&eacute;pond mieux &agrave; nos crit&egrave;res se situent dans un magasin environnant! Nous pourrions aussi ajouter un syst&egrave;me de budget &eacute;cologique selon des crit&egrave;res de gaspillage et d'utilisation de ressources pour &eacute;viter de d&eacute;passer, par exemple, un certain nombre de CO2 pour le mois!
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/jquery">
                                jquery
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/michr97/Hackatown2018" rel="nofollow" target="_blank" title="https://github.com/michr97/Hackatown2018">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="http://scanmycart.com" rel="nofollow" target="_blank" title="http://scanmycart.com">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                scanmycart.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
