<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/W-Ro2w2ClAI?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="914880" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/914/880/datas/original.png">
                            <img alt="Help a Friend &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/914/880/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="914854" data-title="Natural Language Processor doing Sentiment Analysis on messages" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/914/854/datas/original.png">
                            <img alt="Help a Friend &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/914/854/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Natural Language Processor doing Sentiment Analysis on messages
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="914903" data-title="Harrassing Language Reconsideration" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/914/903/datas/original.png">
                            <img alt="Help a Friend &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/914/903/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Harrassing Language Reconsideration
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    La messagerie instantan&eacute;e fait maintenant partie de notre quotidien, et de plus en plus de personnes utilisent plus ce moyen de communication que de parler face &agrave; face, en raison de son utilit&eacute;. Cependant, tout l'aspect humain et relationnel a &eacute;t&eacute; retir&eacute; de cette communication virtuelle. Il est souvent difficile de d&eacute;tecter les vraies intentions et les &eacute;motions derri&egrave;re un simple message. Notre but lors de ce projet est de vous aider &agrave; comprendre les subtilit&eacute;s pointant vers une signification plus complexe que pr&eacute;vu. Comme la cyber-intimidiation est un probl&egrave;me de plus en plus inqui&eacute;tant au sein de notre soci&eacute;t&eacute;, nous avons &eacute;galement d&eacute;cid&eacute; de rajouter cet aspect dans notre projet.
                </p>
                <p>
                    Instant messaging has been a huge part of our lives since childhood, and people seem to rely on it more and more everyday because of its practicality. However, a big aspect taken out of this type of virtual communication is the human contact and face-to-face. It's often hard to decipher the true meaning and emotions of a simple message. Our goal is to help you understand the signals hinting to a deeper meaning behind it, whether it be negative or positive. As cyber-bullying is a growing concern in our society, we decided to also tackle this problem.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    2 fonctionnalit&eacute;s principales :
                </p>
                <p>
                    Lorsque vous recevez un message inqui&eacute;tant de la part de votre ami, une notification vous est envoy&eacute;e avec la possibilit&eacute; d'acc&eacute;der &agrave; des ressources ext&eacute;rieures vous permettant d'aller chercher de l'aide.
                </p>
                <p>
                    Pour pr&eacute;venir la cyber-intimidation, notre plateforme reconna&icirc;t les messages haineux avant que ces derniers ne soient envoy&eacute;s et une option est offerte d'annuler d'envoyer ce message. Cela donne &eacute;galement le temps aux usagers de reconsid&eacute;rer leurs mots.
                </p>
                <p>
                    2 functionalities :
                </p>
                <p>
                    When an alarming message from your friend has been received, the platform reminds you to be mindful of your words.
                </p>
                <p>
                    To prevent more cyber-bullying, the platform recognizes speech hate when you send it. An option is then given to cancel sending the harmful message and gives you time to reconsider your actions.
                </p>
                <h2>
                    How We built it
                </h2>
                <p>
                    Nous avons utilis&eacute; node.js pour rouler et set up le serveur. Pour analyser les messages re&ccedil;us et envoy&eacute;s, l'API Google Cloud Natural Language a &eacute;t&eacute; utilis&eacute;. Deux param&egrave;tres &eacute;taient calcul&eacute;s, un score de positivit&eacute; (entre -1 et 1) et l'ampleur repr&eacute;sentant le degr&eacute; de s&eacute;v&eacute;rit&eacute; du message. Pour l'interface de notre plateforme de messagerie, nous avons utilis&eacute; HTML5 et pour la boite de clavardage, socket.io.
                </p>
                <p>
                    We used node.js to run and set up the server. To process the messages sent and received, the Google Cloud Natural Language API was used for sentiment analysis. Two parameters were calculated, the score of positivity (from -1 to 1) and the magnitude representing the level of severity. For the layout of the messenger platform, we used HTML5 and for the chatbox, socket.io.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Nous avons eu de la difficult&eacute; &agrave; tout set up et commencer &agrave; partir de z&eacute;ro, surtout que nous n'avions jamais eu d'exp&eacute;rience de ce genre auparavant. Nous n'avions jamais utilis&eacute; socket.io avant et nous avons pass&eacute; beaucoup de temps &agrave; lire de la documentation en ligne et &agrave; faire des tutorials. Il &eacute;tait &eacute;galement difficile d'impl&eacute;menter plusieurs usagers en m&ecirc;me temps qui peuvent se communiquer dans le m&ecirc;me serveur.
                </p>
                <p>
                    We had a hard time to set up everything from scratch as we have never undertaken such a project before. We never used socket.io before and we spent a lot of time reading documentations and doing tutorials. It was also hard to implement multiple users communicating with each other in a single server.
                </p>
                <h2>
                    Accomplishments that we are proud of
                </h2>
                <p>
                    Nous sommes tr&egrave;s fiers d'avoir r&eacute;ussi &agrave; compl&eacute;ter une site web fonctionnel en 24h avec une interface satisfaisante. Il est &eacute;galement tr&egrave;s satisfaisant de pouvoir avoir des conversations entre de multiples usagers. La plupart du temps, notre plateforme est en mesure de correctement d&eacute;tecter l'&eacute;motion ressentie derri&egrave;re les messages.
                </p>
                <p>
                    We are very proud to have a functional website with a pleasant user interface. It is very satisfying to be able to have a conversation between multiple users. We were also able to usually correctly detect the emotion behind the messages, achieving our goal.
                </p>
                <h2>
                    What We've learned
                </h2>
                <p>
                    Nous avons appris &agrave; &ecirc;tre d&eacute;brouillards et &agrave; pouvoir apprendre par nous-m&ecirc;mes en utilisant de mani&egrave;re efficace les ressources disponibles. Apprendre comment utiliser et manipuler plusieurs APIs en m&ecirc;me temps &eacute;tait &eacute;galement un but que nous nous sommes fix&eacute;s depuis le d&eacute;but.
                </p>
                <p>
                    We learned a lot about being more resourceful and learning on our own about new technologies. Learning how to use and manipulate multiple APIs at the same time was also a challenge that we set ourselves.
                </p>
                <h2>
                    What's next for Help a Friend
                </h2>
                <p>
                    &Agrave; l'avenir, nous souhaitons am&eacute;liorer notre d&eacute;tecteur d'&eacute;motions pour augmenter sa sensibilit&eacute; et sa pr&eacute;cision. Il serait &eacute;galement int&eacute;ressant de le d&eacute;velopper en tant qu'une extension sur Google Chrome, pour &ecirc;tre en mesure de l'utiliser sur diff&eacute;rentes plateformes telles que Messenger, Twitter and d'autres applications de messagerie.
                </p>
                <p>
                    In the future, we would like to improve our emotions detector and to tweak up the sensibility and accuracy. We would also be interested in building an extension in Chrome, so that it could be used in different platforms including Messenger, Twitter and all other messaging apps.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/express-js">
                                express.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            google-cloud-nlp
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/socket-io">
                                socket.io
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/toobad33/help-a-friend" rel="nofollow" target="_blank" title="https://github.com/toobad33/help-a-friend">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
