<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="433274" data-title="Kart i skolen. Eksisterende l&oslash;sning" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/274/datas/original.jpg">
                            <img alt="Historiske kart-portal &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/274/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Kart i skolen. Eksisterende l&oslash;sning
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433276" data-title="N&aring;v&aelig;rende galleril&oslash;sning for historiske kart" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/276/datas/original.jpg">
                            <img alt="Historiske kart-portal &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/276/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                N&aring;v&aelig;rende galleril&oslash;sning for historiske kart
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433275" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/275/datas/original.jpg">
                            <img alt="Historiske kart-portal &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/275/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433278" data-title="Eksempel p&aring; l&oslash;sning fra norgeibilder.no. Inspirasjon til Frontend" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/278/datas/original.jpg">
                            <img alt="Historiske kart-portal &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/278/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Eksempel p&aring; l&oslash;sning fra norgeibilder.no. Inspirasjon til Frontend
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Vi &oslash;nsker &aring; forenkle fremfinning av historiske kart. Hvilke historiske kart finnes for mitt omr&aring;de.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Vi &oslash;nsker at du skal f&aring; opp en treffliste for historiske kart ved &aring; klikke p&aring; ett punkt i f.eks. norgeskart.no
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Dette er et forprosjekt til en prototyp basert p&aring; et motoren bak MapWarper (&aring;pne kildekode). Den er ikke bygget, men vi &oslash;nsker mulighet til &aring; utveksle data med f.eks. Wikimedia
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Bugs og serverplass. Og mangel p&aring; programmerere.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Konseptutvikingen. Utviklere fra Wikimedia og Kartverket er i dialog, og kan utveksle data og ideer.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Vi har l&aelig;rt at alt vi trenger finnes allerede. "Motoren" virker, s&aring; det er ikke s&aring; mye som kreves for &aring; etablere.
                </p>
                <h2>
                    What's next for Historiske kart-portal
                </h2>
                <p>
                    Oppsett av l&oslash;sningen hos Kartverket og videre valg av l&oslash;sninger.
                </p>
                <p>
                    Invitasjon til digital dugnad: Georeferering av historiske kart
                </p>
                <p>
                    Kartverkets galleril&oslash;sning for historiske kart har stor p&aring;gang av brukere. Tilbakemeldinger viser stor brukertilfredshet, men det er et uttrykt &oslash;nske med enklere tilgang som viser &ldquo;alle historiske kart der jeg bor&rdquo;.  Av Kartverkets allerede digitaliserte kart (9500 pt) er om lag 2/3 georeferert i et eksisterende rutenett, men hva med de kartene som ikke er det? Arbeidsgruppen slo sine hoder sammen for &aring; utvikle et konsept som kan inspirere noen av deltakerne p&aring; h&oslash;stens hackaton til &aring; utvikle l&oslash;sningen som publikum og Kartverket &oslash;nsker seg. Resultatet er et forslag som gruppen mener til syvende og sist vil innby til digital dugnad av historiske kart, og som vil gi &oslash;kt brukeropplevelse.
                </p>
                <p>
                    M&aring;lgrupper:
Forskere: Historikere/arkeologer, lokalhistorikere/ historielag 
Museer
Arkivinstitusjoner
I undervisning, for eksempel Nasjonal Digital L&aelig;ringsArena (NDLA)
Deg og meg
                </p>
                <p>
                    L&oslash;sningen skal kunne koble sammen Kartverkets allerede eksisterende tjenester, nemlig galleril&oslash;sningen for historiske kart og norgeskart.no. I tillegg skal l&oslash;sningen v&aelig;re mulig &aring; bruke for andre akt&oslash;rer med egne kartsamlinger som statlige etater, kommuner, museer, privatpersoner osv.
                </p>
                <p>
                    Hovedl&oslash;sninger
1: Redigeringsl&oslash;sning
Kartverket &oslash;nsker en enkel og brukervennlig l&oslash;sning for georektifisering av historiske kart.
Backend blir &aring;pen kildekode og vil i stor grad v&aelig;re en kopi av Wikimaps Warper.
Frontend vil designes som en del av Kartverkets nettsider og gj&oslash;res mest mulig brukervennlig. Denne l&oslash;sningen b&oslash;r optimalt sett v&aelig;re &aring;pen kildekode slik at den kan gjenbrukes av andre.
                </p>
                <p>
                    2: Galleril&oslash;sning
Kartverket har i dag den eksisterende Galleril&oslash;sningen for historiske kart. 
Her &oslash;nsker vi et merke/tag som viser om det enkelte kart allerede er georeferert. Dette kan vises i form av en fargekode/sirkel/dott med fargen gul: georeferert, r&oslash;d: under arbeid: gr&oslash;nn: ikke georeferert
                </p>
                <p>
                    3: Norgeskart og andre tjenster
Kartverket &oslash;nsker flater til georefererte kart inn i tjenesten Norgeskart og en egen tjeneste. (se NorgeiBilder som eksempel)
                </p>
                <p>
                    Rutenett for serier, lenket opp til enkeltkart er allerede klart s&aring; mye kan legges ut i l&oslash;pet av kort tid som WMS.
                </p>
                <p>
                    Avklare l&oslash;sninger for kvalitetskontroll og oppdagelse av vandalisme.
Avklare metoder for brukerregistrering. B&oslash;r det f.eks v&aelig;re st&oslash;tte for Facebook-innlogging?
                </p>
                <p>
                    Praktiske sp&oslash;rsm&aring;l:
Hvor mange punkter pr kart m&aring; vi ha pr kart? Wikimedia krever minst tre punkter for &aring; rektifisere et gammelt kart. Historiske kart inneholder mange "feil" som ikke kan rektifiseres uten at opplevelsen av kartet blir forringet. To punkter er ofte nok for &aring; orientere kartet i retning og utstrekning.
                </p>
            </div>
        </div>
    </body>
</html>
