<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Dans le cadre du Hackatown organis&eacute; par LassondeHacks, nous avons eu 24 heures pour cr&eacute;er un projet bas&eacute; sur le concept de 
ville connect&eacute;. Nous avons d&eacute;cid&eacute; de cr&eacute;er un site encourageant l'engagement du citoyen dans sa municipalit&eacute;.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Nous avons premi&egrave;rement cr&eacute;&eacute; deux syst&egrave;mes pouvant g&eacute;rer la consommation d'eau potable et d'isolation thermique pour les maisons. 
Ces informations sont int&eacute;gr&eacute;es &agrave; diff&eacute;rents services permettant au citoyen de s'impliquer dans sa communaut&eacute; ou en rendant plus accessible 
diff&eacute;rents services offert par sa municipalit&eacute;. L'application g&eacute;n&egrave;re aussi du big data, permettant aux municipalit&eacute;s de mieux conna&icirc;tre leurs 
paroissiens et leurs habitudes.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Un Arduino permet d'&eacute;tablir une connexion avec les donn&eacute;es quantifiables qui nous entourent. Cet Arduino communique ensuite avec un serveur 
en Node.Js qui permet de faire des requ&ecirc;tes Mysql &agrave; un serveur web, rendant possible l'affichage des informations sur la propri&eacute;t&eacute; du client 
&agrave; travers les informations entourant cette ville.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    De nombreuses capacit&eacute;s techniques ont du &ecirc;tre d&eacute;velopp&eacute;es, telles que la programmation sur un microcontr&ocirc;leur, la cr&eacute;ation d'un serveur sur apache, 
le d&eacute;veloppement en &eacute;quipe &agrave; travers GIT, etc.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    R&eacute;ussir &agrave; mener &agrave; terme le projet dans des conditions peu favorables; cela est tr&egrave;s satisfaisant.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    La puissance que peut avoir une &eacute;quipe bien structur&eacute;e. M&ecirc;me avec les meilleurs talents, travailler seul revient &agrave; &ecirc;tre peu productif et une bonne
distribution des t&acirc;ches permet d'augmenter notre efficacit&eacute;.
                </p>
                <h2>
                    What's next for MaLitVille
                </h2>
                <p>
                    Le d&eacute;veloppement de nouveaux p&eacute;riph&eacute;riques, une meilleure application web, un serveur plus efficace, etc..
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/arduino">
                                arduino
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            mobile
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/FlyingZipper/HT17" rel="nofollow" target="_blank" title="https://github.com/FlyingZipper/HT17">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
