<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Die INCLUSIFY AG engagiert sich im Bereich "Software die das leben verbessert". Wir k&ouml;nnen den kompletten Lebenszyklus von Software abbilden und beraten im Bereich _ inclusive design _. 
Im Kontakt mit der &bdquo;Aktion Mensch&ldquo; und einigen Menschen mit Behinderung hat sich herausgestellt, dass Sprachassistenten nur nutzbar sind wenn man ohne gro&szlig;e Einschr&auml;nkungen sprechen kann. Aber gerade Menschen mit Behinderung w&uuml;rden vom nutzen der g&uuml;nstigen und weit verbreiteten Dienste wie Google Assistant oder Amazon Alexa stark profitieren.
                </p>
                <h2>
                    Was macht es
                </h2>
                <p>
                    Der Prototyp ersetzt die normale _ Speech to Text _ Funktionalit&auml;t von Google Assistant mit einem an den Benutzer oder die Benutzergruppe anpassbaren Modell. Danach schickt er die Spracheingabe als Text an den Google Assistant und erlaubt somit die Interaktion mit allen Assistants die registriert sind. Somit kann eine &Uuml;bersetzung f&uuml;r latente wie situative Sprachbehinderungen VOR dem properit&auml;ren System erfolgen.
                </p>
                <h2>
                    Was ich getan habe
                </h2>
                <ol>
                    <li>
                        Devicemodel und Device in der Google Console registrieren
                    </li>
                    <li>
                        .net Code aus den Google protocol buffers Definitionen generieren
                    </li>
                    <li>
                        Interaktion mit Google Assistant programmiert
                    </li>
                    <li>
                        Spracheingabe und Speech to Text mit eigenem Modell implementiert
                    </li>
                    <li>
                        Den erkanntent Text an den Google Assistant &uuml;bergeben
                    </li>
                </ol>
                <h2>
                    Herausforderungen
                </h2>
                <ul>
                    <li>
                        F&uuml;r .net Core ist kein SDK verf&uuml;gbar.
                    </li>
                    <li>
                        Die Dokumentation f&uuml;r den Google Assistant Service ist au&szlig;erhalb von Python recht d&uuml;rftig.
                    </li>
                    <li>
                        Auswahl der Programmiersprache: Es war keine optimale Sprache verf&uuml;gbar; Google Assitant SDK, Azure Custom Speech SDK oder Zugriff auf die Soundkarte. Eins war immer problematisch
                    </li>
                </ul>
                <h2>
                    Erreichtes Ziel
                </h2>
                <p>
                    Ich habe das Szenario komplett abbilden k&ouml;nnen. Spracheingabe --&gt; STT mittels eigenes Modell --&gt; Request an Google --&gt; Response von Google --&gt; Sprachausgagbe
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Einiges &uuml;ber Security und Authentifizierung im Bereich Google. 
Protocol Buffers in .net.
Conversational UI 
Pitching
                </p>
                <h2>
                    Was kommt als n&auml;chstes f&uuml;r INCLUSIFY  - Individualsierter Sprach Adapter
                </h2>
                <p>
                    In den n&auml;chsten Monaten werden wir mit der Humboldt Universit&auml;t in Berlin, dem inklusiven Coworkingspace
                    <em>
                        Tuechtig
                    </em>
                    und einigen Inklusionsberatern an der Verbesserung der Modelle arbeiten. Wenn die Modelle trainiert und validiert sind, werden wir die Funktionalit&auml;t als App ver&ouml;ffentlichen und B2B-Partner suchen, die den Sprach Adapter in ihren Anwendungsfall integrieren. Mit steigender Nutzerzahl werden die Modelle besser und vielf&auml;ltiger werden.
Langfristig ist auch eigene Hardware geplant, die auch den Anforderungen von Pflegeeinrichtungen erf&uuml;llen wird.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            .net-core
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            azure-custom-speech
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            google-assistant-service
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
