<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/featured?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Jeder kennt das Verlangen nach einem frisch gemischten Cocktail Zuhause, zum Beispiel im Zusammensein mit den Freunden. Also kreierten wir dieses attraktive Lifestyle Produkt, welches das Cocktailmischen jederzeit zu einem sprachgesteuerten und leckerem Kinderspiel macht, sei es vor dem Fernseher oder auf kleinen privaten Veranstaltungen wie beispielsweise Geburtstagen. Die Hauptanforderungen an das Produkt waren Cocktails einfach, schnell und lecker zuzubereiten. Die gro&szlig;e Auswahl an Rezepten erm&ouml;glicht es jeden Geschmack zu treffen.
Mit diesem Produkt l&auml;sst sich der nat&uuml;rliche Spieltrieb beziehungsweise die Experimentierfreudigkeit des Menschen f&ouml;rdern.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Mit der Cocktail-Maschine von INstar-Eventtechnik lassen sich leckere Cocktails und Longdrinks in k&uuml;rzester Zeit und auf einfachster Weise per Touchscreen oder Sprachsteuerung zubereiten. Die Maschine dosiert die jeweiligen Zutaten innerhalb von Sekunden f&uuml;r die verschiedensten Cocktails und gibt diese aus. 
Mithilfe des Touchsreens lassen sich noch weitere Optionen abbilden.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Die aktuelle Hardware besteht aus:
                </p>
                <ul>
                    <li>
                        Pumpenbaugruppe
                    </li>
                    <li>
                        Ein- und Ausgabebaugruppen
                    </li>
                    <li>
                        Computerhardware mit Touchdisplay
                    </li>
                    <li>
                        speicherprogrammierbare Steuerung (SPS)
                    </li>
                    <li>
                        Relaiskarten
                    </li>
                    <li>
                        Google Home
                    </li>
                </ul>
                <p>
                    Die aktuelle Software besteht aus:
                </p>
                <ul>
                    <li>
                        Codesys-Programm auf der SPS, die die Cocktailmischaufgaben &uuml;bernimmt
                    </li>
                    <li>
                        Sprachbefehlen, die durch IFTTT gel&ouml;st worden sind
                    </li>
                </ul>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Die Challenge war die Kommunikation der einzelnen Devices miteinander zu kombinieren und der Sprachsteuerung die passenden Wege zur Hardware zu erm&ouml;glichen.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Wir sind besonders stolz auf die Sprachsteuerung mit Google Assistant, die wir in die speicherprogrammierte Steuerung integrieren konnten.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Aus Fehlern lernt man. Zu jedem Fehler gibt es eine L&ouml;sung. Nichts ist unm&ouml;glich.
                </p>
                <h2>
                    What's next for INstar-Eventtechnik Cocktailmaschine
                </h2>
                <p>
                    In der Zukunft planen wir die Cocktail-Maschine kompakter zu bauen, um sie f&uuml;r den Einzelhandel und den Endkunden attraktiver zu machen. Das ganze soll durch Sprachsteuerung und einer App f&uuml;r das Smartphone unterst&uuml;tzt werden. In der App stehen beispielsweise die Rezepte zu den einzelnen Cocktails, wodurch man seinen n&auml;chsten Einkauf gezielter planen kann. Zudem kann die App Empfehlungen aussprechen, welche Cocktails dem Konsumenten ebenfalls schmecken k&ouml;nnten und ihm Vorschl&auml;ge bringen, welche zur Erweiterung der Rezeptliste beitragen. 
Eine gr&ouml;&szlig;ere Bauweise der Cocktailmaschine dient zum Vermieten f&uuml;r gr&ouml;&szlig;ere Verantstaltungen oder Bars und Discotheken.
Ein weiteres Projekt ist es zus&auml;tzlich unterschiedliche Ger&auml;te anzubinden wie beispielsweise eine Kaffeemaschine f&uuml;r den morgendlichen Wachmacher. 
Was weitere Ideen angeht, fehlt es bei uns nicht. Wir sind ein kreatives und motiviertes Team.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            api
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            google-home
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/hardware">
                                hardware
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            relais-boards
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            wago-sps-steuerung
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
