<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Norge mottar mange mennesker som flykter fra krig. N&aring;r de f&aring;r opphold flyttes de ut til boliger og leiligheter i Norge. Som kommune trenger vi &aring; ta det samfunnsansvaret det er &aring; legge til rette for at flyktninger opplever &aring; v&aelig;re fullverdige integrert. Dette er noe som bare kan gj&oslash;re ved samspill med menneskene i n&aelig;rmilj&oslash;et. For at dette skal lykkes, m&aring; vi gj&oslash;re det enklere &aring; ta kontakt, &aring; finne arenaer der man kan v&aelig;re med &aring; bidra. V&aring;r inspirasjon er &aring; utvikle et verkt&oslash;y som gj&oslash;r det enklere for mennesker &aring; m&oslash;tes, bidra til mer frivillig innsats og skape m&oslash;teplasser mellom flyktninger, nybosatte og lokalbefolkningen
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Skape arenaer for &aring; m&oslash;tes
Felles aktiviteter 
Arenaer for &aring; l&aelig;re norsk kultur og spr&aring;k gjennom felles aktiviteter
Informasjon
Koordinering av tilbud fra lag, foreninger, bedrifter, og frivillige.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Begynte med datamodell, etter planlegging og avklaring av hva vi skulle bygge. Implementerte datamodellen inn i MySQL Workbench. Begynte &aring; sette opp design. Programmerte videre opp mot databasen. Brukte kartverket for &aring; hente ut norgeskartet. Lastet ned data fra DIFI for &aring; kunne registrere koordinater i kartet.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Implementere koordinatdata i kart
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    De samfunnsmessige verdiene dette kan skape. &Aring; bidra til at vi lykkes med inkludering p&aring; Ringerike, og potensielt sett i hele Norge.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Involvering av brukeren er avgj&oslash;rende
Knytte til seg rett kompetanse og involvere n&oslash;kkelpersoner i prosessen.
                </p>
                <h2>
                    What's next for Team 10 INTO Ringerike
                </h2>
                <p>
                    Utvikle app videre med flere funksjoner:
Aktivitetskalender 
Informasjon
Arbeid
                    <br>
                    Multimedietiln&aelig;rming med facebook og film for &aring; n&aring; ut med budskapet 
Arbeide med &aring; senke terskelen for &aring; ta kontakt og bidra til felles innsats for &aring; inkludere flyktninger og nybosatte
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css3">
                                css3
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mysql">
                                mysql
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/scss">
                                scss
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            sprak
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            zutb-foundation
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
