<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nuestro proyecto naci&oacute; de la preocupaci&oacute;n respecto al poco acceso a tecnolog&iacute;a que tiene una gran mayor&iacute;a de los agricultores de este pa&iacute;s. Una considerable cantidad de los sistemas inteligentes dirigidos a la agricultura requieren como m&iacute;nimo una conexi&oacute;n estable a la red; lo cual es complicado, si no es que imposible, en un notable porcentaje del campo mexicano. En consecuencia, muchos de los recursos no son utilizados &oacute;ptimamente y son desperdiciados constantemente por esta falta de soluciones que consideren la realidad de los campos. Particularmente, el agua es utilizada y desperdiciada voluminosamente.  Por lo tanto, decidimos proponer una soluci&oacute;n que permitiera el uso adecuado de este recurso vital y, de este modo, desarrollamos un sistema de riego inteligente que no involucrara una conexi&oacute;n a internet y fuera costeable por los agricultores.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    iParcela busca facilitar el trabajo de los agricultores y optimizar el uso del agua a trav&eacute;s de un sistema de control de riego inteligente. En primer lugar, se desarroll&oacute; un dispositivo compuesto de tres sensores: de humedad, temperatura y presi&oacute;n. Cada dispositivo monitorea la parcela del cultivo espec&iacute;fico en el que es colocado. Estos se comunican inal&aacute;mbricamente entre s&iacute;, sin necesidad de una red wi-fi, a trav&eacute;s de dispositivos con se&ntilde;ales de radio. En segundo lugar, toda la informaci&oacute;n obtenida es procesada a trav&eacute;s de un algoritmo que utiliza una base de datos como par&aacute;metro para controlar el tiempo y la cantidad de agua destinada a cada parcela. Finalmente, cada parcela es configurada para un tipo distinto de cultivo a trav&eacute;s de una plataforma de escritorio. Esta aplicaci&oacute;n fue dise&ntilde;ada de manera interactiva y gr&aacute;fica para que pueda ser utilizada hasta por personas que no saben leer ni escribir.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    El desarrollo del producto consisti&oacute; de dos partes: software y hardware.
                </p>
                <p>
                    Por un lado, el hardware consta de tarjetas Arduino Mega 2560, que representan el sistema de riego individual de cada una de las parcelas del plant&iacute;o, conectadas a un shield que permite la intercomunicaci&oacute;n de manera inal&aacute;mbrica entre cada tarjeta. Dichos shield utilizan m&oacute;dulos Xbee para comunicarse independientemente del Internet a una distancia restringida. Adem&aacute;s, cada uno de los sistemas cuenta con sensores de temperatura y humedad independientes que pueden activar el sistema de riego bajo condiciones espec&iacute;ficas del d&iacute;a de manera que se ahorre la mayor cantidad de agua.
                </p>
                <p>
                    Por otra parte, el software consta de una simple interfaz gr&aacute;fica que presenta, mediante dibujos, las distintas posibilidades de interacci&oacute;n entre el agricultor y el sistema de riego. Esta aplicaci&oacute;n es &ldquo;hosteada&rdquo; de manera local para mantener la independencia del Internet. A trav&eacute;s de ella el agricultor puede actualizar de manera instant&aacute;nea los par&aacute;metros de humedad y temperatura que cada uno de los plant&iacute;os a lo largo de las distintas temporadas del a&ntilde;os.
                </p>
                <p>
                    De esta manera logramos principalmente dos cosas: primero fue optimizar la manera en que se desarrolla el riego de los plant&iacute;os de los agricultores, optimizando el tiempo de riego y la hora del d&iacute;a a la que se aplica; segundo fue facilitar el trabajo del agricultor que, aunque debe seguir monitoreando el estado de sus plant&iacute;os, reduce la carga de trabajo al automatizar por horarios los procesos de riego.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    A pesar de que hab&iacute;amos trabajado antes con distintos sensores y tarjetas Arduino, la implementaci&oacute;n de un sensor de temperatura y humedad fue un reto ya que utiliza protocolos de comunicaci&oacute;n distintos a los que hab&iacute;amos manejado anteriormente.
                </p>
                <p>
                    No obstante, habiendo superado el reto anterior, fue a&uacute;n m&aacute;s retador enfrentamos a la comunicaci&oacute;n inal&aacute;mbrica a trav&eacute;s de los distintos elementos dentro del sistema sin utilizar ninguna conexi&oacute;n a Internet. Puesto que la comunicaci&oacute;n entre los XBee&rsquo;s fue muy complicada de implementar, a veces dos se comunicaban y el otro no o a veces uno recib&iacute;a pero no pod&iacute;a mandar informaci&oacute;n. Fue un proceso de prueba y error de varias horas hasta que logramos que los dispositivos estuvieran configurados correctamente.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    A lo largo de las 24 horas que tuvimos para desarrollar este proyecto aprendimos mucho, no solo del uso de sensores que nunca antes hab&iacute;amos utilizado, sino tambi&eacute;n de protocolos de comunicaci&oacute;n que son independientes del Internet o los protocolos m&aacute;s utilizados.
                </p>
                <p>
                    Finalmente, la mayor experiencia que vivimos este fin de semana fue la de trabajar en equipo para desarrollar una idea que no solamente busca ganar dinero sino tambi&eacute;n hacer un impacto positivo en un problema social. Creemos fervientemente que esta soluci&oacute;n puede ser adaptada para los distintos tipos de riego y caracter&iacute;sticas de las distintas zonas del pa&iacute;s, para que a trav&eacute;s de ella el ahorro de agua y trabajo de los agricultores sea aumentado de manera considerable.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Como fue mencionado anteriormente, el mayor de nuestros logros este fin de semana fue el aprender a trabajar con herramientas nuevas como lo son sensores de humedad y temperatura. Pero no solo eso, sino tambi&eacute;n la implementaci&oacute;n de un sistema que va desde una aplicaci&oacute;n local de escritorio, hasta la activaci&oacute;n de peque&ntilde;os elementos de riego a lo largo de los plant&iacute;os de los agricultores. A&ntilde;adiendo adem&aacute;s que el sistema fuera independiente de las comunicaciones Wi-fi que, a pesar de tener grandes virtudes, se comete el error de suponer que es un recurso con el que se cuenta de manera constante y facilmente a lo largo de las distintas regiones rurales de nuestro pa&iacute;s.
                </p>
                <h2>
                    What's next for iParcela
                </h2>
                <p>
                    Nuestro siguiente paso es tener un contacto con personas que tengan una experiencia mucho m&aacute;s directa con las situaciones espec&iacute;ficas de los plant&iacute;os y m&eacute;todos de riego actuales, ya sea directamente con los agricultores o con distintas organizaciones que se dediquen al estudio de estos temas. Nuestro objetivo al acercarnos con estas personas es enriquecer la informaci&oacute;n que podemos monitorear a trav&eacute;s de la implementaci&oacute;n de nuevos sensores y la mejora de nuestra automatizaci&oacute;n del riego para conseguir el modelo &oacute;ptimo.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/arduino">
                                arduino
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/c--3">
                                c++
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            electron
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            sensores
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            winjs
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            xbee
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/isabeldiazmi/SAO" rel="nofollow" target="_blank" title="https://github.com/isabeldiazmi/SAO">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
