<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="434276" data-title="Logo S&Uacute;MATE" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/434/276/datas/original.png">
                            <img alt="S&uacute;mate &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/434/276/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Logo S&Uacute;MATE
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    &iquest;Qui&eacute;nes somos?
                </h2>
                <p>
                    Somos un medio creado con la finalidad de incrementar la participaci&oacute;n ciudadana de manera colaborativa a trav&eacute;s de ideas que sean consideradas para mejorar proyectos gubernamentales, reformas de ley, plebiscitos, etc&hellip; 
Somos un medio a trav&eacute;s del cual los ciudadanos pueden dar a conocer sus ideas, propuestas y proyectos con la finalidad de ser escuchados, fomentar la participaci&oacute;n ciudadana y crear un cambio en su entorno.
                </p>
                <h2>
                    &iquest;C&oacute;mo funciona?
                </h2>
                <p>
                    La plataforma S&Uacute;MATE tiene como prop&oacute;sito fomentar la participaci&oacute;n ciudadana por medio de opiniones que ayuden a mejorar alg&uacute;n eje del sector pol&iacute;tico. En dicha plataforma los ciudadanos tendr&aacute;n la oportunidad de compartir alguna propuesta que podr&aacute; ser mejorada/ estructurada con ayuda de otros miembros de la plataforma, as&iacute; mismo estos podr&aacute;n votar por las mejores propuestas, y aquellas que generen mayor impacto ser&aacute;n tomadas en cuenta por los dirigentes pol&iacute;ticos.
                </p>
                <h2>
                    Proceso:
                </h2>
                <ul>
                    <li>
                        Para quienes ofrecen una propuesta de mejora:
                    </li>
                    <li>
                        Crea tu perfil registrando tu identificaci&oacute;n oficial, nombre de usuario y correo electr&oacute;nico
                    </li>
                    <li>
                        Graba tu video en cualquier dispositivo
                    </li>
                    <li>
                        Sube y comparte tu video
                        <br>
                        -Para quienes tienen la intenci&oacute;n de apoyar la propuesta de mejora:
                    </li>
                    <li>
                        Reg&iacute;strate o ingresa a tu cuenta de usuario
                    </li>
                    <li>
                        Dar like apoyo sumar
                    </li>
                    <li>
                        Contribuye con ideas para la mejora de un proyecto
                    </li>
                </ul>
                <h2>
                    Estamos orgullosos de haber logrado
                </h2>
                <p>
                    Una plataforma accesible, sencilla e intituitiva que permite el acceso r&aacute;pido, f&aacute;cil y seguro a muchas propuestas ciudadanas.
                </p>
                <h2>
                    Hemos aprendido...
                </h2>
                <p>
                    Que podemos obtener muchos beneficios de las tecnolog&iacute;as de la informaci&oacute;n y la comunicaci&oacute;n y que, en un &aacute;rea tan necesitada e importante como lo es el Gobierno. Podemos proponer, emprender y contruir soluciones conjuntas que generen el mejor beneficio para nuestra sociedad.
                </p>
                <h2>
                    &iquest;Qu&eacute; sigue? jaimelr.github.io
                </h2>
                <p>
                    &iexcl;Muchas cosas! Confiamos en nuestro proyecto y sabemos que va a salir adelante, planeamos continuar con:
                </p>
                <ul>
                    <li>
                        Un dominio para nuestro sitio
                    </li>
                    <li>
                        Una base de datos propia para almacenar usuarios.
                    </li>
                    <li>
                        Implementaci&oacute;n de las estad&iacute;sticas para la propuesta
                    </li>
                    <li>
                        Y por supuesto, labores de publicidad, mucha publicidad.
                    </li>
                </ul>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/jaimelr/jaimelr.github.io" rel="nofollow" target="_blank" title="https://github.com/jaimelr/jaimelr.github.io">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
