<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="558256" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/256/datas/original.png">
                            <img alt="Jobeer &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/558/256/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    <strong>
                        Jobeer
                    </strong>
                    - Vi gj&oslash;r Jobbs&oslash;k enklere
                </h2>
                <p>
                    <br>
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Att s&ouml;ka jobb idag &auml;r en l&aring;ng, tidskr&auml;vande process, det kan i till&auml;gg f&ouml;r m&aring;nga vara sv&aring;rt och besv&auml;rligt. Vi fr&aring;gade varandra, vad kan vi g&ouml;ra &aring;t detta h&auml;r? Det var d&aring; vi kom p&aring; l&ouml;sningen, Jobeer.
                </p>
                <p>
                    <br>
                </p>
                <h2>
                    Vad &auml;r Jobeer?
                </h2>
                <p>
                    Jobeer &auml;r en app som ska hj&auml;lpa dig som privatperson att f&ouml;renkla processen vid jobbs&ouml;kning och karri&auml;rval. Jobeer kommer ocks&aring; f&ouml;renkla rekryteringsprocessen f&ouml;r arbetsgivare.
                    <br>
                </p>
                <h2>
                    Vad g&ouml;r appen?
                </h2>
                <p>
                    <strong>
                        Jobeer
                    </strong>
                    visar fram relevanta jobbannonser f&ouml;r dig. Annonserna visas i Kart, listvy och i JobeerSwipe. Jobeer inneh&aring;ller alla jobbannonser fr&aring;n NAV.no och Finn.no.
                    <br>
                    <strong>
                        JobeerSwipe
                    </strong>
                    &auml;r ett enkelt s&auml;tt att s&ouml;ka jobb d&auml;r du Swiper eller ger tummen upp eller ned f&ouml;r jobbannonser du tycker &auml;r interessant. Funktionen kan efterliknas med Tinder fast f&ouml;r jobbs&ouml;k. I Jobeerswipe viser du intresse f&ouml;r ett jobb p&aring; basis av faglig kompetens och utbildning. Du g&aring;r sedan in i en lista &ouml;ver jobb som du givit tummen upp d&auml;r du kan s&ouml;ka jobbet.
                    <br>
                    <strong>
                        CV &amp; Profil
                    </strong>
                    <br>
                    I Jobeer kan du registrera dig med din kontaktinfo, eller koppla mot Facebook f&ouml;r att skapa en profil. P&aring; profilen kan du l&auml;gga in din information till ett CV och s&ouml;knadsbrev d&auml;r appen skapar ett CV och s&ouml;knadsbrev utifr&aring;n standardmallar. 
Du kan ocks&aring; v&auml;lja att h&auml;mta ned din CV fr&aring;n LinkedIn eller fr&aring;n cloud tj&auml;nster som f.eks. Google Drive, ICloud Drive och OneDrive. Det kommer ocks&aring; fungera att ta en bild och &rdquo;scanna&rdquo; in ditt CV.
                    <br>
                    <strong>
                        Filtrering &amp; IA
                    </strong>
                    <br>
                    En av v&aring;ra stora m&aring;l med applikationen &auml;r att alla ska kunna s&ouml;ka sig ett jobb med Jobeer. D&auml;rf&ouml;r har vi integrerat (IA) &rdquo;Inkluderande Arbeidsliv&rdquo; i appen. D&auml;r kan b&aring;de jobbs&ouml;kare och firmaanv&auml;ndare l&auml;gga ut en IA-profil.&nbsp;Ett f&ouml;retags IA-profil kan tillexempel vara att firman &auml;r specialanpassad f&ouml;r dig som &auml;r handikappad, f&ouml;r dig som har varit utanf&ouml;r arbetslivet p&aring; grund av psykisk h&auml;lsa eller dig som har varit p&aring; rehabilitering p&aring; institution.
F&ouml;r att hitta dig ett jobb s&aring; jobbar vi med filtrering och s&ouml;kord. Du kan g&ouml;ra ett s&ouml;k efter jobbtitel, bransje, f&ouml;retag eller nyckelord. Vid listvy, kartvy och swipefunktion kan du v&auml;lja att filtrera jobb som kommer upp efter tillexempel bransje, stillingstype, faglig kompetanse eller inkluderende arbeidsliv.
N&auml;r du s&ouml;ker ett jobb s&aring; skickas ditt CV in i arbetsgivarens Office/Sharepoint d&auml;r arbetsgivaren kan behandla s&ouml;knaden. Om f&ouml;retaget inte &auml;r hos Jobeer kommer dem f&aring; en mail fr&aring;n Jobeer med ditt CV och kontaktinfo eller bli vidarebefordrad till arbetsgivarens interna rekrutteringsplattform. &nbsp;
                    <br>
                    <strong>
                        Chat &amp; Chattbotten "Jobbot"
                    </strong>
                    <br>
                    N&auml;r en arbetsgivare har visat ett intresse av din s&ouml;knad s&aring; kommer du f&aring; upp ett meddelande i Jobeers chattfunktion i appen. D&auml;r kan du och arbetsgivaren prata med om jobbet eller boka en f&ouml;rstag&aring;ngsintervju. Om f&ouml;retaget inte &auml;r registrerad hos Jobeer s&aring; f&aring;r du som p&aring; det traditionella s&auml;ttet ett mail eller telefonsamtal f&ouml;r mer information.
Chattfunktionen i Jobeer har ocks&aring; en Chattbot som heter &rdquo;Jobbot&rdquo; som hj&auml;lper dig med fr&aring;gor g&auml;llande s&ouml;kning av jobb. Den kan tillexempel ge information runt &rdquo;Hva er mine Rettigheter og plikter&rdquo;, &rdquo;Sp&oslash;rsm&aring;l og svar rundt inkluderende arbeidsliv&rdquo;, &rdquo;Forventet l&oslash;nn innenfor bransje&rdquo; eller &rdquo;Hvordan fungerer Jobeer?&rdquo;.
                    <br>
                    <strong>
                        Bedrifter
                    </strong>
                    <br>
                    Alla f&ouml;retag som registrerar sig som bedriftsbruker i Jobeer kan f&aring; integrerat en Managementportal i deras Office365 och Sharepoint. D&auml;r ska f&ouml;retagen kunna administrera sina annonser, se s&ouml;knader och se statistik.
&nbsp;
                </p>
                <h2>
                    Hur &auml;r den byggd?
                </h2>
                <p>
                    Vi anv&auml;nder Xamarin forms f&ouml;r att kunna g&ouml;ra Native-crossplatform apps p&aring; de tre st&ouml;rsta platformarna(iOS, Andrioid och Windows 10). Vi har anv&auml;nt &ouml;ppen data fr&aring;n NAV och vi har f&aring;tt tillg&aring;ng till Finn.no's API, vi anv&auml;nder ocks&aring; &ouml;ppen data fr&aring;n Statistisk sentralbyr&aring;, f&ouml;r att kunna ge anv&auml;ndaren relevant information om sitt jobbs&ouml;k. Tillexempel l&ouml;n innanf&ouml;r en specifik branch.
Vi har ocks&aring; byggt en nettsida som &auml;r programmerad i HTML5.&nbsp; 
&nbsp;
                </p>
                <h2>
                    Vart &auml;r vi idag?
                </h2>
                <p>
                    Prototyp av Interface, jobbannonser och jobbs&ouml;k.
&nbsp;
                </p>
                <h2>
                    Utfordinger
                </h2>
                <p>
                    F&ouml;rhandlafram flera tags i Nav's API. Bland annat Geo-Rss tag.
&nbsp;
                </p>
                <h2>
                    Prestationer vi &auml;r stolt &ouml;ver
                </h2>
                <p>
                    Denna l&ouml;sning kan g&ouml;ra stor nytta i samh&auml;llet. Det kommer vara en hj&auml;lpande hand i vardagen f&ouml;r m&aring;nga m&auml;nniskor. Vi &ouml;nskar att appen ska bevisa f&ouml;r m&auml;nniskor att det faktiskt &auml;r enkelt &aring; f&aring; ett jobb.
                </p>
                <h2>
                    Vad har vi l&auml;rt oss?
                </h2>
                <p>
                    Vi kan mer &auml;n vi tror.
                </p>
                <h2>
                    Vad &auml;r Jobeers framtidsplaner?
                </h2>
                <p>
                    Vidareutveckla appen till lansering som &auml;r planerad till Q2 2018. 
Senare att anpassa appen mot Sverige och sedan Norden.
                </p>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://jobeerapp.com" rel="nofollow" target="_blank" title="http://jobeerapp.com">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                jobeerapp.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="http://facebook.com/jobeerapp" rel="nofollow" target="_blank" title="http://facebook.com/jobeerapp">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                facebook.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="http://Instagram.com/jobeerapp" rel="nofollow" target="_blank" title="http://Instagram.com/jobeerapp">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                Instagram.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
