<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="299563" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/299/563/datas/original.png">
                            <img alt="Millo &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/299/563/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Como cada d&iacute;a la crisis econ&oacute;mica azota m&aacute;s a la poblaci&oacute;n, el ahorrar se ha vuelto m&aacute;s dif&iacute;cil. As&iacute; que nuestra inspiraci&oacute;n se bas&oacute; en la premisa de un sistema de ahorro muy riesgoso llamado tanda; el cual propon&iacute;a que se ahorrara una cierta cantidad en un cierto tiempo, y as&iacute; turnarse ese c&uacute;mulo hasta que todas las personas hayan recibido su parte. Pero nunca con la seguridad de que la persona jamas escapar&iacute;a con el dinero.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Nuestra aplicaci&oacute;n lo que crea es un sofisticado sistema, el cual otorga la seguridad a las personas para que puedan meter desde peque&ntilde;as cantidades de dinero en periodos cortos, hasta grandes cantidades de dinero en largos periodos entre muchas personas conocidas o desconocidas.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Comenzamos con una interfaz amigable en HTML para cualquier tipo de usuario que contenga una tarjeta de cr&eacute;dito y acceso a internet.
Los procesos din&aacute;micos los desarrollamos con JavaScript.
La base de datos las construimos desde node.js para una comunicaci&oacute;n m&aacute;s efectiva.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Nos enfrentamos a diversos problemas de conocimientos; como el manejar distintos lenguajes desconocidos, o errores dif&iacute;ciles de detectar por la inexperiencia en el sector.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Al final logramos sacar a la luz un prototipo confiable y practico para el uso de la clase media  de 18 a 55 a&ntilde;os. El sistema operativo requiri&oacute; de una ardua labor ya que se ensambl&oacute; y se aprendieron nuevos sistemas. Y por supuesto, el aterrizar una idea y juntarse para ser un equipo, requiri&oacute; de un car&aacute;cter decisivo y eficaz.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Como equipo aprendimos que cada idea cuenta por sencilla que sea, de una en una se engrandece. El apoyo y la dedicaci&oacute;n de cada integrante fue de mucha importancia para llevar a cabo este prototipo. 
Toda idea lleva un sacrificio, nosotros la tomamos y esta aqu&iacute;. La comunicaci&oacute;n y la participaci&oacute;n fueron factores imprescindibles en este equipo.
                </p>
                <h2>
                    What's next for jocular-waddle
                </h2>
                <p>
                    Lo siguiente es seguir con este prototipo. Se tiene que aterrizar a&uacute;n m&aacute;s la idea y claro, mejorarla con otros servicios para que tenga una gama y as&iacute; pueda ser m&aacute;s atractiva. Seguir innovando y mejorar el sistema operativos ser&aacute;n de mucha importancia para que despegue.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/coffeescript">
                                coffeescript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/objective-c">
                                objective-c
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://millo.hackmx.co.vu:8000/" rel="nofollow" target="_blank" title="http://millo.hackmx.co.vu:8000/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                millo.hackmx.co.vu
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
