<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Vos habitudes font de vous ce que vous &ecirc;tes, il faut donc en prendre de bonnes pour r&eacute;ussir, que ce soit aujourd&rsquo;hui ou demain. 
Les gens n'arrive pas &agrave; adopter ou changer leurs habitudes, principalement &agrave; cause de manque de motivation, fatigue et parfois le mauvais choix des nouvel habitude.
                </p>
                <p>
                    Dans n&rsquo;importe quel domaine ou on est, on y retrouve toujours des personnes qui ont fait un parcours exceptionnel qu&rsquo;on aimerait tous faire. Alors pour y arriver on s&rsquo;inspire de ces personnes qu&rsquo;on appelle souvent idole pour r&eacute;ussir comme eux. Pour vous aider &agrave; vous inspirer encore plus de vos h&eacute;ros et suivre leurs chemins, on met &agrave; votre disposition notre application qui va vous accompagner dans votre quotidien et qui veillera &agrave; ce que vous ayez de bon comportement et de bonne habitudes en vous proposant de diff&eacute;rente activit&eacute;s &agrave; faire en se basant sur les activit&eacute;s des c&eacute;l&eacute;brit&eacute;s qui vous int&eacute;ressent et qui vous convient.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Fonctionnalit&eacute;s :
                </p>
                <ol>
                    <li>
                        L&rsquo;application permet de cr&eacute;er un compte (le compte sera enregistr&eacute; dans le serveur de l&rsquo;application)
                    </li>
                    <li>
                        &Agrave; la cr&eacute;ation de compte, l&rsquo;utilisateur choisira ses centre d'int&eacute;r&ecirc;t (sport, music, litt&eacute;rature, art, science...)
                    </li>
                    <li>
                        L&rsquo;application lui propose des c&eacute;l&eacute;brit&eacute;s selon son centre d'int&eacute;r&ecirc;t pour qu&rsquo;il choisit ceux qui l&rsquo;inspire, l&rsquo;application veille &agrave; ce qu&rsquo;elle lui propose des activit&eacute;s dans le domaine de ses idoles (en lui motivant avec leur story succ&egrave;s et leurs r&eacute;alisation) ce que vas pousser l&rsquo;utilisateur &agrave; suivre leur chemin pour adopter de bonne habitudes, ce que va lui permettre d'atteindre ses objectifs
                    </li>
                    <li>
                        L&rsquo;application vas notifier l&rsquo;utilisateur pour r&eacute;aliser ses activit&eacute;s quotidiennes.
                    </li>
                    <li>
                        L&rsquo;utilisateur pourra accepter ou refuser l&rsquo;activit&eacute;
                    </li>
                    <li>
                        Les activit&eacute;s accept&eacute;es seront ajout&eacute;es automatiquement &agrave; la liste des activit&eacute;s faite ou &agrave; faire selon son type
                    </li>
                    <li>
                        L&rsquo;application enregistre les activit&eacute;s accept&eacute;s ou refus&eacute;s par l&rsquo;utilisateur et effectue des comparaisons pour afficher un taux de ressemblance avec ses idoles, alors soit on le f&eacute;licite d'atteindre un bon r&eacute;sultat, soit on l'avertit et l'encourager de travailler plus
                    </li>
                    <li>
                        L&rsquo;application motivera l&rsquo;utilisateur en lui envoyant en notification des faits de la vie de leurs idoles et les &eacute;preuves qu&rsquo;ils ont surmont&eacute;es dans la vie et leurs belles r&eacute;alisations
                    </li>
                    <li>
                        L&rsquo;utilisateur pourra aussi sugg&eacute;rer des noms d&rsquo;idoles qui ne sont pas dans notre base de donn&eacute;es, et les plus demand&eacute;s seront ajout&eacute; au fur et &agrave; mesure de l&rsquo;avancement de l'application
                    </li>
                    <li>
                        L&rsquo;application propose de temps en temps des c&eacute;l&eacute;brit&eacute;s de domaine non choisi et inviter l&rsquo;utilisateur &agrave; les d&eacute;couvrir pour le pousser &agrave; s'int&eacute;resser au domaine, et ouvrir son esprit &agrave; des nouvel connaissance et activit&eacute;s
                    </li>
                </ol>
                <h2>
                    How we built it
                </h2>
                <p>
                    Application mobile r&eacute;aliser par : Flutter, Android Studio, Firebase
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Aider les gens &agrave; entretenir de bonne habitudes tout en les &eacute;loignant de leurs mauvaises habitudes.
                </p>
                <p>
                    On vise &agrave; changer les mauvaises habitudes des gens malgr&eacute; leurs diff&eacute;rences.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Trouver une solution qui aide les gens &agrave; adopter de bonnes habitudes en suivant leurs Idoles
                </p>
                <p>
                    Etre les premiers &agrave; r&eacute;aliser une fonctionnalit&eacute; et la d&eacute;poser dans le devpost.
                </p>
                <p>
                    R&eacute;aliser un excellent travaille en groupe durant un temps limite.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    travailler rapidement  et efficacement
Am&eacute;liorer l&rsquo;id&eacute;e dans les cot&eacute;
Organiser l'&eacute;quipe pour r&eacute;aliser les taches dans les d&eacute;lais
                </p>
                <h2>
                    What's next for JustHobit
                </h2>
                <p>
                    Diminuer l'addiction a la technologie en sugg&eacute;rant des activit&eacute;s qui le pousse a prendre une distance entre lui et &ccedil;a machine (Activit&eacute;s physiques).
Multi langue.
Faire un classement en basant sur le nombre d&rsquo;activit&eacute; r&eacute;alis&eacute; suivant une c&eacute;l&eacute;brit&eacute; donn&eacute;, dans le but de cr&eacute;&eacute; une concurrence entre les utilisateur  pour r&eacute;aliser plus d'activit&eacute;s.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            dart
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/firebase">
                                firebase
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/flutter">
                                flutter
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            kotlin
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/objective-c">
                                objective-c
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/swift">
                                swift
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/abdallaho98/JustHobit" rel="nofollow" target="_blank" title="https://github.com/abdallaho98/JustHobit">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
