<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Biometric Keystroke Pattern Recognition 
Nhận biết người d&ugrave;ng qua Keystroke Pattern
                </p>
                <p>
                    Sản phẩm: ​
KeyStroke 
Nh&oacute;m: ​
HA 10 &shy; 0x1115
                </p>
                <p>
                    Tại sao 
○ Biometric Recognition (Biometric Identification) &shy; Nhận diện sinh trắc được coi l&agrave; 
một trong những c&aacute;ch hiệu quả để nhận biết v&agrave; x&aacute;c định c&aacute;c c&aacute; nh&acirc;n 
○ Hứa hẹn l&agrave; một trong những yếu tố then chốt nhưng việc triển khai vẫn c&ograve;n 
những kh&oacute; khăn. V&iacute; dụ cụ thể: Kiểm so&aacute;t thi sinh khi l&agrave;m b&agrave;i kiểm tra tự luận 
online.
                </p>
                <ol>
                    <li>
                        Cơ sở hạ tầng cho những phương ph&aacute;p như: nhận dạng khu&ocirc;n mặt, 
giọng n&oacute;i,..vv thường phức tạp, bất tiện, đ&ograve;i hỏi chi ph&iacute; triển khai lớn, khi 
đem &aacute;p dụng v&agrave;o việc thi trực tuyến th&igrave; hiệu quả cuối thu lại kh&ocirc;ng thực 
sự thuyết phục
                    </li>
                    <li>
                        Keystroke Pattern: Tr&aacute;nh được c&aacute;c nhược điểm tr&ecirc;n, hiệu quả đem lại 
cũng r&otilde; rệt. 
Như thế n&agrave;o 
○ Người d&ugrave;ng l&agrave;m b&agrave;i thi tự luận theo flow b&igrave;nh thường, ứng dụng hoạt động ngầm 
thu thập lại c&aacute;c th&ocirc;ng tin cần thiết như ph&iacute;m g&igrave;, thời gian keydown, thời gian 
keyup, thời gian giữ ph&iacute;m, c&aacute;c ph&iacute;m g&otilde; sai..vv Dữ liệu thu thập được c&oacute; thể gửi 
đến server real&shy;time hoặc gửi tập trung khi người d&ugrave;ng submit. 
○ Sau khi b&agrave;i l&agrave;m được submit, dịch vụ tiến h&agrave;nh kiểm tra ch&eacute;o với mẫu sinh trắc 
người d&ugrave;ng đ&atilde; được khởi tạo trước.
                        <br>
                        ○ Hệ thống cập nhật lại trạng th&aacute;i của b&agrave;i l&agrave;m sau khi kiểm tra. 
○ Người d&ugrave;ng nhận th&ocirc;ng b&aacute;o trong khi kiểm tra 
Độ kh&oacute; v&agrave; c&ocirc;ng nghệ ứng dụng 
○ X&acirc;y dựng thuật to&aacute;n, model Machine Learning v&agrave; tr&iacute;ch xuất dữ liệu ph&ugrave; hợp. 
Điểm kh&oacute; khăn l&agrave; muốn x&aacute;c định đ&uacute;ng Model phải c&oacute; một lượng data đủ lớn.
                        <br>
                        ○ Thu thập lượng data sample cần thiết đủ lớn nhưng kh&ocirc;ng g&acirc;y kh&oacute; chịu cho 
người d&ugrave;ng. 
○ Đảm bảo performance cũng như độ ch&iacute;nh x&aacute;c, tin cậy. 
C&aacute;c phương hướng giải quyết: 
● X&acirc;y dựng mini&shy;game theo format Typing Race để thu thập data sample: ​
Chưa 
triển khai. 
● X&acirc;y dựng theo m&ocirc; h&igrave;nh non&shy;blocking: Việc kiểm tra được thực thi sau, theo queue thay v&igrave; bắt người d&ugrave;ng phải đợi. ● X&acirc;y dựng v&agrave; thay đổi c&aacute;c model cho ph&ugrave; hợp với từng giai đoạn 
Trong khu&ocirc;n khổ cuộc thi: Thử nghiệm Web Application l&agrave;m b&agrave;i thi online 
● Backend:
                        <br>
                        ○ RESTful API quản l&yacute; User, Assignment, Submission 
■ PHP 
■ Lumen Framework 
■ Redis 
■ Nginx 
○ Websocket Real&shy;time nhận dữ liệu thu thập: ​
Chưa triển khai 
■ ExpressJS 
■ Socket.IO 
■ Giao tiếp pub/sub, ioredis với Lumen 
○ Xử l&yacute; dữ liệu, ph&acirc;n loại Submission 
■ Python 
■ Scilearn 
■ Model &aacute;p dụng: Random Forest 
● Frontend: 
○ MVVM: VueJs 
○ Module bundler: Webpack, Browserify 
○ ES2015/2016 syntax với babel&shy;loader 
○ Bootstrap
                    </li>
                </ol>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/thanhdancer/kee-strohk" rel="nofollow" target="_blank" title="https://github.com/thanhdancer/kee-strohk">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
