<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="392049" data-title="Knit Master // SplashScreen" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/392/049/datas/original.png">
                            <img alt="Knit Master &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/392/049/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Knit Master // SplashScreen
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="392051" data-title="Knit Master // &Uuml;bersichtsseite" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/392/051/datas/original.png">
                            <img alt="Knit Master &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/392/051/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Knit Master // &Uuml;bersichtsseite
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="392044" data-title="Knit Master // Muster-Beispiel 1" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/392/044/datas/original.png">
                            <img alt="Knit Master &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/392/044/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Knit Master // Muster-Beispiel 1
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="392050" data-title="Knit Master // Muster-Beispiel 2" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/392/050/datas/original.png">
                            <img alt="Knit Master &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/392/050/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Knit Master // Muster-Beispiel 2
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Stricken wirkt sehr altbacken, doch sehr viele aus der eher j&uuml;ngeren Generation interessieren sich auch f&uuml;r dieses Hobby, z.B. durch das Stricken von M&uuml;tzen. Jugendliche z.B. legen Wert auf Kreativit&auml;t und Individualit&auml;t, das zeigt uns die Dauerpr&auml;senz und das Selbstpr&auml;sentieren in Instagram und Facebook. 
Wir m&ouml;chten ein Tool erstellen, dass dieses Kreativit&auml;t f&ouml;rdert und ein altbackenes Hobby wieder modern macht, indem wir das Erstellen von Strickmustern digitalisieren. In naher Zukunft wird die Zielgruppe nicht mehr zum Kiosk laufen, um sich Strick-Heftchen zu kaufen oder diese googeln, sondern benutzen unsere App f&uuml;r eigene Muster. Diese k&ouml;nnen sie dann versenden und empfangen. Dies f&ouml;rdert den Austausch und Kontakt zu Gleichgesinnten.
                </p>
                <h2>
                    Was tut die App?
                </h2>
                <p>
                    Die App erleichtert das Erstellen von farbigen Muster f&uuml;r fortgeschrittene Strick- und N&auml;hbegeisterte, indem es ein Raster bietet, dass interaktiv eingef&auml;rbt werden kann. Der User kann einfach seine eigenen Muster gestalten und kleine Anleitungen erstellen. Das User Interface ist so konzipiert, dass auch &auml;ltere Menschen, die sich f&uuml;r Stricken interessieren mit der einfachen Bedienung zurechtkommen. Trotzdem ist die App modern gestaltet, so dass die App auch junge Menschen f&uuml;r das Stricken begeistern wird.
                </p>
                <h2>
                    Wie haben wir die App gebaut?
                </h2>
                <p>
                    Bei der Konzeption dieser App-Idee haben wir Wert darauf gelegt, dass die App auf allen bekannten mobilen Plattformen - wozu Windows Phone, iOS und Android z&auml;hlen - sowie Windows Desktop. Ein gro&szlig;er Teil der Logik wurde daher in einer
                    <em>
                        Portable Class Library
                    </em>
                    geschrieben, so dass alle Plattformen diese Verwenden k&ouml;nnen und haupts&auml;chlich noch ein ansprechendes Design f&uuml;r die verschiedenen Ger&auml;teklassen entwickelt werden musste.
                </p>
                <h2>
                    Herausforderungen w&auml;hrend der Entwicklung
                </h2>
                <p>
                    Zu den gr&ouml;&szlig;ten Herausforderung z&auml;hlte sicherlich die Erstellung des
                    <em>
                        Knitting Graph Papers
                    </em>
                    , denn dieses musste dynamisch nach Angaben des Users generiert werden. Als L&ouml;sung wurden hier Buttons verwendet, welche entsprechend in einem Grid mit Rows und Cloumns angeordnet waren und ihre Positionen kennen, so dass sp&auml;ter bei der Interaktion mit dem Nutzer entsprechend das Muster erstellt werden kann. Dar&uuml;ber hinaus hatten wir die Herausforderung nach der Erstellung der Portable Class Library das Design f&uuml;r die verschiedenen Plattformen zu entwickeln, so dass wir uns sp&auml;ter auf Windows konzentriert haben.
                </p>
                <h2>
                    Leistungen, auf welche wir stolz sind
                </h2>
                <p>
                    Besonders stolz sind wir auf die einfache Usability der App und die Erstellung des
                    <em>
                        Knitting Graph Papers
                    </em>
                    , welches die Hauptkomponente der App darstellt. Ebenso auf die App-Architektur, welche es erm&ouml;glicht die App ohne gr&ouml;&szlig;eren Aufwand auf allen mobilen Plattformen zu ver&ouml;ffentlichen.
                </p>
                <h2>
                    Was haben wir gelernt?
                </h2>
                <p>
                    Eine genaue Planung der Portable Library Class ist notwendig, da hier alle angebundenen Ger&auml;te mit arbeiten m&uuml;ssen. Im Anschluss kann man sich auf Entwicklung f&uuml;r die einzelnen Plattformen konzentrieren. Wichtig ist dabei aber, dass die Entwickler jederzeit sich abstimmen k&ouml;nnen, da w&auml;hrend der Entwicklung immer wieder Anpassungen an der PCL notwendig sind. Zus&auml;tzlich haben wir gelernt, dass eine Windows UWP App nicht langweilig sein muss und es gewiss Potential hat diesen Markt weiter zu f&ouml;rdern.
                </p>
                <h2>
                    Wie geht es weiter Knit Master
                </h2>
                <p>
                    Nach ersten Usability Tests innerhalb der Zielgruppe werden wir mit der Entwicklung fortfahren und sp&auml;ter die App f&uuml;r iOS, Android, Windows Phone und Windows Desktop in den jeweiligen App-Stores ver&ouml;ffentlichen. Vorher werden noch weitere Funktionalit&auml;ten, wie ein Color-Picker oder weitere Symbole f&uuml;r Strickanleitungen hinzugef&uuml;gt.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/adobe-illustrator">
                                adobe-illustrator
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ios">
                                ios
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            uwp
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/xamarin">
                                xamarin
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://tsjdev-apps.visualstudio.com/_git/KnitMaster" rel="nofollow" target="_blank" title="https://tsjdev-apps.visualstudio.com/_git/KnitMaster">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                tsjdev-apps.visualstudio.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://github.com/jensen-ml/KnitMaster" rel="nofollow" target="_blank" title="https://github.com/jensen-ml/KnitMaster">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
