<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    La vente des fruits et l&eacute;gumes au niveau du march&eacute; marocain passent par plusieurs interm&eacute;diaires qui contr&ocirc;lent le march&eacute;.
                </p>
                <p>
                    Le processus g&eacute;n&eacute;ral se passe comme suit :
En premier, les grossistes ach&egrave;tent les r&eacute;coltes des petits agriculteurs &agrave; bas prix. 
En deuxi&egrave;me lieu, ils vendent au niveau du march&eacute; &agrave; des interm&eacute;diaires qui eux se chargent de vendre aux marchands ambulants et aux d&eacute;taillants avant que le produit arrive au client final.
                </p>
                <p>
                    Solution :
                </p>
                <p>
                    Les clients vont adh&eacute;rer &agrave; un service leur permettant d'acheter directement les r&eacute;coltes de chez les agriculteurs sans passer par les interm&eacute;diaires. 
Ceci permettra de :
                </p>
                <ul>
                    <li>
                        R&eacute;duire les co&ucirc;ts de vente pour les clients.
                    </li>
                    <li>
                        Augmenter la marge de gains pour les petits agriculteurs.
                    </li>
                    <li>
                        Am&eacute;liorer la comp&eacute;titivit&eacute; au niveau du march&eacute;.
                    </li>
                </ul>
                <p>
                    Comment ?
                </p>
                <p>
                    Une plateforme de vente sera mise en place pour permettre aux clients de commander des paniers pr&eacute;visionnelles d'une p&eacute;riode de 1 mois ou plus qui seront livr&eacute;s hebdomadairement.
                </p>
                <p>
                    Les l&eacute;gumes seront achet&eacute;s directement de chez les petits agriculteurs et seront stockes dans des frigo pour maintenir les produits frais et garantir un approvisionnement au client.
                </p>
                <p>
                    Un outil d'aide &agrave; la d&eacute;cision sera mise en place pour aider les clients &agrave;  pr&eacute;voir la quantit&eacute; &agrave; commander.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            business-intelligence
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            plateforme-web
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
