<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="352672" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/352/672/datas/original.jpg">
                            <img alt="Lupi &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/352/672/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    <strong>
                        Lupi
                    </strong>
                    esta inspirado en mejorar con el uso de Tecnolog&iacute;as de Informaci&oacute;n un area de negocios poco explotada, los "Foodtrucks". Este servicio de comida es bien conocido a nivel mundial debido a que son f&aacute;ciles de reconocer en cualquier area en la que est&eacute;n atendiendo, ya sea por el gran tama&ntilde;o del cami&oacute;n o la publicidad que tienen impresa o la buena calidad de la comida, sin embargo, los (chiefs) de estos restaurantes mobiles se arriesgan diariamente debido a que tienen que confiar en su instinto para poder sobrevivir porque desconocen si el negocio perdurar&aacute; establecidos en alguna zona en especifica y es por esto que existe mucha incertidumbre de inversi&oacute;n para estos tipos de negocios.
                </p>
                <p>
                    <img alt="Logo" data-canonical-url="https://www.dropbox.com/s/wy6sip1xa8xpg7s/foodtruck.jpg?dl=1" src="https://res.cloudinary.com/devpost/image/fetch/s--li1R_uKg--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://www.dropbox.com/s/wy6sip1xa8xpg7s/foodtruck.jpg%3Fdl%3D1">
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Nosotros atacamos dos problema de incertidumbre que los Foodtrucks tienen:
                </p>
                <ul>
                    <li>
                        El usuario: mediante el uso de una aplicaci&oacute;n m&oacute;vil los usuarios podr&aacute;n saber en donde se encuentran sus Foodtrucks favoritas y/o cercanas.
                    </li>
                    <li>
                        Los Foodtrucks podr&aacute;n utilizar nuestro servicio inteligente en la nube que les permitir&aacute; con un m&iacute;nimo esfuerzo el reconocer las zonas propensas (hotspots) para poder venderle a sus comensales mas leales.
                    </li>
                </ul>
                <p>
                    Toda esta informaci&oacute;n almacenada es utilizada por nuestro servicio en la nube que aprende diariamente de los gustos y preferencias de los comensales, por lo cu&aacute;l, mientras m&aacute;s gente utilice nuestra aplicaci&oacute;n mas f&aacute;cilmente podremos descubrir estos "spots" importantes en las ciudades del mundo y ofrecerles un mejor servicio a todos los fan&aacute;ticos de la buena comida.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Para poder construir este proyecto utilizamos diferentes plataformas, lenguajes y servicios:
                </p>
                <ul>
                    <li>
                        Usamos AWS para construir el API que es consultada por nuestras aplicaciones y WEB usando PHP y el framework Codeigniter en conjunto con la librer&iacute;a Craftsman dise&ntilde;ada para el mismo.
                    </li>
                    <li>
                        Para la aplicaci&oacute;n m&oacute;vil usamos Android siguiendo la gu&iacute;a de estilos de Google:Material Design.
                    </li>
                    <li>
                        Para la aplicaci&oacute;n WEB usamos Javascript en conjunto con AngularJS para correr los procesos interactivos por parte del cliente.
                    </li>
                    <li>
                        Nuestro servicio inteligente (del cu&aacute;l estamos orgullosos) est&aacute; dise&ntilde;ado con el algoritmo de Rede Neuronal Artificial Multicapa en parte Java y Python para integrar los resultados de procesamiento de datos que consume nuestra API.
                    </li>
                </ul>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Sufrimos de constantes desaf&iacute;os durante el proceso de desarrollo del proyecto, durante el reconocimiento de patrones para poder entrenar nuestra RNA tuvimos que desarrollar simulaciones de entrenamiento en diversos escenarios, lo cu&aacute;l consumi&oacute; mucho tiempo y esfuerzo. Adem&aacute;s podemos comentar que fue un reto el poder comunicar todos nuestros desarrollos y unificarlos en una sola aplicaci&oacute;n totalmente funcional.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Comentamos que fue un reto el poder comunicar todos nuestros desarrollos y unificarlos en una sola aplicaci&oacute;n totalmente funcional de la cu&aacute;l estamos muy orgullosos, adem&aacute;s de el poder lograr en un periodo muy corto resultados s&oacute;lidos que nos servir&aacute;n para continuar trabajando y mejorando.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Aprendimos que cada persona tiene un talento especial que nos hace &uacute;nicos, y si conocemos a la gente correcta podemos lograr grandes cosas en cortos periodos de producci&oacute;n.
                </p>
                <h2>
                    What's next for
                    <strong>
                        Lupi
                    </strong>
                </h2>
                <p>
                    Vamos a seguir trabajando con
                    <strong>
                        Lupi
                    </strong>
                    , creemos que esta es la aplicaci&oacute;n marcar&aacute; la diferencia en la manera en que la gente consume sus alimentos.
                </p>
                <p>
                    <strong>
                        Mesa:82
                    </strong>
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/angular-js">
                                angular.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/codeigniter">
                                codeigniter
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://gitlab.com/Hackathon2016/" rel="nofollow" target="_blank" title="https://gitlab.com/Hackathon2016/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                gitlab.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
