<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nous avons song&eacute; &agrave; reproduire un google street cartoon en 3D. Ce projet est n&eacute; ainsi.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    L'application permet de rep&eacute;rer des magasins, des lieux culturels, des &eacute;coles, des restaurants, des hotels, et peut aussi tout simplement servir de guide pour se rendre &agrave; une adresse pr&eacute;cise.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Nous avons utilis&eacute; les donn&eacute;es de la ville de montr&eacute;al, ainsi que le moteur de jeu unity afin de nous supporter dans le design. L'int&eacute;gralit&eacute; a &eacute;t&eacute; cod&eacute; en C#, avec un fichier xml repr&eacute;sentant la ville.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Il a fallu trouv&eacute; les bonnes donn&eacute;es, ce qui a assez complexe vu qu'elle se trouvait dans plusieurs documents s&eacute;par&eacute;. 
Il a &eacute;galement &eacute;t&eacute; difficile de produire un systeme complexe qui permet de faire un triage de batiments.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    La mise en commun d'un gros paquet de donn&eacute;es et les transform&eacute; en un monde virtuel 3D
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    L'un de nous a pu r&eacute;apprendre Unity. On a &eacute;galement appris &agrave; traiter un gros flot de donn&eacute;es. 
On a &eacute;galement appris &agrave; utiliser correctement des outils propos&eacute;es par unity et &agrave; les mettre en lien ensemble afin de concevoir ce monde 3D complexe.
                </p>
                <h2>
                    What's next for Map 3D Interractive
                </h2>
                <p>
                    L'application propose &eacute;norm&eacute;ment de possibilit&eacute; d'&eacute;volution. On peut facilement y rajouter des descriptions des lieux cultures, cette information &eacute;tant pr&eacute;sente dans les donn&eacute;es que nous avons trait&eacute; mais que nous avons choisi de ne pas utiliser lors du d&eacute;veloppement de ce prototype.
L'application a un gros potentiel au niveau des touristes, mais &eacute;galement d'un point de visuel. Nous nous sommes efforc&eacute; &agrave; faire que ce soit compatible sur plateforme, &agrave; commencer par le Pc, web, Android, mais &eacute;galement en VR. Ce dernier apporte &eacute;norm&eacute;ment d'atout &agrave; l'application. En effet, il se pourrait que plus tard des gens utilise la r&eacute;alit&eacute; virtuel avec afin de d&eacute;couvrir montr&eacute;al, tel que des personnes handicap&eacute;s ou des touristes.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/c--2">
                                c#
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/unity">
                                unity
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/xml">
                                xml
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Benjamin15/Map3DInteractiveMontreal.git" rel="nofollow" target="_blank" title="https://github.com/Benjamin15/Map3DInteractiveMontreal.git">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
