<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="367034" data-title="MEDICAL MANAGER Tecmilenio" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/367/034/datas/original.jpg">
                            <img alt=" MEDICAL MANAGER Tecmilenio &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/367/034/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                MEDICAL MANAGER Tecmilenio
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    PROYECTO  MEDICAL MANAGER
                </p>
                <p>
                    1.-Proyecto y objetivos.
   a. Idea.
   Creaci&oacute;n de una p&aacute;gina web donde el usuario podr&aacute; seleccionar un &aacute;rea afectada o con malestar por medio de la representaci&oacute;n gr&aacute;fica de un cuerpo humano interactivo para posteriormente desglosar una serie de s&iacute;ntomas con base en el estado del usuario, si el sistema considera que la enfermedad o malestar no es grave, &eacute;ste sugerir&aacute; una serie de medicamentos que mejorar&aacute;n la salud del usuario. Si los s&iacute;ntomas son considerados graves, el sistema producir&aacute; un diagn&oacute;stico de los datos recopilados para finalmente generar un reporte el cual ser&aacute; interpretado por el doctor con el fin de automatizar el proceso de consulta m&eacute;dica.
                </p>
                <p>
                    b. &iquest;Por qu&eacute; surgi&oacute;?
    Porque en la actualidad las personas tienen la costumbre de auto-medicarse sin conocimientos sobre los medicamentos (beneficios, efectos secundarios, f&oacute;rmulas, etc.) es por ello que se busca ofrecer orientaci&oacute;n para el consumo de medicamentos de acuerdo a los s&iacute;ntomas presentados.
                </p>
                <p>
                    c. Misi&oacute;n.
    Promover una cultura responsable en cuanto al uso de productos m&eacute;dicos.
                </p>
                <p>
                    d. Objetivos.
    Generar consciencia del uso de medicamentos en la sociedad, facilitar el acceso a consultas estandarizadas, apoyo m&eacute;dico respecto a diagn&oacute;sticos b&aacute;sicos, as&iacute; como expedici&oacute;n de recetas online en caso de ser necesarias para tratamientos.
                </p>
                <p>
                    2.- Producto y mercado.
   a. Producto (visi&oacute;n general)
   Contar con el sistema online de orientaci&oacute;n m&eacute;dica estandarizada promoviendo una nueva manera de auto-medicaci&oacute;n.
                </p>
                <p>
                    b. Cliente.
    Personas de clase media-alta con necesidad de orientaci&oacute;n m&eacute;dica y acceso a Internet
                </p>
                <p>
                    3.- Competitividad
&bull; Competencia.
&bull; We Doctors
&bull; Donem Sang
                </p>
                <p>
                    4.- Plan de Marketing
                </p>
                <p>
                    a. FODA
                </p>
                <p>
                    b. Pol&iacute;tica del servicio (Como se va a presentar el servicio al cliente)
&bull; Nuestro servicio se va a presentar mediante una p&aacute;gina web, cualquier usuario con acceso a internet puede utilizar el sistema.
c. Pol&iacute;tica de precios (Como se piensa vender el servicio)
&bull; El sistema se planea ir entregando parcialmente, con estos avances se ir&aacute;n cubriendo los requerimientos del cliente, tras alcanzar el sistema ideal se llegar&aacute; a un precio acordado entre los desarrolladores y el cliente.
d. Publicidad (Los medios que se utilizaran para promover el servicio)
&bull; Anuncios web
&bull; Folletos
&bull; Cat&aacute;logo en redes sociales.
e. Plan de acciones de marketing (Como se piensa realizar la publicidad)
&bull; Implementaci&oacute;n de una campa&ntilde;a publicitaria a trav&eacute;s de diferentes sitios con alto tr&aacute;fico web. 
&bull; Folletos con informaci&oacute;n del sistema, localizados en hospitales.
&bull; Subir cat&aacute;logos de la manera en que opera el sistema en redes sociales.
                </p>
                <p>
                    5.- Plan de ventas
  a. Estrategia de ventas (Como se piensa vender el servicio)
  El servicio fue solicitado por una empresa privada la cual pagara por la aplicaci&oacute;n web
                </p>
                <p>
                    6.- Recursos humanos
  a. Organigrama
  Manager Log&iacute;stico (Juan Ignacio)
  Manager T&eacute;cnico (Kevin Alvarez)
  Manager Modular (Eliezer ZILLI)
  Developer principal (Luis Felipe)
  Developer asistente (Isaac Lozano)
  Documentador (Victor Osuna)
  Logic Developer (Jorge Sanchez)
                </p>
                <p>
                    7.- Aspectos legales y societarios
  a. La empresa (Definir el tipo de empresa)
  Es de giro de salubridad socialmente responsable
                </p>
                <p>
                    b. Permisos y limitaciones
    Tiempo limitado
    Instalaciones escolares
                </p>
                <p>
                    8.- Plan de inversiones y financiamiento
  a. Maquinaria y equipo
  Equipos de c&oacute;mputo
  Servidor
  Pintarrones
  Red inal&aacute;mbrica
Copy
Investigador  Medico
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://medicalmanager.luiscumplido.com" rel="nofollow" target="_blank" title="http://medicalmanager.luiscumplido.com">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                medicalmanager.luiscumplido.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
