<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    La inseguridad de la mujer en el estado de Michoac&aacute;n concretamente en la ciudad de Morelia.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Las mujeres se deben registrar con los datos correctamente ingresados para poder brindarle ayuda inmediata; &eacute;sto a trav&eacute;s de mensajes o llamadas con un bot&oacute;n que autom&aacute;ticamente llama a un n&uacute;mero elegido por la mujer y env&iacute;a alerta SMS, al igual que a trav&eacute;s de un sensor de pulsos el cual estar&aacute; midiendo los pulsos de la mujer actual, si se sobrepasa cierto l&iacute;mite se enviar&aacute; un SMS a los n&uacute;meros elegidos en el grupo de amigos de la mujer.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    La aplicaci&oacute;n est&aacute; desarrollada en Android Studio.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Inseguridad de la mujer
Violaci&oacute;n, maltrato, abuso de autoridad, machismo, hostigamiento laboral y social, bullying, y otros factores.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Orgullosos de poder ayudar a las mujeres a llevar una vida m&aacute;s segura.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Mediante el desarrollo de la presente aplicaci&oacute;n se conocieron los diferentes problemas que la mujer actual sufre d&iacute;a a d&iacute;a.
                </p>
                <h2>
                    What's next for Michoacana Segura
                </h2>
                <p>
                    Llevar la aplicaci&oacute;n a su implementaci&oacute;n real para as&iacute; poder generar m&aacute;s empleo a trav&eacute;s de ideas que se tienen planificadas en caso de &eacute;xito, adem&aacute;s de implementar nuevas tecnolog&iacute;as que ayuden a la mujer en diferentes &aacute;mbitos de su vida.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Juanixx/MichoacanaSegura" rel="nofollow" target="_blank" title="https://github.com/Juanixx/MichoacanaSegura">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
