<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/5IauNMxSnrI?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="284286" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/284/286/datas/original.jpg">
                            <img alt="MOBQI &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/284/286/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nascemos devido a necessidade de termos cidades mais inteligentes e integradas, criamos com o objetivo de tornar a mobilidade urbana mais inteligente. Investimos em um mundo mais sustent&aacute;vel, tecnol&oacute;gico e inteligente, porque s&oacute; assim conseguiremos sobreviver em um mundo que precisa ser tudo isso que disse acima se n&atilde;o, n&atilde;o mais existir&aacute;.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    &Ocirc;NIBUS
PARA O USU&Aacute;RIO: rastreamento em tempo real tempo de espera itiner&aacute;rio busca de &ocirc;nibus por endere&ccedil;o ponto mais pr&oacute;ximo, etc. PARA EMPRESAS: gerenciamento, rastreamento, escala de funcion&aacute;rios e dados financeiros
                </p>
                <p>
                    SEGURAN&Ccedil;A
Localiza&ccedil;&atilde;o de viatura mais pr&oacute;xima para o usu&aacute;rio do sistema v&iacute;tima de viol&ecirc;ncia ou de acidente Informa&ccedil;&atilde;o de tempo de chegada do socorro 
T&Aacute;XIS
PARA O TAXISTA: gerenciamento financeiro, controle de clientes, rotas, controle de manuten&ccedil;&otilde;es do(s) ve&iacute;culo(s). PARA O USU&Aacute;RIO: Saber quanto tempo e qual dist&acirc;ncia falta para seu t&aacute;xi chegar. Estimativa de custo e itiner&aacute;rio mais vi&aacute;vel.
                </p>
                <p>
                    CO2
An&aacute;lise de todo o CO2 produzido por cada tipo de transporte utilizado
                </p>
                <p>
                    ONDE ABASTECER
Nomes, pre&ccedil;os e localiza&ccedil;&otilde;es dos postos filtrados por rota ou por dist&acirc;ncia
                </p>
                <p>
                    ESTABELECIMENTOS COMERCIAIS
Precisa de alguma coisa ou alguma loja? N&oacute;s te informamos as mais pr&oacute;ximas e tra&ccedil;amos as rotas
                </p>
                <p>
                    MURAL
Tire uma foto, fa&ccedil;a um v&iacute;deo - mostre como est&aacute; sua rua ou seu transporte e compartilhe com seus amigos para avalia&ccedil;&otilde;es.
                </p>
                <p>
                    COMPARTILHAR E SALVAR ROTA
Salve uma rota, d&ecirc; uma nota e compartilhe com seus amigos.
                </p>
                <p>
                    C&Acirc;MERAS DE TR&Acirc;NSITO
Visualiza&ccedil;&atilde;o das imagens em tempo real com as condi&ccedil;&otilde;es do tr&acirc;nsito.
EVENTOS
N&atilde;o sabe o que fazer hoje? N&oacute;s sabemos o ano inteiro em todas as cidades do mundo.
                </p>
                <p>
                    PAQUERA
Viu aquele chuchuzinho no ponto? N&atilde;o sabe o seu nome? Procure as pessoas mais pr&oacute;ximas, veja fotos, e envie mensagens. Quem sabe possa chover na sua horta?
                </p>
                <p>
                    CHAT
Quer saber onde est&aacute; seu amigo e n&atilde;o sabe chegar at&eacute; ele? Seus problemas acabaram! Porque ele pode te mandar a sua localiza&ccedil;&atilde;o exata no mapa via chat, assim como mensagens, fotos e muito mais!
                </p>
                <p>
                    MOBQI USU&Aacute;RIO
O MobQI &eacute; um sistema integrado entre APP e WEB que permite a completa integra&ccedil;&atilde;o, gerenciamento e compartilhamento de dados da mobilidade urbana das cidades do mundo, ligando os usu&aacute;rios com os prestadores de servi&ccedil;o.
                </p>
                <p>
                    MOBQI &Ocirc;NIBUS
O sistema permite o rastreamento e gerenciamento dos funcion&aacute;rios e dos ve&iacute;culos. Fornece informa&ccedil;&otilde;es vitais para o gerenciamento e acompanhamento dos funcion&aacute;rios, dos dados financeiros e das manuten&ccedil;&otilde;es. Podendo ser utilizado por frotas ou por apenas um ve&iacute;culo.  Este sistema capta dados informando onde est&aacute; o &ocirc;nibus em tempo real, quais s&atilde;o os itiner&aacute;rios, o tempo da chegada do &ocirc;nibus at&eacute; voc&ecirc; e mostra onde est&atilde;o os pontos mais pr&oacute;ximos.
                </p>
                <p>
                    MOBQI T&Aacute;XI
Al&eacute;m de conseguir novos clientes, o taxista poder&aacute; gerenciar, rastrear e programar manuten&ccedil;&otilde;es, localizar postos de combust&iacute;veis mais baratos, fazer um mapeamento financeiro e gerenciar outras pessoas que compartilham de seu ve&iacute;culo. No caso de cooperativas ou empresas de t&aacute;xis poder&aacute; fazer o mesmo com toda a frota.
                </p>
                <p>
                    MOBQI SEGURAN&Ccedil;A
O sistema permite que o usu&aacute;rio envie um alerta para um administrador que &eacute; controlado por um policial (delegacia, quartel, centro de controle, etc.) que receber&aacute; a informa&ccedil;&atilde;o e indicar&aacute; qual a viatura mais pr&oacute;xima para atender a ocorr&ecirc;ncia, podendo ser o envio de viatura policial, ambul&acirc;ncia ou corpo de bombeiros.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Foram empenhados j&aacute; 3 anos na constru&ccedil;&atilde;o desta super plataforma, com uma equipe multidisciplinar. Hoje, j&aacute; acabamos todos os testes pr&aacute;ticos e melhorias e estamos finalizando novos Layouts e algumas melhorias para lan&ccedil;ar a vers&atilde;o definitiva ao mercado. S&oacute; de testes pr&aacute;ticos com mais de 25 mil usu&aacute;rios e informa&ccedil;&otilde;es de v&aacute;rias cidades e empresas, foram quase 1 ano.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Lan&ccedil;ar o Produto Final no Mercado, realizar campanha de marketing e conseguir expandir internacionalmente na mesma rapidez nacional.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Ganhos 2 importantes pr&ecirc;mios com este produto, fomos mat&eacute;rias em v&aacute;rios jornais e revistas, conseguimos entregar mais informa&ccedil;&otilde;es e processar mais dados do que qualquer outro sistema de mobilidade no mundo. E entregamos valor de ponta a ponta, desde a Prefeitura, at&eacute; as empresas e passando por todo e qualquer cidad&atilde;o, que precise ir e vir para qualquer lugar.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Que &eacute; necess&aacute;rio muito estudo, muito teste para conseguir informa&ccedil;&otilde;es confi&aacute;veis, precisas e din&acirc;micas, sobre o transporte p&uacute;blico no brasil e no mundo. E que tanto o Brasil quanto o mundo carecem do MOBQI, porque necessitam serem mais inteligentes no que tange a mobilidade urbana.
                </p>
                <h2>
                    What's next for MOBQI
                </h2>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            api
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/gps">
                                gps
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ios">
                                ios
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            map
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://www.mobqi.com" rel="nofollow" target="_blank" title="https://www.mobqi.com">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                www.mobqi.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://itunes.apple.com/us/app/mobqi/id902483102?l=pt&amp;ls=1&amp;mt=8" rel="nofollow" target="_blank" title="https://itunes.apple.com/us/app/mobqi/id902483102?l=pt&amp;ls=1&amp;mt=8">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                itunes.apple.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://play.google.com/store/apps/details?id=br.com.mobqi.onibus_usuario" rel="nofollow" target="_blank" title="https://play.google.com/store/apps/details?id=br.com.mobqi.onibus_usuario">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                play.google.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
