<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Prestame, es una plataforma web de pr&eacute;stamos P2P con el objetivo de facilitar el
acceso al financiamiento de los grupos de personas de la base de la pir&aacute;mide.
En M&eacute;xico el 75% de la poblaci&oacute;n pertenece a la base de la pir&aacute;mide, esto
representa alrededor de 90 millones de personas cuyos ingresos son de 10 d&oacute;lares
per c&aacute;pita diarios. De los cuales el 50% utiliza alg&uacute;n medio de cr&eacute;dito formal, seg&uacute;n
el Banco Internacional de Desarrollo en el 2015.
Pero, &iquest;Qu&eacute; sucede con el otro 50%?, son personas que no pueden obtener un
cr&eacute;dito porque no cumplen con los requerimientos de los bancos y son personas
que necesitan ese dinero al momento para poder seguir estudiando, para operar su
tiendita, realizar los 15 a&ntilde;os de su hija o hasta poder pagar la operaci&oacute;n de alg&uacute;n
familiar.
Es por ello que decidimos crear Prestame, una plataforma de pr&eacute;stamos P2P, en
donde nuestro diferenciador es que los que piden el prestamos deben de pertenecer
a un grupo de conocidos que tambi&eacute;n requieren de un pr&eacute;stamo.
Prestame est&aacute; basada en el consumo colaborativo que hoy en d&iacute;a es una tendencia.
Donde los usuarios podr&aacute;n registrarse y tendr&aacute;n la posibilidad de ser prestamista
de dinero a aquellos grupos que lo requieran, o ser prestatario y solicitar una
cantidad de dinero seleccionando los meses a pagar.
El uso por el servicio de Prestame conlleva una comisi&oacute;n por las transacciones del
6% (donde el m&iacute;nimo de pr&eacute;stamo es de $250 y el m&aacute;ximo es de $50,000), los
usuarios depositaran el dinero a la cuenta de Prestame y se les enviara la cantidad
respectiva por cuenta de OXXO.
Si alguno de los usuarios de un grupo no paga a tiempo, se le aumentara 1% en los
intereses, para reducir la posibilidad de que todo el grupo no vaya a pagar solo se
permite crear grupos de personas conocidas entre ellas para que se cree una
presi&oacute;n social. Por si no se llega a liquidar el pr&eacute;stamo se entablar&iacute;a una demanda
judicial para solicitar el pago del pr&eacute;stamo.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Conocer poco del mundo financiero, usar nuevas tecnologias, el desarrollo del modelo de negocio y la maquetacion de la base de datos.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Logramos presentar un mvp, aprendimos nuevas cosas, y una gran union como equipo.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Aprendimos el uso de nuevas tecnologias, como lo son: 
    phantomjs
    Nuevas cosas acerca CBV
    Trabajo colaborativo
                </p>
                <h2>
                    What's next for Mxhacks3
                </h2>
                <p>
                    Continuar con el proyecto y no dejar el codigo en el baul de las memorias.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/CallmeTorre/Mxhacks3" rel="nofollow" target="_blank" title="https://github.com/CallmeTorre/Mxhacks3">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
