<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="470560" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/470/560/datas/original.jpg">
                            <img alt="Nimbus &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/470/560/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    &Eacute;tant un groupe d'&eacute;tudiants dans une ville aussi active que Montr&eacute;al, il nous est souvent arriv&eacute; de nous retrouver dehors, tard le soir, sans plus aucun m&eacute;tros en circulation. 
Le moyen le plus &eacute;conomique, pour de modestes &eacute;tudiants est donc le r&eacute;seau de nuit de la STM (Soci&eacute;t&eacute; des Transports de Montr&eacute;al). Malheureusement les arr&ecirc;ts desservis par ce r&eacute;seau sp&eacute;cial sont tr&egrave;s irr&eacute;guliers, et il nous est souvent arriver d'attendre plus de 30min, dans le froid, en pleine nuit, &agrave; un arr&ecirc;t. 
C'est de cette souffrance qu'est n&eacute;e notre id&eacute;e de Nimbus.
                </p>
                <h2>
                    Nimbus, qu'est-ce que c'est?
                </h2>
                <p>
                    Nimbus c'est une flotte de v&eacute;hicules au concept novateur, en effet, au lieu d'avoir des trajets fixes comme il se fait actuellement, la flotte de v&eacute;hicule Nimbus se dispatchent de mani&egrave;re synchrone en prenant des trajets non fix&eacute;s pr&eacute;alablement mais qui d&eacute;pendent de la demande des utilisateurs. Les trajets sont recalcul&eacute;s en temps r&eacute;el en permanence pour offrir une trajectoire en tout temps optimale, limitant ainsi le temps d'attentes des usagers!
                </p>
                <h2>
                    Comment l'a-t-on fait?
                </h2>
                <p>
                    Pour mettre sur pieds Nimbus, nous avons mis au point une web app qui sert de vitrine pour le system de monitoring de la flotte. Nous avons programm&eacute; tout le back-end en Python &agrave; l'aide du framework Django, pour la partie front-end, Javascript/ReactJS ont su faire le boulot pour le niveau de dynamisme dont nous avions besoin.
                </p>
                <h2>
                    Nos defis
                </h2>
                <p>
                    On a d&ucirc; attaquer le fameux &laquo; travelling salesman problem &raquo; pour trouver les trajectoires les plus efficaces incluant les points d&rsquo;embarquement et de descente. 
Cet algorithme, grand classique de sa cat&eacute;gorie nous a caus&eacute; bien du fil &agrave; retordre, tant bien m&ecirc;me que nous nous sommes, apr&egrave;s plusieurs heures &agrave; essayer d'impl&eacute;menter notre prople solution, r&eacute;solu &agrave; passer par un API qui nous a permi de faire abstraction des notions de maths pouss&eacute;s conduisant &agrave; sa r&eacute;solution. Ainsi, nous avons pu nous consacrer &agrave; d'autres probl&eacute;matiques que l'API ne prenait pas en compte et dont nous avons d&ucirc; construire le business logic pour mener &agrave; bien notre projet.
                </p>
                <h2>
                    Nos accomplissements
                </h2>
                <p>
                    On est extr&ecirc;mement fiers du r&eacute;sultat final! On a finalis&eacute; une web app capable de calculer la meilleure trajectoire en fonction des besoins de tous les passagers en recevant les coordonn&eacute;es GPS du passager ainsi que de sa destination comme input.
                </p>
                <h2>
                    L'experience qu'on en a tir&eacute;
                </h2>
                <p>
                    En n'ayant que 24h &agrave; travailler sur un probl&egrave;me aussi ambitieux on a surtout appris &agrave; g&eacute;rer notre temps en fonction de nos priorit&eacute;s (et oui, on a appliqu&eacute; l'algorithme d'optimisation sur nous m&ecirc;me finalement). En effet, notre id&eacute;e de base &eacute;tait beaucoup plus vaste et comportait beaucoup plus de fonctionnalit&eacute;s, mais faute de temps, nous avons d&ucirc; &eacute;liminer celles qui ne nous aurait pas forc&eacute;ment b&eacute;n&eacute;ficier sur le court-terme.
                </p>
                <h2>
                    Et pour apr&egrave;s
                </h2>
                <p>
                    Nimbus a le potentiel d&rsquo;am&eacute;liorer la qualit&eacute; de service offert par la soci&eacute;t&eacute; de transport de Montr&eacute;al d&rsquo;une mani&egrave;re significative. Apr&egrave;s avoir introduit leur passagers &agrave; ce syst&egrave;me pour les autobus de nuits, la STM pourrait proposer ce type de service pour tous les autobus en dehors des heures de pointe, ce qui leur permettra de fournir un service de meilleure qualit&eacute; tout en &eacute;tant efficaces et &eacute;conomiques.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/amazon-web-services">
                                amazon-web-services
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            api
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/nginx">
                                nginx
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react">
                                react
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            tsp
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://www.github.com/konoufo/nimbus" rel="nofollow" target="_blank" title="http://www.github.com/konoufo/nimbus">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                www.github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
