<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="404929" data-title="Tela Inicial de Login" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/929/datas/original.jpg">
                            <img alt="Troco &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/929/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Tela Inicial de Login
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="404930" data-title="Extrato dos gastos nos cart&otilde;es cadastrados no aplicativo" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/930/datas/original.jpg">
                            <img alt="Troco &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/930/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Extrato dos gastos nos cart&otilde;es cadastrados no aplicativo
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="404931" data-title="Tela de Ajustes - Defini o objetivo e seta o minimo e a porcentagem padr&atilde;o de investimento" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/931/datas/original.jpg">
                            <img alt="Troco &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/931/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Tela de Ajustes - Defini o objetivo e seta o minimo e a porcentagem padr&atilde;o de investimento
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="404935" data-title="Objetivos do usu&aacute;rio - Quanto de cada objetivo foi alcan&ccedil;ado" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/935/datas/original.jpg">
                            <img alt="Troco &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/935/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Objetivos do usu&aacute;rio - Quanto de cada objetivo foi alcan&ccedil;ado
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Quando usava-se dinheiro em papel sempre havia o troco, dividido em notas e moedas, estas normalmente eram depositadas em um cofrinho, o que em um momento de necessidade poderia virar algo que se desejava. Porem com o advento tecnol&oacute;gico n&atilde;o h&aacute; mais o troco f&iacute;sico, pois os valores s&atilde;o cobrados de forma digital. Desta forma n&atilde;o h&aacute; um "local de reserva" onde se acumula um investimento para um objetivo, necessidade ou sonho. Assim sendo nossa ideia &eacute; providenciar um cofrinho virtual, ajudando aos usu&aacute;rio a investir e realizar seus sonhos.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Faz um intermedi&aacute;rio que "gera um investimento" para o usu&aacute;rio com base nos gastos do cart&atilde;o de credito, investindo um percentual da compra, um arredondamento do valor ou ambos. Por exemplo, uma compra de 15,40 com o valor definido de investimento de 10% ira gerar um investimento de 1,54 , caso seja definido apenas o arredondamento um valor de 0,60 ou um valor de 1,60 (1,54+0,06) caso seja o percentual mais o arredondamento.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Usando o gerador de projetos Yeoman, utilizamos uma configura&ccedil;&atilde;o de applica&ccedil;&atilde;o web com backend em Nodejs + Express e frontend em AngularJs, para gerenciar as builds da aplica&ccedil;&atilde;o foi utilizado o gerenciador de pacotes frontend Bower e a biblioteca de automatiza&ccedil;&atilde;o Gulp que minifica e versiona todos os arquivos necess&aacute;rios e injeta na pagina principal. Para o aplicativo utilizamos um servidor online e para sincronizar o projeto usamos o github para que o time se envolvese de forma paralela no desenvolvimento, sendo que 3 participantes focaram na implementa&ccedil;&atilde;o do sistema em si e outros dois participantes no design e user experience. O resultado final foi surpreendente, considerando que n&atilde;o foi reaproveitado codigo de outros projetos e que a ideia e concep&ccedil;&atilde;o do projeto foi feito completamente dentro do evento.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Como convencer um usu&aacute;rio a investir desta forma? Como mostrar para ele que h&aacute; vantagens em basear seus investimentos em seus gastos? Como a ideia estando atraleda a um cofrinho permite que os usu&aacute;rios melhor aceitem ela, pois &eacute; um meio digital semelhante a um procedimento real.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Prot&oacute;tipo do aplicativo funcional, permitindo a integra&ccedil;&atilde;o de meios de pagamento para atuar como intermedi&aacute;rio, pronto para tecnologias como pagamento por NFC. Alem da possibilidade de cadastrar os cart&otilde;es de credito tal como o NuBank para fazer a verifica&ccedil;&atilde;o dos gastos e assim a gera&ccedil;&atilde;o dos investimentos.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Lidar com cart&otilde;es de credito e transa&ccedil;&otilde;es financeiras &eacute; algo bem complicado, principalmente envolvendo a necessidade de pensar em meios de proteger o usu&aacute;rio e as transa&ccedil;&otilde;es. Alem do fato de  interfaces amig&aacute;veis e limpas serem mais complexas de serem criadas, visando sempre a experi&ecirc;ncia do usu&aacute;rio. Alem disso, ajudar ao jovem a lidar com as finan&ccedil;&atilde;s n&atilde;o &eacute; algo simples, mas com esta ajuda automatizada pode permitir que o jovem fa&ccedil;a melhores invertimentos e economias.
                </p>
                <h2>
                    What's next for nubank_hackathon
                </h2>
                <p>
                    Integrar os sistemas, proteger o usu&aacute;rio, aliar-se a um fundo de investimento, parcerias com bancos e bandeiras de cart&otilde;es, vislumbrar o potencial dos usu&aacute;rios (montante de dinheiro que poder&aacute; ser transacionado por meio do aplicativo para gerar investimentos).
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            brain
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            heart
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            server
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/edusig/nubank_hackathon" rel="nofollow" target="_blank" title="https://github.com/edusig/nubank_hackathon">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
