<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="309871" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/309/871/datas/original.png">
                            <img alt="Ora Pico! &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/309/871/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    El tema de la seguridad en la cuidad de Durango es un tema que nos afecta y nos interesa a todos. Un factor que nos afecta y ha provocado muchos accidentes se encunetra en la vialidad, por ello, nos parecio un tema de gran relevancia, principalmente por la ignorancia que tenemos acerca de la seguridad vial.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Ora pico es una aplicaci&oacute;n desarrollada para usarse en un entorno web con la finalidad de cultivar buenos h&aacute;bitos viales mediante divertidos minijuegos que explicar&aacute;n la importancia de las distintas normas existentes en el reglamento de tr&aacute;sito.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    A partir de la idea planteada, el trabajo a realizar se divide en tres etapas: planeaci&oacute;n, dise&ntilde;o y desarrollo, la cuales se les asignan a los distintos integrantes del equipo tomando a consideraci&oacute;n las habilidades con los que cada uno de ellos cuenta. Mientras los encargados de planeaci&oacute;n realizaban investigaciones acerca de las reglas de tr&aacute;nsito, buscando la implemetaci&oacute;n de las mismas dentro del juego, las personas que forman parte del equipo de dise&ntilde;o realizaba bocetos de los personajes e im&aacute;genes de fondo de las escenas, para posteriormente digitalizarlas. Por &uacute;ltimo, ya que la planeaci&oacute;n y el dise&ntilde;o tiene una estructura establecida, las personas que se encargan de programar el juego, lo hacen a trav&eacute;s de una herramienta de desarrollo llamada GameMarket.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    La cantidad de ideas para dar soluci&oacute;n a esta problem&aacute;tica era enorme al principio, ya que cada uno de los integrantes ten&iacute;a una visi&oacute;n diferente del mismo, por lo que, el proceso de delimitar la idea principal en la que se basar&iacute;a el juego, se volvi&oacute; una de las tareas m&aacute;s d&iacute;ficiles. Nos tom&oacute; varias horas encontrar los puntos que ten&iacute;amos en com&uacute;n para irlos integrando hasta lograr una idea fija. Otro problema muy grande fue el c&oacute;mo lograr&iacute;amos que un tema como la seguridad vial sea aceptado y ademas valorado, de tal manera que logre un impacto hacia lo que estamos buscando. Varias propuestas fueron y vinieron antes de decidirnos por la aplicaci&oacute;n web.
                </p>
                <p>
                    Despu&eacute;s que fijamos el objetivo, nos encontramos con diferentes maneras de desarrollarlo y tuvimos que experimentar con varias y desecharlas antes de GameMarket por diferentes motivos. Por ejempo, unas eran muy complejas o nuevas, y no pod&iacute;amos aprenderlo de un d&iacute;a a el otro pues el tiempo no lo permit&iacute;a.
                </p>
                <p>
                    Una vez que encontramos la herramienta adecuada, y con una idea concreta en mente, pudimos trabajar de manera m&aacute;s fluida hasta terminar el proyecto.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Cada uno de los integrantes  trabajo de manera muy fluida en su equipo, enfoc&aacute;ndose en realizar sus actividades en el tiempo establecido. La convivencia dentro del equipo de trabajo fue muy favorable, ya que el apoyo mutuo estuvo siempre presente. 
Tambi&eacute;n como parte en la que nos sentimos orgullosos fue en la manera de actuar, razonar, convivir e interactuar ante ciertas situaciones por parte de los mismos; a pesar de la falta de conocimiento entre nosotros.
Todos las personas que integramos en el equipo podemos sentirnos orgullosas que dimos nuestro granito de arena aportantdo ideas grandiosas.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Utilizar herramientas de dise&ntilde;o.
Trabajar con compa&ntilde;eros con los que antes no hab&iacute;as tenido mucho contacto de amistad ni mucho menos escolar o laboral.
Trabajar bajo presi&oacute;n.
Tomar en cuenta todas las ideas, por m&aacute;s peque&ntilde;as que sean. 
Aportar hasta la m&iacute;nima idea sin miedo a que esta sea rechazada por los compa&ntilde;eros de equipo.
Quiz&aacute; lo que mas podr&iacute;a destacar es que podemos atacar un problema desde muchos lados, encontrar una soluci&oacute;n utilizando cosas de la vida diaria, utilizando lo que tenemos a nuestro alrededor para conseguir nuestros objetivos.
                </p>
                <h2>
                    What's next for Ora Pico!
                </h2>
                <p>
                    Queremos que esta aplicaci&oacute;n web llegue a todo mundo, y que forme parte de su  vida, asi que la segund parte ser&iacute;a una aplicaci&oacute;n m&oacute;vil disponile para sistema operativo Android y IOS. 
Integraci&oacute;n de nuevos escenarios con un mayor nivel de dificultad e implemetaci&oacute;n de m&aacute;s reglas de tr&aacute;nsito.
Nuevos personajes, siendo amigables con el usuario.
Y, &iquest;por qu&eacute; no?, una segunda aplicacion con mejores gr&aacute;ficos y m&aacute;s elementos pero llevando la escencia de eso que buscamos, una mejor educaci&oacute;n vial.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            gml
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
