<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="557880" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/557/880/datas/original.JPG">
                            <img alt="Padleperler &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/557/880/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Teammembers
                </h2>
                <p>
                    Anita Herheim
                    <br>
                    Lars Normann Hansen
                    <br>
                    Bj&oslash;rn Ove Gr&oslash;tan
                    <br>
                    Henrik Solgaard
                    <br>
                    Tina J&oslash;rgensen
                    <br>
                    Kjersti Nordskog
                    <br>
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Som padlar st&aring;r ein ofte att p&aring; land fordi ein ikkje fann nokon &aring; padle med, eller fordi du ikkje hadde nokre gode idear for kvar du skulle padla. Du er kanskje usikker p&aring; om du kan ta med familien p&aring; padletur, d&aring; de har forskjellig erfaring og kunnskap. Eller du har lyst til &aring; padla Noregs ti finaste padleruter, men er usikker p&aring; kvar og korleis dei er. Tenk om all denne informasjonen kunne samlast i ein app!
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    I
                    <strong>
                        Padleperler
                    </strong>
                    skal du bl.a. kunne planlegga turane dine, finna andre padlarar og potensielle turkameratar, finna kvar det er lettast &aring; sj&oslash;setta kajakken, og finna fine rasteplassar, kulturminner og andre spanande destinasjonar.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Me har jobba med forskjellige datakjelder og utvikla metodikk for &aring; tilpassa dataene til v&aring;rt form&aring;l. Me har utvikla ein enkel demonstrator med eit webkart som visar padledestinasjonar fr&aring; forskjellige dataleverand&oslash;rar. Dette er eit enkelt webkart basert p&aring; Leaflet og WMS. I tillegg har me eksperimentert med drapering av WMS karttiles over h&oslash;ydedata i WCS-format.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Det eksisterer fleire potensielle informasjonskjelder (friluftsr&aring;dene, godtur.no, osv.) som brukar data me ikkje f&aring;r tak i og som ikkje er opne og enkle &aring; ta i bruk.
                    <br>
                    For eksempel burde fkb-vann og fkb-h&oslash;ydekurver, som kunne vert brukt til nettverksanalyse (PG routing), vert opne datasett, for &aring; gjere det mogleg &aring; planlegge turar med minimal kajakkbering.
                    <br>
                    Nettdugnad (brukerinnsamla data) har ein del samtykkeproblematikk for vidare bruk, data som finst og som me kunne hatt bruk for, som gjer det vanskeleg &aring; nytta enkelte datasett.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Me er stolte over &aring; ha utvikla ein id&eacute; som har vakst seg stor, og som har eit valdsamt potensial.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Me har l&aelig;rt at det kan vera kjekt og inspirerande og arbeida med folk me ikkje kjente p&aring; f&oslash;rehand. Og at ein kan f&aring; gjort mykje p&aring; kort tid.
                </p>
                <h2>
                    What's next for Padleperler
                </h2>
                <p>
                </p>
                <li>
                    Potensialet for
                    <strong>
                        Padleperler
                    </strong>
                    er veldig stort. Appen, slik som me presenterar han i dag, visar berre eit grunnleggande konsept.
                </li>
                <br>
                <li>
                    Me ser for oss moglegheita for &aring; inkludera ferskvatnspadling (elvar og insj&oslash;) og meir omfattande turplanlegging (vatnnettverk og minst mogleg kajakkbering) p&aring; sikt.
                </li>
                <br>
                <li>
                    Sesongbetont turplanlegging, der me brukar satellittdata for is i fjordar og p&aring; vatn.
                </li>
                <br>
                <li>
                    V&ecirc;r- og sj&oslash;data fr&aring; MET kan og b&oslash;r inkorporerast i appen for &aring; gjera det enklare og tryggare &aring; planlegga turar som g&aring;r over opne sj&oslash;strekk.
                </li>
                <br>
                <ul>
                    <li>
                        <i>
                            vind (0-240 timer) wms
                        </i>
                    </li>
                </ul>
                <br>
                <ul>
                    <li>
                        <i>
                            Nedb&oslash;rradar (observasjoner) wms
                        </i>
                    </li>
                </ul>
                <br>
                <ul>
                    <li>
                        <i>
                            Temperatur (0-240 timer) wms
                        </i>
                    </li>
                </ul>
                <br>
                <p>
                </p>
                <p>
                </p>
                <li>
                    Vasstandsdata fr&aring; Kartverket kan vera s&aelig;rs interessant for turplanlegging i fjordar og langs kysten.
                </li>
                <br>
                <li>
                    KajakkBNB - legga til en funksjon som gjer det mogleg for brukarar &aring; l&aring;na/leiga kajakk.
                </li>
                <br>
                <li>
                    Legga til telt- og b&aring;lplassar, toalett, fyr og kulturminner.
                </li>
                <br>
                <li>
                    <h3>
                        <strong>
                            WORLD DOMINATION!
                        </strong>
                    </h3>
                </li>
                <br>
                <p>
                </p>
                <h2>
                    Datasets we used
                </h2>
                <p>
                </p>
                <li>
                    <i>
                        sjokart raster wms fra Kartverket
                    </i>
                </li>
                <br>
                <li>
                    <i>
                        sj&oslash;temperatur wms fra MET
                    </i>
                </li>
                <br>
                <li>
                    <i>
                        Kulturminner - Askeladden WFS fra Riksantikvaren
                    </i>
                </li>
                <br>
                <li>
                    <i>
                        anlegg- og frivillighetsregister fra datanorge.no
                    </i>
                </li>
                <p>
                </p>
            </div>
        </div>
    </body>
</html>
