<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nous avons d&eacute;cider d'am&eacute;liorer les applications d&eacute;j&agrave; existantes de localisation de stationnement dans Montr&eacute;al. Trop de gens perde beaucoup de temps &agrave; se chercher du stationnement.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    C'est une application qui permet un partage d'information entre les agents de stationnement et le public. en plus de savoir le prix des stationnement ext&eacute;rieur et int&eacute;rieur, et les rues non payantes a Montr&eacute;al, on souhaite utiliser les donn&eacute;es de parcom&egrave;tre afin de localiser pr&eacute;cis&eacute;ment les stationnement disponible. De plus, l'application permet d'entrer la localisation d'une voiture en infraction qui d&eacute;range les citoyens afins d'aider le travail des agents de stationnement
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Nous voulions au d&eacute;part utiliser Android Studio afin de faire une application Android, en utilisant l'API de Google Map.
Par contre, nos connaissances &eacute;tant limit&eacute;, nous ne sommes pas arriv&eacute;s a d&eacute;velopper une application fonctionnelle. Nous avons donc utiliser Java sur Netbeans pour simuler les am&eacute;liorations que nous voulons apporter aux applications existantes.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Nos connaissances limit&eacute;s en programmation nous emp&ecirc;chant d'apprendre et de d&eacute;velopper une application en 24h. De plus, nous n'avions pas acc&egrave;s au donn&eacute;es les plus importantes, soient les donn&eacute;es des agents de stationnement.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Nous sommes quand m&ecirc;me fier d'avoir travailler un peu avec Android Studio et d'avoir d&eacute;velopper une interface graphique la plus pr&eacute;cise possible  avec les temps qui nous restait.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Qu'il faut se pr&eacute;parer un peu plus d'avance et exploiter les comp&eacute;tences de chacun pour obtenir le projets le plus finis possible.
                </p>
                <h2>
                    What's next for Parking clairvoyant
                </h2>
                <p>
                    Developpement en Android, communication avec la ville de Montr&eacute;al, am&eacute;lioration de la vie des citoyens.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/netbeans">
                                netbeans
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/JavaStea/parkingProject.git" rel="nofollow" target="_blank" title="https://github.com/JavaStea/parkingProject.git">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
