<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="433265" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/265/datas/original.jpg">
                            <img alt="P&aring;vei &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/265/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433262" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/262/datas/original.jpg">
                            <img alt="P&aring;vei &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/262/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433261" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/261/datas/original.jpg">
                            <img alt="P&aring;vei &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/261/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433263" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/263/datas/original.jpg">
                            <img alt="P&aring;vei &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/263/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="433264" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/264/datas/original.jpg">
                            <img alt="P&aring;vei &ndash; screenshot 5" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/264/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    P&aring;vei skal gj&oslash;re bilturen til en spennende utflukt. Ved hjelp av en kombinasjon av &aring;pne data, dugnad, kommersielle akt&oslash;rer og et redaksjonelt arbeid skal dette kunne bli en levende guide som forteller deg spennende og interessante anekdoter om dine omgivelser over bilstereoen mens du kj&oslash;rer. I tillegg vil P&aring;vei kunne bli et sted &aring; samle og ta vare p&aring; informasjon og gode historier som kanskje ellers vil g&aring; tapt. Appen vil enkelt kunne tilpasses dine interesser og behov, og den skal hele tiden utvikles og vokse, slik at du kan f&aring; servert nye anekdoter p&aring; neste tur. Bak appen skal det ligge en nettside der folk kan bidra med tips, ferdige tekster eller innlesning knyttet til punkter eller omr&aring;der p&aring; kartet. Kommersielle akt&oslash;rer som forlag, lokale bedrifter, museer og kommuner kan bidra med innhold s&aring; lenge det tjener til appens form&aring;l. Slike annons&oslash;rer vil ha en unik mulighet til &aring; n&aring; sin m&aring;lgruppe p&aring; stedet. Kommersielle brukere m&aring; betale for &aring; legge inn innlegg. Ellers vil bruk av appen v&aelig;re gratis. Det hele m&aring; kvalitetssikres av en redaksjon som godkjenner den ferdige posten f&oslash;r den publiseres.
                </p>
                <p>
                    Dette er et stort prosjekt, men man kan begynne i det sm&aring;. Samtidig er det viktig &aring; starte p&aring; en m&aring;te som gj&oslash;r det mulig for prosjektet &aring; vokse og utvikle seg. Derfor har vi gjort et utvalg av tekster, lydfiler og videoer (som vil konverteres til lyd) fra Digitalt fortalt, Industrimuseum og Naturbase. Til sammen rundt 2400 poster. Postene som bare er tekst vil bli lest av en syntetisk stemme, men m&aring;let er at brukerne skal bidra til &aring; tilpasse tekstene og lese dem inn, slik at behovet for bruk av syntetisk stemme etterhvert blir minimalt. I tillegg unders&oslash;ker vi flere andre datasett, og vi ser muligheter for &aring; f&aring; lagt inn mye mer innhold. Etter hvert vil brukere legge inn nytt innhold, enten som tips eller tekst som m&aring; behandles videre og leses inn av andre - eller som ferdige lydopptak som kan godkjennes og publiseres.
                </p>
                <p>
                    Det finnes flere liknende apper p&aring; markedet, med de er stort sett knyttet til sm&aring; omr&aring;der (museer og liknende). De er lukkede og har derfor sv&aelig;rt begrenset innhold og utvikler seg i liten grad. Det er i prinsippet ikke noe i veien for at P&aring;vei ogs&aring; skal kunne brukes av g&aring;ende, syklende eller med kollektivtrafikk, siden postene ikke er knyttet til bilveier, men til punkter eller omr&aring;der. Vi ser ogs&aring; for oss at vi kan ha en mulighet for &aring; opprette egne, private kart der man plukker ut poster og legger inn egen lyd som man kan dele med hvem man vil. Dette kan v&aelig;re interessant for l&aelig;rere som vil lage en natursti eller omvinsning, eller for firmaer som tilbyr omvisninger - f.eks. sightseeing med buss. For kommersielle brukere vil denne tjenesten v&aelig;re en betalingstjeneste. Selve rammeverket for P&aring;vei vil ogs&aring; enkelt kunne overf&oslash;res til andre land og andre spr&aring;k.
                </p>
                <p>
                    Vi &oslash;nsker &aring; delta i kategoriene kultur og Digital fortelling.
                </p>
                <p>
                    Norvegiana
                    <a href="http://norvegiana.no/" rel="nofollow">
                        http://norvegiana.no/
                    </a>
                    kulturnett2.delving.org/organizations/kulturnett/api/search?
                </p>
                <p>
                    Kartverket
data.kartverket.no
                </p>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://prezi.com/lhc1rslbkela/?utm_campaign=share&amp;utm_medium=copy" rel="nofollow" target="_blank" title="http://prezi.com/lhc1rslbkela/?utm_campaign=share&amp;utm_medium=copy">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                prezi.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
