<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="404925" data-title="Foto com adesivo NFC" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/925/datas/original.jpg">
                            <img alt="PayGo &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/925/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Foto com adesivo NFC
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="404926" data-title="Aplicativo" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/926/datas/original.png">
                            <img alt="PayGo &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/404/926/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Aplicativo
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Como aproximar o jovem do mundo financeiro? Uma pergunta dif&iacute;cil; afinal, o que seria precisamente mundo financeiro? &Eacute; tudo! &Eacute; do pequeno com&eacute;rcio &agrave; gest&atilde;o das finan&ccedil;as de casa; da poupan&ccedil;a de uma crian&ccedil;a ao impacto de um projeto numa grande empresa. Com este pensamento, idealizamos que uma boa forma de aproximar de jovens do mundo fintech seria maximizar a facilidade da experi&ecirc;ncia dos usu&aacute;rios como consumidores e reduzir a burocracia existente.
                </p>
                <p>
                    Nossa equipe chegou &agrave; competi&ccedil;&atilde;o da maratona com um objetivo definido - o de mudar a forma de com&eacute;rcio presencial, que apesar do crescimento exponencial do e-commerce, continua sendo feita nos moldes antigos e ainda bastante presente.
                </p>
                <p>
                    Nossa primeira ideia buscava solucionar um problema comum da compra presencial, especialmente no setor de livros e de vesti&aacute;rio, que &eacute; a falta de um  produto espec&iacute;fico na loja f&iacute;sica pr&oacute;xima do consumidor. O aplicativo mobile idealizado para este contexto seria uma cataloga&ccedil;&atilde;o de produtos das lojas que seriam parceiras da startup, e a op&ccedil;&atilde;o de compra ou reserva pelo pr&oacute;prio programa pelo usu&aacute;rio. Na busca pelo produto, poderiam ser utilizados recursos como GPS e filtros para que o usu&aacute;rio ajustasse os resultados de acordo com sua localidade, renda e especifica&ccedil;&atilde;o do produto. Assim, realizada a compra, bastaria que o consumidor passasse na loja, mostrasse um protocolo gerado pelo app ao funcion&aacute;rio, e retirasse sua nova aquisi&ccedil;&atilde;o que j&aacute; estaria separada para entrega. Assim, por exemplo, uma visita ao shopping se tornaria muito mais objetiva e r&aacute;pida do que &eacute; atualmente - a pessoa ao estar na pra&ccedil;a de alimenta&ccedil;&atilde;o poderia j&aacute; buscar por produtos espec&iacute;ficos que tenha em mente, reserv&aacute;-los, e no caso de alguns setores, provavelmente at&eacute; efetuar a compra pelo celular, e assim ap&oacute;s o lanche apenas passar nos estabelecimentos para retirada das compras. Portanto, seriam evitadas filas, burocracias de compra, e buscas mal-sucedidas por produtos.
                </p>
                <p>
                    Apesar destas vantagens, houveram alguns questionamentos, inclusive levantados por pessoas entrevistadas no shopping Eldorado, onde fizemos a valida&ccedil;&atilde;o - muitos preferem apenas reservar em qualquer tipo de contexto para analisar o produto ao vivo e realizar o pagamento na m&aacute;quina de cr&eacute;dito do estabelecimento - sendo, portanto, a ferramenta mais &uacute;til o cat&aacute;logo de busca. Logo, trouxemos ao Hackathon a necessidade de um pouco mais de brainstorming, para ou reinventar a ideia antiga, ou  ter uma nova mas com o mesmo objetivo em mente. 
Considerando a necessidade de verifica&ccedil;&atilde;o do produto ao vivo, surgiu, na tarde de s&aacute;bado, o projeto de pagamentos pelo celular no estilo Pay&amp;Go, ou seja, o usu&aacute;rio bastaria fazer leitura do produto que est&aacute; adicionando ao seu carrinho de compras pelo dispositivo universalmente usado, o smartphone, e ap&oacute;s tendo coletado todas as compras, efetuar o pagamento num clique atrav&eacute;s do aplicativo por cart&atilde;o de cr&eacute;dito. Nunca mais surgiriam a dor de cabe&ccedil;a decorrente das filas e da necessidade da burocracia do caixa. Voc&ecirc; j&aacute; pensou que n&atilde;o faz sentido nenhum colocar todas as mercadorias no carrinho e retirar para passar pelo caixa e depois recolocar quando est&aacute; no supermercado?
                </p>
                <p>
                    Uma ideia com muito potencial, e que inclusive est&aacute; sendo desenvolvida paralelamente em outros pa&iacute;ses. Mas como seria o funcionamento da tecnologia? Ap&oacute;s a avalia&ccedil;&atilde;o dos recursos dispon&iacute;veis, decidimos usar o NFC, ou Near Field Communication, que possui um valor razo&aacute;vel, e est&aacute; cada vez mais comum nos smartphones. Com o uso de uma NFC tag nas mercadorias, e do recurso dispon&iacute;vel no celular, com a simples aproxima&ccedil;&atilde;o o smartphone leria uma sequ&ecirc;ncia de bytes que foram gravados na tag contendo dados de identifica&ccedil;&atilde;o, pre&ccedil;o e status. Com o carrinho pronto no estabelecimento comercial, basta que o usu&aacute;rio confirme a compra pelo aplicativo, e assim, est&aacute; tudo pronto!
                </p>
                <p>
                    Adotamos esta ideia como o projeto final, e assim, iniciamos a implementa&ccedil;&atilde;o do aplicativo mobile e de um website para a apresenta&ccedil;&atilde;o da PayGO!, o nome escolhido para a empresa. Para o app, foi usado inicialmente a ferramenta Ionic devido &agrave; experi&ecirc;ncia dos programadores com esta, por&eacute;m, infelizmente, durante a madrugada de domingo, a biblioteca espec&iacute;fica da Ionic para a ferramenta do leitor de NFC mostrou-se defeituosa, sendo bastante recente e extensa em demasia para an&aacute;lise durante a Hackathon. Assim, abandonou-se o recurso da Ionic, e optou-se pela Android Studio. Apesar dos obst&aacute;culos, na manh&atilde; de domingo, o prot&oacute;tipo entrou em funcionamento perfeitamente, em conjunto com o site.
                </p>
                <p>
                    Na aplica&ccedil;&atilde;o atual, idealizada e desenvolvida em menos de 24h, estamos felizes com o fato de que as pessoas j&aacute; n&atilde;o precisar&atilde;o passar por filas imensas em supermercados e nem dar-se o trabalho de retirar todas as mercadorias do carrinho f&iacute;sico para depois voltar a coloc&aacute;-las no mesmo para o transporte, j&aacute; que dispomos de um carrinho virtual que facilita a vida do usu&aacute;rio, e tudo isso de uma forma muito segura. Sensores de NFC seriam feitos (assim como existem sensores em camisetas em lojas de roupas para evitar roubo) para automatizar a experi&ecirc;ncia do usu&aacute;rio e sem preju&iacute;zo ao com&eacute;rcio, j&aacute; que caso algum item n&atilde;o tenha sido pago, o usu&aacute;rio, ao passar pelo sensor, receberia um aviso e o sensor apitaria, caso o item n&atilde;o conste como pago no banco de dados do local..
                </p>
                <p>
                    A PayGO! no futuro com certeza n&atilde;o se limitar&aacute; a apenas compras em supermercados, mas qualquer outra aplica&ccedil;&atilde;o onde a tecnologia do NFC (compra ou qualquer outra a&ccedil;&atilde;o por aproxima&ccedil;&atilde;o) seja pr&aacute;tica e vi&aacute;vel, como por exemplo, card&aacute;pios de restaurantes teriam tags NFCs e o usu&aacute;rio poderia pedir sua comida apenas aproximando o celular na refei&ccedil;&atilde;o desejada, e depois pagar com apenas um clique, o que agilizaria tanto a experi&ecirc;ncia do usu&aacute;rio quanto do estabelecimento.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ajax">
                                ajax
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mysql">
                                mysql
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://www.cobwebdesign.com.br/PayGo" rel="nofollow" target="_blank" title="http://www.cobwebdesign.com.br/PayGo">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                www.cobwebdesign.com.br
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://github.com/luisfwa/hackathon_paygo" rel="nofollow" target="_blank" title="https://github.com/luisfwa/hackathon_paygo">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
