<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Falta de conhecimento sobre o mercado financeiro e o mercado de a&ccedil;&otilde;es sobretudo para os jovens brasileiros
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    O projeto &eacute; um simulador que permite ao usu&aacute;rio aprender de forma simples, direta e divertida alguns conceitos aplicados no mundo real no mercado de a&ccedil;&otilde;es. Alguns exemplos: flutua&ccedil;&atilde;o de capital, investimentos e tomadas de decis&atilde;o. Atrav&eacute;s de uma plataforma online onde o usu&aacute;rio tem contato e influ&ecirc;ncia com outros usu&aacute;rios cadastrados, h&aacute; uma competi&ccedil;&atilde;o pelo ranking de melhor empreendedor financeiro. S&atilde;o apresentados conceitos  te&oacute;ricos, tendo seus resultados baseados na escolha de todos os usu&aacute;rios do aplicativo .
                </p>
                <h2>
                    How we built it
                </h2>
                <ul>
                    <li>
                        Atrav&eacute;s de conversas iniciais onde alinhamos as expectativas de cada um dos integrantes do grupo, ap&oacute;s, realizamos o levantamento dos requisitos t&eacute;cnicos e l&oacute;gicos do projeto.
Para a constru&ccedil;&atilde;o, utilizamos basicamente:
-Java
-MySQL
-JSP
-HTML
-CSS
-Javascript
-Flot Chart.js
-GlassFish Server
                    </li>
                </ul>
                <h2>
                    Challenges we ran into
                </h2>
                <ul>
                    <li>
                        Acreditamos que o maior desafio foi ser o nosso primeiro Hackathon, mas tamb&eacute;m passamos por barreiras de tecnologia devido a especialidade de cada integrante.
                    </li>
                </ul>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <ul>
                    <li>
                        Criatividade
                    </li>
                    <li>
                        Como o projeto evoluiu da ideia inicial para o que est&aacute; sendo entregue
                    </li>
                    <li>
                        Felizes por termos um projeto no qual o mesmo chegou aqui sem uma linha de c&oacute;digo escrita e hoje est&aacute; em pleno funcionamento
                    </li>
                    <li>
                        Possibilidade de impacto social do projeto: acreditamos que os usu&aacute;rios possam realmente aprender enquanto se divertem com nosso aplicativo.
                    </li>
                    <li>
                        *
                        <em>
                            20h sem dormir! *
                        </em>
                    </li>
                </ul>
                <h2>
                    What we learned
                </h2>
                <ul>
                    <li>
                        Melhorar o trabalho em equipe
                    </li>
                    <li>
                        Cada membro compartilhou o seu conhecimento e o colocamos em pr&aacute;tica
                    </li>
                    <li>
                        Networking, conhecemos muitas pessoas dentro do hackathon que com certeza iremos manter rela&ccedil;&otilde;es
                    </li>
                </ul>
                <h2>
                    What's next for Pernada
                </h2>
                <ul>
                    <li>
                        O projeto encontra-se em fase inicial onde os principais eventos que direcionam o jogo ainda acontecem de forma puramente rand&ocirc;mica. Nosso primeiro passo ap&oacute;s o hackathon &eacute; alterar isso, fazendo com que o sistema se torne inteligente provendo funcionalidades e comportamentos altamente parecidos com os do mercado financeiro real.
                    </li>
                </ul>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/jsp">
                                jsp
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mysql">
                                mysql
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/FernandoFavoretti/HackathonNubank" rel="nofollow" target="_blank" title="https://github.com/FernandoFavoretti/HackathonNubank">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="http://172.168.28.125:8080/HackaNubank/" rel="nofollow" target="_blank" title="http://172.168.28.125:8080/HackaNubank/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                172.168.28.125
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
