<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Chegamos a encontrar um dia para discutir as nossas vis&otilde;es pol&iacute;ticas e chegamos a conclus&atilde;o que n&atilde;o vivemos efetivamente em uma Democracia, o nosso sistema de governo (Republica Representativa) n&atilde;o viabiliza a efetiva Democracia. Diante disso n&oacute;s sentimos a necessidade de desenvolver um aplicativo que viabilizasse o anseio da Democracia Direta
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Ele viabiliza a vota&ccedil;&atilde;o e coment&aacute;rios ou sugest&otilde;es de maneira virtual &agrave; projetos voltados a universidade, desde elei&ccedil;&otilde;es de gr&ecirc;mio estudantil a semanas tem&aacute;ticas.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Foi utilizado o Android Studio um software para o desenvolvimento de aplicativos no Android
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Foi a primeira vez que os integrantes da equipe desenvolveram um aplicativo Android
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Mesmo tendo muitas dificuldades no desenvolvimento do aplicativo, o prot&oacute;tipo ficou muito legal
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Aprendermos a desenvolver o b&aacute;sico no Android Studio, e que qu&acirc;o mais preparado para uma competi&ccedil;&atilde;o de desenvolvimento melhor (no sentindo de aprender mais sobre como codar)
                </p>
                <h2>
                    What's next for PinHead
                </h2>
                <p>
                    Uma melhora significativa do aplicativo e do seu sistema de seguran&ccedil;a, al&eacute;m &eacute; claro de as suas primeiras aplica&ccedil;&otilde;es.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/xml">
                                xml
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
