<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="778223" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/778/223/datas/original.png">
                            <img alt="12 - Traffeed &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/778/223/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h1>
                    12 - Plane
                </h1>
                <h2>
                    Inspiration et d&eacute;fi relev&eacute;
                </h2>
                <p>
                    Pour notre application, nous avons &eacute;t&eacute; inspir&eacute; par le d&eacute;bat d'actualit&eacute; pr&eacute;sent sur la 
place publique concernant la mobilit&eacute; &agrave; Qu&eacute;bec.
                </p>
                <p>
                    Notre id&eacute;e nous est aussi venu du fait que nous nous retrouvions quelquefois 
en tant que citoyen &agrave; attendre tard la nuit que le feu devienne vert pour nous malgr&eacute; le
fait que nous soyons seul &agrave; l'intersection.
                </p>
                <p>
                    Nous avons aussi pens&eacute; aux b&eacute;n&eacute;fices environnementaux possibles de cette solution venant
du fait que les voitures se retrouveraient moins longtemps aux intersections.
                </p>
                <h2>
                    Ce que l'app fait
                </h2>
                <p>
                    Notre application donne aux citoyens l'acc&egrave;s au traffic aux intersections sur le territoire de la r&eacute;gion de 
Qu&eacute;bec et de Montr&eacute;al ainsi que l'&eacute;tat des diff&eacute;rents feux. Celui-ci peut 
signaler la pr&eacute;sence de traffic &agrave; son intersection ainsi que sa position en temps r&eacute;el. En 
prenant en compte les donn&eacute;es fournies par le citoyen ainsi que les donn&eacute;es disponible sur 
le traffic actuel, les feux ajustent leur temps d'attente dans chacune des directions. De 
cette mani&egrave;re, on donne un poids au citoyen dans l'&eacute;quation.
                </p>
                <h2>
                    Les jeux de donn&eacute;es utilis&eacute;s.
                </h2>
                <p>
                    Nommez tous les jeux de donn&eacute;es utilis&eacute;s provenant du portail Donn&eacute;es Qu&eacute;bec.
                </p>
                <ul>
                    <li>
                        <a href="https://www.donneesquebec.ca/recherche/fr/dataset/vmtl-feux-pietons" rel="nofollow">
                            Feux pour pi&eacute;tons - Ville de Montr&eacute;al
                        </a>
                    </li>
                    <li>
                        <a href="https://www.donneesquebec.ca/recherche/fr/dataset/vmtl-feux-tous" rel="nofollow">
                            Placement de toutes les intersections - Ville de Montr&eacute;al
                        </a>
                    </li>
                    <li>
                        <a href="https://www.donneesquebec.ca/recherche/fr/dataset/vque_53" rel="nofollow">
                            Intersection de voie publique - Ville de Qu&eacute;bec
                        </a>
                    </li>
                    <li>
                        <a href="https://www.donneesquebec.ca/recherche/fr/dataset/vmtl-feux-malvoyants" rel="nofollow">
                            Feux sonores pour les malvoyants - Ville de Montr&eacute;al
                        </a>
                    </li>
                    <li>
                        <a href="https://www.donneesquebec.ca/recherche/fr/dataset/vmtl-comptage-vehicules-pietons" rel="nofollow">
                            Comptage des v&eacute;hicules et des pi&eacute;tons aux intersections munies de feux - Ville de Montr&eacute;al
                        </a>
                    </li>
                </ul>
                <h2>
                    Les technos
                </h2>
                <ul>
                    <li>
                        <code>
                            React Native
                        </code>
                        utilisant
                        <code>
                            Expo
                        </code>
                    </li>
                    <li>
                        <code>
                            Node
                        </code>
                        avec
                        <code>
                            socket.io
                        </code>
                        pour des mises &agrave; jour de l'interface en temps-r&eacute;el
                    </li>
                    <li>
                        <code>
                            MongoDB
                        </code>
                    </li>
                </ul>
                <h2>
                    Les difficult&eacute;s rencontr&eacute;es
                </h2>
                <p>
                    Nous avons rencontr&eacute; des difficult&eacute;s quant &agrave; l'utilisation d'un syst&egrave;me pour la 
reconnaissance de la voix par le citoyen lors de sa conduite. Cette difficult&eacute; &eacute;tait
principalement de nature technologique, car il n'existait pas actuellement de mani&egrave;re 
simple d'obtenir la voix et de l'interpr&eacute;ter dans le cas d'une application mobile
utilisant
                    <code>
                        React Native
                    </code>
                    . Notre mani&egrave;re de rem&eacute;dier &agrave; ce probl&egrave;me a &eacute;t&eacute; de repenser 
l'exp&eacute;rince utilisateur pour que l'application poss&egrave;de quelques grands boutons 
permettant l'interaction souhait&eacute;e.
                </p>
                <p>
                    Une autre difficult&eacute; d'ordre technologique vient du fait que nous avons une application 
dont les donn&eacute;es seront modifi&eacute;es &agrave; intervalle tr&egrave;s fr&eacute;quentes. Cela am&egrave;ne &agrave; une forte
demande en puissance de calcul du c&ocirc;t&eacute; du serveur ainsi qu'&agrave; une forte demande de la
base de donn&eacute;es.
                </p>
                <p>
                    Une autre difficult&eacute; que nous avons rencontr&eacute;e vient du manque de donn&eacute;es r&eacute;elles qui
vient du fait que seul Qu&eacute;bec et Montr&eacute;al ont des jeux de donn&eacute;es &agrave; cet effet et
du manque de tests r&eacute;els possibles de notre application, puisque seul des simulations
pourraient &ecirc;tre utilis&eacute;s pour mod&eacute;liser le temps qu'une telle solution pourrait sauver.
                </p>
                <h2>
                    Les bons coups
                </h2>
                <ul>
                    <li>
                        &Eacute;cologie
                    </li>
                    <li>
                        Scalable (universel)
                    </li>
                    <li>
                        RealTime
                    </li>
                    <li>
                        Feedback user
                    </li>
                    <li>
                        Faisabilit&eacute; &eacute;lev&eacute;e (&Eacute;conomique et la technologie est d&eacute;j&agrave; disponible)
                    </li>
                </ul>
                <h2>
                    Ce qu'on a appris
                </h2>
                <p>
                    Durant notre exploration des diff&eacute;rentes probl&eacute;matiques associ&eacute;es &agrave; l'implication 
citoyenne, nous avons d&eacute;couvert les b&eacute;n&eacute;fices environnementaux de notre application.
En effet, si les automobilistes canadiens &eacute;vitaient la marche au ralenti pendant &agrave; 
peine trois minutes par jour, les &eacute;missions de CO2 pourraient &ecirc;tre r&eacute;duites de 1,4 millions 
de tonnes par ann&eacute;e. Cela &eacute;quivaut &agrave; &eacute;conomiser 630 millions de litres de carburant ou 
encore &agrave; retirer 320 000 voitures de la circulation annuellement. De la m&ecirc;me mani&egrave;re, il 
suffit de 14 minutes de marche au ralenti pour br&ucirc;ler 0,4 litre d&rsquo;essence et &eacute;mettre 1 kg 
de CO2 dans l&rsquo;atmosph&egrave;re.
                    <a href="http://www.crecn.org/main.php?sid=m&amp;mid=24&amp;lng=2" rel="nofollow">
                        source
                    </a>
                </p>
                <p>
                    Gr&acirc;ce aux conf&eacute;rences, nous avons aussi appris que la ville de Qu&eacute;bec disposait d'un syst&egrave;me 
de gestion art&eacute;rielle et d'un syst&egrave;me permettant aux chauffeurs d'autobus d'appeler une 
lumi&egrave;re leur donnant la priorit&eacute; dans les intersections.
                </p>
                <h2>
                    La suite pour votre application
                </h2>
                <p>
                    Comme mentionn&eacute; plus haut, il serait envisageable d'ajouter un syst&egrave;me de reconnaissance de voix
pour nous permettre de faciliter l'interaction avec les citoyens. Nous avons aussi pens&eacute; &agrave; 
l'int&eacute;gration de notre application dans un syst&egrave;me d'exploitation pour voitures tels
Apple CarPlay.
                </p>
                <ul>
                    <li>
                        Machine learning
                    </li>
                    <li>
                        Ajouter autres commandes utilisateur
                    </li>
                    <li>
                        Int&eacute;gration &agrave; l'application Copilote
                    </li>
                </ul>
                <h2>
                    Built With
                </h2>
                <ul>
                    <li>
                        <code>
                            React Native
                        </code>
                        utilisant
                        <code>
                            Expo
                        </code>
                    </li>
                    <li>
                        <code>
                            Node
                        </code>
                        avec
                        <code>
                            socket.io
                        </code>
                        pour des mises &agrave; jour de l'interface en temps-r&eacute;el
                    </li>
                    <li>
                        <code>
                            MongoDB
                        </code>
                    </li>
                </ul>
                <p>
                    HackQc 2019
                </p>
                <p>
                    [
                    <img alt="" data-canonical-url="https://cdn.discordapp.com/attachments/347875180342935563/551886132472971290/unknown.png" src="https://res.cloudinary.com/devpost/image/fetch/s--sMi0t9t9--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://cdn.discordapp.com/attachments/347875180342935563/551886132472971290/unknown.png">
                    ]
                </p>
                <h2>
                    Utilisation
                </h2>
                <p>
                    VM de Calcul Qu&eacute;bec:
                </p>
                <ul>
                    <li>
                        <a href="http://plane.mdamour.info" rel="nofollow">
                            http://plane.mdamour.info
                        </a>
                    </li>
                    <li>
                        Port d'&eacute;coute: 8888
                    </li>
                </ul>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mongodb">
                                mongodb
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react-native">
                                react-native
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/socket-io">
                                socket.io
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Damyyr/Plane" rel="nofollow" target="_blank" title="https://github.com/Damyyr/Plane">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
