<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <ol>
                    <li>
                        <p>
                            Per al cap&iacute;tol 1, la primera acci&oacute; que vam realitzar va ser obrir la fotografia amb l'editor de text, ja que ens va recordar a el misteri de Cicada 3301. Al veure un 'string' que cabava en .cuc, vam relacionar r&agrave;pidament el t&iacute;tol de la web (Salve) amb el xifrat C&egrave;sar.
                        </p>
                    </li>
                    <li>
                        <p>
                            En escoltar l'audio de la segona prova, tamb&eacute; ens vam percatar r&agrave;pidament que es tractava d'un espectrograma. Analitzar el QR amb el programa Spek, va ser bastant f&agrave;cil. Tot i aix&ograve;, no vam ser capa&ccedil;os d'escanejar el codi despr&eacute;s de m&eacute;s d'una hora de transformar l'imatge. Finalment vam optar per pintar el QR p&iacute;xel a p&iacute;xel i vam ser capa&ccedil;os de passar al cap&iacute;tol 3.
                        </p>
                    </li>
                    <li>
                        <p>
                            La prova n&uacute;mero 3 va ser bastant m&eacute;s dif&iacute;cil. Primer de tot vam decobrir que l'home de la fotografia era el creador del xifrat Vigen&egrave;re. Despr&eacute;s ens vam estancar una estona mirant el mapa, que vam relacionar err&ograve;niament amb la regi&oacute; de Cal&agrave;bria, a It&agrave;lia. A m&eacute;s hi havia la coincideincia que es podia replenar el String amb les lletres d'aquesta regi&oacute;. A continuaci&oacute; vam esborrar l'estil css 'blur' de la imatge del cos, i vam buscar el codi de la etiqueta a internet i ens va portar al llibre Qui ha mort la pubilla de la festa major? Vam ser els primers en agafar el llibre que estava al vest&iacute;bul i vam arribar a la conclusi&oacute; que la clau era 'mercebalsells'. Despr&eacute;s de la pista de la p&agrave;gina 92, i la col&middot;laboraci&oacute; mutua de un grup i el nostre vam aconseguir passar al pas 4.
                        </p>
                    </li>
                    <li>
                        <p>
                            La prova n&uacute;mero 4 semblava bastant complicada a primera vista, per&ograve; un cop ens vam fixar millor en l'enunciat del repte, va ser m&eacute;s f&agrave;cil resoldre'l a m&agrave;, ordenant els n&uacute;meros.
                        </p>
                    </li>
                    <li>
                        <p>
                            Per arribar a la soluci&oacute; hem muntat un servidor MySQL i hem carregat les dades. Despr&eacute;s de 9 hores d'analitzar les dades de diferents maneres (truncant decimals i investigant sobre els diferents descomptes). Tamb&eacute; hem comparat els preus entre els productes en en dataset de productes i en el de &iacute;tems de factures. Hem trobat 24 persones ocupades per O.K. Fairbanks.
                        </p>
                    </li>
                </ol>
                <p>
                    Finalment hem optat per realitzar una proporci&oacute; amb els diners aconseguits en el dataset de prova i hem obtingut un valor molt semblant a el de la transacci&oacute; 22.
                </p>
                <p>
                    Soluci&oacute;: Gonzalo Gayt&aacute;n contracta a Alfredo Benvinguda.
Per tant Alfredo Benvinguda &eacute;s el sicari i assass&iacute;.
                </p>
                <p>
                    Com a codi tenim aquest script 'parseja' els fitxers proporcionats, per poder-los insertar a una base de dades relacional.
                </p>
                <p>
                    Pepperoni
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            pizza
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/alexflorensa/hackeps" rel="nofollow" target="_blank" title="https://github.com/alexflorensa/hackeps">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
