<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h1>
                    &Eacute;quipe 31 - W&sup3;
                </h1>
                <p>
                    Sous le th&egrave;me de la gestion des mati&egrave;res r&eacute;siduelles
                </p>
                <p>
                    Un sondage que nous avons r&eacute;alis&eacute; aupr&egrave;s d'un &eacute;chantillon d'environ cinquantaine d'individus nous a permit de confirmer l'hypoth&egrave;se suivante: les gens qui recyclent le font-ils correctement? Trop souvent la r&eacute;ponse a cette question est non. Plusieurs items demeurent dans une zone grise pour un grand nombre de personnes: est-ce recyclable, compostable, que dois-je faire de mes batteries usag&eacute;es?, etc. Ainsi, suite &agrave; nos recherches, nous avons d&eacute;couvert que Recyc-Qu&eacute;bec avait tout r&eacute;cemment lanc&eacute; une application qui aiderait les citoyens &agrave; identifier la fa&ccedil;on, le lieu et l'endroit pour disposer de divers objets. Toutefois, cette application semble comporter une faiblesse majeure: elle n'est pas assez conviviale au gout des utilisateurs. C'est donc ici que nous entrons en jeu! Nous savons que le concept de l'application de Recyc Qu&eacute;bec constitue un outil des plus utiles. Les citoyens sont mal inform&eacute;s et cette derni&egrave;re permet de palier &agrave; cette r&eacute;alit&eacute;. Nous voulions donc cr&eacute;er une application o&ugrave; il est possible de trouver TOUTES ces informations (dans quel bac en disposer, &agrave; quel endroit est-ce possible de le faire, &agrave; quel moment les collectes ont-elles lieu et plus encore) et ce, dans une application CONVIVIALE. Ainsi, nous avons mis&eacute; sur la reconnaissance d'image puisque cette derni&egrave;re aurait pour effet d'&eacute;liminer la frustration v&eacute;cue par l'utilisateur type qui se perd dans la foule d'information regroup&eacute;e sur l'app de recyc qu&eacute;bec.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/love">
                                love
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/tihbe/hackqc" rel="nofollow" target="_blank" title="https://github.com/tihbe/hackqc">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
