<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Qui n'a jamais perdu de r&eacute;seau ? ou qui n'a pas pu capter une antenne r&eacute;seau dans la campagne ? QR Maps a &eacute;t&eacute; inspir&eacute; pour r&eacute;soudre ce probl&egrave;me, proposer une solution qui ne n&eacute;cessite pas de connexion internet.
                </p>
                <p>
                    Who never lost his signal ? or who couldn't receive a signal when in the countryside? QR Maps has been inspired to solve this problem, offer a solution who will no need any internet connection.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Avec QR Maps, on peut scanner un code QR qui contiendra les coordonn&eacute;es en longitude et latitude du code QR. Ensuite, elle permettra d'ajouter un pin sur la carte afin de positionner l'utilisateur.
                </p>
                <p>
                    With QR Maps, we can scan a QR code who will contain coordinates in longitude and latitude of the QR code. Then, it will be possible to add a pin to the map to pinpoint the localization of the user.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Nous avons commenc&eacute; par chercher les API qui nous ont permis de concevoir cette application. Ensuite, nous avons essay&eacute; d'int&eacute;grer cela dans UNE et M&Ecirc;ME application android.
                </p>
                <p>
                    We started to search some API that allowed us to create the app, Then, we've tried to integrate those into ONE and SAME app.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Nous sommes partis sur un projet dont nous n'avions aucune connaissance en JAVA, en Android Studiuo.
                </p>
                <p>
                    We started a project where we didn't have competence with JAVA and Android Studio.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Nous sommes fiers d'avoir pu cr&eacute;er une application Android qui poss&egrave;de quelques fonctionnalit&eacute;s malgr&eacute; le fait que nous n'ayons pas pu tout faire.
                </p>
                <p>
                    We are proud of being able to create an Android app that has some functionalities despite the fact that we couldn't implement them all.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Nous avons appris &agrave; utiliser Google pour chercher les solutions &agrave; nos probl&egrave;mes.
                </p>
                <p>
                    We've learned to use Google to search solutions to our problem.
                </p>
                <h2>
                    What's next for QR Maps
                </h2>
                <p>
                    QR Maps peut &ecirc;tre am&eacute;lior&eacute; en ajoutant le trajet entre 2 points, pouvoir garder en favoris les lieux coup de coeur.
                </p>
                <p>
                    QR Maps can be improved by adding the trajectory between 2 points, being able to keep featured locations.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            brain
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/google-maps">
                                google-maps
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            google-vision
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            hardwork
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            redbull
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            tears
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/jeandecian/QR-Maps" rel="nofollow" target="_blank" title="https://github.com/jeandecian/QR-Maps">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
