<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Debido a que venimos de la carrera de Ingenier&iacute;a en Computaci&oacute;n, desde un principio ya ven&iacute;amos con la idea de realizar algo que se relacione con nuestra carrera que principalmente es una combinaci&oacute;n entre hardware y software. Antes de tener la idea de este proyecto en mente, nuestro objetivo siempre fue enfocado hacia la educaci&oacute;n, utilizando las herramientas y conocimientos a nuestra disposici&oacute;n quer&iacute;amos realizar un proyecto dirigido a estudiantes.
                </p>
                <p>
                    Gracias a la tecnolog&iacute;a de hoy en d&iacute;a, podemos realizar pr&aacute;cticas y aprender cosas de una manera bastante intuitiva, interactiva y divertida, lo cual es una buena oportunidad para las generaciones actuales. 
Con todo esto en mente, de entre tanta lluvia de ideas, nos decidimos por un proyecto tratando sobre qu&iacute;mica, pues es un buen ejemplo de una asignatura bastante pr&aacute;ctica al igual que te&oacute;rica, en la cual podemos simular bastantes cosas.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Crea un laboratorio de qu&iacute;mica virtual, en el cual un estudiante puede realizar pr&aacute;cticas de qu&iacute;mica simuladas con el fin de aumentar sus conocimientos en el &aacute;rea y erradicar riesgos potenciales que se ven a menudo en esta &aacute;rea. Este a su vez est&aacute; conectado con un servidor web donde est&aacute; alojada una base de datos en la que se almacenan los registros de las pr&aacute;cticas realizadas por estudiantes. Tanto alumnos como profesores pueden acceder a estos registros.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Usando el Game Engine de Unity 3D e Interfazando Oculus Rift con Myo para lograr un nivel considerablemente alto de inmersi&oacute;n. Para la parte de plataforma web se opt&oacute; por usar la plataforma Moodle (LMS). Ya que el proyecto esta orientado firmemente a la educaci&oacute;n, esta plataforma nos ayuda a tener un control sobre cursos,clases y practicas en las cuales estan involucrados tanto alumnos como maestros.
.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Durante el evento surgieron bastantes complicaciones en cuanto al hardware que utilizamos, incompatibilidad de drivers, tuvimos que cambiar de dispositivo por las mismas razones. Tambi&eacute;n fue requisito tener una tarjeta grafica en buenas condidiciones para poder correr la simnulacion. En ocasiones el internet se saturaba y eso tambien generaba tiempo muerto. Tras todo esto superamos las dificultades y logramos nuestro objetivo.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Poder competir contra colegas en el &aacute;rea y poder demostrar nuestras habilidades y poner en alto el nombre de la instituci&oacute;n educativa a la que pertenecemos.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Tecnologias nuevas, trabajo en equipo y a divertirnos compitiendo sanamente.
                </p>
                <h2>
                    What's next for Qu&iacute;mica en tus manos
                </h2>
                <p>
                    Incrementar el numero de pr&aacute;cticas, distintos niveles de dificultad, ampliaci&oacute;n de base de datos. La lista sigue, esto definitivamente tiene potencial.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/myo">
                                myo
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/oculus">
                                oculus
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/unity">
                                unity
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/humberto-trujillo/QuimicaEnTusManos" rel="nofollow" target="_blank" title="https://github.com/humberto-trujillo/QuimicaEnTusManos">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
