<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="527929" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/527/929/datas/original.png">
                            <img alt="rankP &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/527/929/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="527930" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/527/930/datas/original.png">
                            <img alt="rankP &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/527/930/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h1>
                    rankP
                </h1>
                <p>
                    rankP
                </p>
                <h2>
                    Resumo
                </h2>
                <p>
                    O presente projeto de site/comunidade de leitores tem por objetivo avaliar o impacto de artigos cientificos por meio  de  din&acirc;micas  de redes sociais inspiradas no reddit e no Hack news. Os artigos seram listados de acordo com o impacto que ser&aacute; medido de  acordo com os upvotes e down votes dos artigos, que seram propostos para discuss&atilde;o pelos usu&aacute;rios, as discuss&otilde;es da comunidade do site, que seram validadas por meio desses upvotes e downvotes. O fatores de impactos ser&atilde;o quantificados e separados em julgamentos positivos, julgamentos negativos, coment&aacute;rios sobre erros, upvotes e downvotes e compartilhamentos da discuss&atilde;o. A partir dessa metodologia ser&aacute; poss&iacute;vel dar enfase as pesquisas de impacto relativo a comunidade que os l&ecirc;, de maneira a ser uma forma altenartiva de verificar a qualidade dos artigos, distribuir recursos e aproveitar o potencial da competitividade da pesquisa na faculdade.  Al&eacute;m disso o site &eacute; aberto e gratuito para qualquer pessoa interessada nas pesquisas discutidas, inclusive investidores. O  Banco de dados tamb&eacute;m tem potencia para medir os impactos de institui&ccedil;&otilde;es, autores  e etc. AQUI N&Atilde;O SERAM COMPARTILHADOS OS ARTIGOS PROPIAMENTE DITOS.
                </p>
                <h2>
                    Projeto
                </h2>
                <p>
                    Feito um artigo cient&iacute;fico, como medir seu impacto? Que m&eacute;todo de medida de impacto alternativo poderia destacar artigos de valor acad&ecirc;mico leg&igrave;timo? Como expor pesquisas de qualidade que n&atilde;o s&atilde;o destacadas  apenas por meio do numero de cita&ccedil;&otilde;es referentes a pela revista onde foi publicada?
O nosso projeto tem por objetivo medir o impacto de artigos cientificos de maneira alternativa para que artigos que n&atilde;o s&atilde;o destacados com os metodos vigentes possam ser expostos. Dessa  maneira seria poss&iacute;vel aplicar investimentos em projetos de qualidade, o que aumentaria a competitividade da pesquisa da faculdade.
O projeto  consiste num site, inspirado no reddit e no hack news, que &eacute; uma  comunidade de leitores de  artigos interessados em discutir sobre os conteudos que est&atilde;o sendo publicados nas revistas. O  usu&aacute;rio, com uma conta nesse site de usu&aacute;rio especializado ou n&atilde;o, vai poder postar uma discuss&atilde;o a  respeito de  um determinado artigo, escrevendo nela informa&ccedil;&otilde;es b&aacute;sicas tais como o  t&iacute;tulo, os autores, o resumo devidamente referenciado e tags que permintam a busca desse artigo. Iniciada a discuss&atilde;o, que &eacute; separada em duas, um para o usu&aacute;rio especializado e  outra  para o n&atilde;o especializado, seram escritos coment&aacute;rios, a favor do artigo ou contra ele, e para eles seram associados upvotes e dowmvotes  da mesma forma que tammb&eacute;m s&atilde;o associados aos  artigos. Al&eacute;m desses coment&aacute;rios tamb&eacute;m ter&aacute; uma aba para escrever sobre erros encontrados nos artigos, que tamb&eacute;m teram upvotes e downvotes. Nessa janela tamb&eacute;m ter&aacute; a op&ccedil;&atilde;o de compartilhar essa p&aacute;gina nas redes sociais
Da  mesma  maneira que no reddit e no hack news esses artigos ser&atilde;o listados por impacto e por tempo de presen&ccedil;a no site (a op&ccedil;&atilde;o de tempo de impacto ser&aacute; opcional para que os artigos sejam apresentados apenas em ordem de impacto). Esse impacto &eacute; um processamento dos downvotes e unvotes dos coment&aacute;rios e ser&aacute; dividido  em cinco quantificadores de impacto, julgamento positivo da comunidade, julamento negativo da comunidade, downvotes e upvotes do artigo, pontua&ccedil;&atilde;o por comen&aacute;rios de erros e tamb&eacute;m o numero de compartilhamentos do artigo.
A listagem pode ser filtrada por meio de filtros de pesquisa para fazer um ranking dos artigos com maior impacto. 
Consequentemente, a partir dessa listagem por ordem de impacto &eacute; p&oacute;ssivel destacar pesquisas que foram avaliadas pela  comunidade, o que possibilita que org&atilde;o e pessoas interessadas em pesquisa de alto impacto relativo aos leitores de artigos possam encontrar. A partir disso tambem &eacute; poss&iacute;vel ter outra base de dados para direcionar os recursos para pesquisa. Aĺ&eacute;m disso, aṕartir dessa base de dados, &eacute; poss&iacute;vel tentar medir o impacto de institui&ccedil;&otilde;es  e autores.
Essa plataforma n&atilde;o foi feita para ser exclusivamente acadamica, a pesquisa pode ser divulgada e vista  por  qualquer pessoa capaz de lidar com as dificuldades de ler um artigo ou que talvez j&aacute; estaja acostumada.  Contudo, claramente, &eacute; necess&aacute;ria uma pol&iacute;tica para nortear e manter o controle das discuss&otilde;es para manter a verassidade dos dados.
                </p>
                <h2>
                    Whats included
                </h2>
                <ul>
                    <li>
                        /static
                    </li>
                    <li>
                        /templates
                    </li>
                    <li>
                        databasesetup.py
                    </li>
                    <li>
                        project.py
                    </li>
                    <li>
                        Vagrantfile
                    </li>
                    <li>
                        pg_config.sh
                    </li>
                </ul>
                <h3>
                    /static
                </h3>
                <p>
                    Repository where the static file such as css, javascript and images are.
                </p>
                <h3>
                    /templates
                </h3>
                <p>
                    Repository to keep all the html files
                </p>
                <h3>
                    databasesetup.py
                </h3>
                <p>
                    Python file that setup the catalog database
                </p>
                <h3>
                    project.py
                </h3>
                <p>
                    Main file that contains all the backend code for the app
                </p>
                <h3>
                    Vagrantfile and pg_config.sh
                </h3>
                <p>
                    Files to config the Virtual Machine and setup the environment
                </p>
                <h2>
                    How to setup the environment
                </h2>
                <p>
                    First you have to install VirtualBox and Vagrant.
When both are installed, clone this repository, navigate to the folder and run "vagrant up" on your terminal.
With the vagrant configurated run "vagrant ssh".
then navigate to /vagrant
                </p>
                <h2>
                    How to run the App
                </h2>
                <p>
                    In the /vagrant folder run the project.py file.
Go to your browser and access
                    <a href="http://localhost:3000" rel="nofollow">
                        http://localhost:3000
                    </a>
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/shell">
                                shell
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/OtavioHo/rankP" rel="nofollow" target="_blank" title="https://github.com/OtavioHo/rankP">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
