<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="470308" data-title="Web client - Alert" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/470/308/datas/original.png">
                            <img alt="SafeWatch &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/470/308/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Web client - Alert
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="469991" data-title="Web client - No alert" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/469/991/datas/original.png">
                            <img alt="SafeWatch &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/469/991/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Web client - No alert
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="469990" data-title="Mobile view" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/469/990/datas/original.png">
                            <img alt="SafeWatch &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/469/990/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Mobile view
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    English below,
                </p>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Avec le drame survenu &agrave; Qu&eacute;bec r&eacute;cemment, nous &eacute;tions motiv&eacute;s &agrave; augmenter la vitesse &agrave; laquelle la population peut r&eacute;pondre &agrave; une telle situation.
                </p>
                <h2>
                    Ce que l'application fait
                </h2>
                <p>
                    Notre API re&ccedil;oit des snapshots de flux vid&eacute;os et renvoi un niveau de menace, correspondant &agrave; la possible pr&eacute;sence d'armes dans l'image. Si une menace est d&eacute;tect&eacute;e, l'interface web est tout de suite notifi&eacute;e, ainsi que toute personne pouvant &ecirc;tre pertinente d'aviser via messagerie texte. (Par exemple, l'application pourrait envoyer ces informations au poste de police le plus proche de l'&eacute;v&eacute;nement en question)
                </p>
                <h2>
                    Comment l'avons-nous construit?
                </h2>
                <p>
                    Le back-end roule sous Node.js et Express, et utilise Watson de IBM pour analyser le niveau de menace &agrave; l'aide du deep learning.
                </p>
                <h2>
                    Obstacles/d&eacute;fis rencontr&eacute;s
                </h2>
                <p>
                    L'entrainement de Watson fut le plus gros d&eacute;fi de ce projet.
Premi&egrave;rement, nous n'avions pas beaucoup de cr&eacute;dits Bluemix, ce qui nous for&ccedil;ait &agrave; rationner les requ&ecirc;tes que nous faisions (y compris pour l'entra&icirc;nement).
Deuxi&egrave;mement, il n'y a pas beaucoup de ressources graphiques impliquant un individu qui d&eacute;gaine son arme en public qui sont disponibles sur le web (ce qui est une tr&egrave;s bonne chose en soit).
                </p>
                <h2>
                    Ce dont nous sommes fiers
                </h2>
                <p>
                    Nous avons un produit final &agrave; pr&eacute;senter. Certes, il n'est pas parfait, mais nous sommes capables d'&eacute;mettre des alertes pour certains flux vid&eacute;os, qui repr&eacute;sentent de r&eacute;els cas de crise imminente.
                </p>
                <h2>
                    Ce que nous avons appris
                </h2>
                <p>
                    Que le deep learning peut &ecirc;tre tr&egrave;s ardu, et qu'il faut avoir une foule de donn&eacute;es pour d&eacute;finir des mod&egrave;les personnalis&eacute;s qui fonctionnent.
Aussi, 3 hackathons de suite, c'est de la folie!
                </p>
                <h2>
                    Quelles sont les prochaines &eacute;tapes pour SafeWatch
                </h2>
                <p>
                    La prochaine &eacute;tape serait de fournir un plus grand nombre de donn&eacute;es &agrave; notre application deep learning, pour qu'elle puisse fournir de meilleures analyses.
Aussi, nous aimerions connecter notre API avec des flux de cam&eacute;ras de surveillance en direct.
                </p>
                <h1>
                    English
                </h1>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Given the recent events in Quebec city, we were inspired to change how quickly we are able to respond to threat.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Our api receives snapshots from video feeds and sends back a threat level, corresponding to the likeliness of seeing a weapon in the picture. We then send notifications to the web client, and to whomever might be concerned by the event via text message. (This would be a good way to quickly contact the nearest police department, for instance)
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    The back-end is written in Node.js and Express, and uses IBM's Watson to analyse the threat with deep learning.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Training watson was the most challenging part. 
First of all, we did not have a lot of Bluemix credits, so we had to really limit the amount of queries we made (including training of course).
Secondly, there is not a lot of footage to get online where people are about to commit such acts (which is probably good, IMO).
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    We have a final product and something to show. And even though it is not perfect, we are able to get some kind of response.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    That deeplearning can be really challenging, and that you need to gather a lot of data to make custom models work.
Also, 3 hackathon week-ends in a row is mad.
                </p>
                <h2>
                    What's next for SafeWatch
                </h2>
                <p>
                    The next step would be to populate our deep learning application with more accurate data, so it can give better analysis.
Also, we would like to connect our API to live feeds of security footage.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/angular-js">
                                angular.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/express-js">
                                express.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ibm-watson">
                                ibm-watson
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/xWiiLLz/SafeWatch" rel="nofollow" target="_blank" title="https://github.com/xWiiLLz/SafeWatch">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
