<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="725321" data-title="Logo" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/321/datas/original.png">
                            <img alt="Sch&uuml;ler-Lutze (App &amp; Wearable) &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/321/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Logo
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="725337" data-title="Zonen und Routen" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/337/datas/original.PNG">
                            <img alt="Sch&uuml;ler-Lutze (App &amp; Wearable) &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/337/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Zonen und Routen
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="725338" data-title="Filterfunktion" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/338/datas/original.PNG">
                            <img alt="Sch&uuml;ler-Lutze (App &amp; Wearable) &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/338/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Filterfunktion
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="725339" data-title="Gefahrenbereiche" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/339/datas/original.PNG">
                            <img alt="Sch&uuml;ler-Lutze (App &amp; Wearable) &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/339/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Gefahrenbereiche
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Die mobile App _ Sch&uuml;ler-Lutze _ soll vornehmlich dazu dienen, Eltern tagesaktuell einen sicheren Schulweg f&uuml;r ihre Kinder ausw&auml;hlen zu k&ouml;nnen. Das dazugeh&ouml;rige Wearable, kann die Kinder auf ihren Wegen begleiten und ihnen unterwegs Sicherheits-, Spa&szlig;- und Lernelemente bieten.
                </p>
                <h2>
                    App
                </h2>
                <p>
                    Die Android Mobile App soll Eltern morgendlich &uuml;ber den aktuellen Stand der verschiedenen Schulwege ihrer Kinder (bzw. &uuml;ber die selbst definierten _ Zonen _) informieren, um den besten ausw&auml;hlen und diesen ihren Kindern mitteilen zu k&ouml;nnen. Au&szlig;erdem soll im Nachhinein gemeinsam ausgewertet werden k&ouml;nnen, ob es Besonderheiten auf dem Weg gegeben hat und wie mit positiv und negativ markierten Orten umgegangen werden soll. Die App besteht aus 5 Bereichen, die in der unteren Men&uuml;leiste zu finden sind:
                    <strong>
                        - Zonen und Routen:
                    </strong>
                    Definition f&uuml;r den Schulweg relevanter Orte und sich daraus ergebende Zonen, dessen Grenzen das Kind nicht verlassen soll; M&ouml;glichkeit Gefahrenzonen zu melden; tagesaktuelle News und m&ouml;gliche Umleitungen zu den gespeicherten Routen; Filterfunktion; Kartenansicht mit Routen, Zonen, relevanten Orten, durch das Wearable positiv und negativ markierten Orten; Listenansicht der Orte und Zonen; Routenansicht der gespeicherten Wege
                    <strong>
                        - Notfall:
                    </strong>
                    Voreinstellungen zur Alarmfunktion des Wearables in Notsituationen
                    <strong>
                        - Gemeinschaft:
                    </strong>
                    m&ouml;gliches Zusammenfinden von sozialen Gemeinschaften f&uuml;r den gemeinsamen Schulweg (zu Fu&szlig;, Fahrrad, Auto, &Ouml;PNV, Sharing Services)
                    <strong>
                        - Abenteuer:
                    </strong>
                    M&ouml;glichkeit, Kindern spa&szlig;ige und lehrreiche Aufgaben f&uuml;r den Schulweg mitzugeben
                    <strong>
                        - Einstellungen:
                    </strong>
                    grundlegende Einstellung zur Nutzung der App in Kombination mit dem Wearable; Interaction patterns; Personalisierung; Verwaltung der Child Accounts
                </p>
                <h2>
                    Wearable
                </h2>
                <p>
                    Das um den Hals tragbare Wearable in Form eines Hundes begleitet Kinder auf ihren Schulwegen und kann genutzt werden, um die eigene Position punktuell freiwillig an die App zu versenden. Mit der Position kann ein positives oder negatives Feedback geschickt werden, was auf der Kartenansicht der App (der Erwachsenen) angezeigt wird. Bzw. kann ein Notfallalarm mit Sendung der aktuellen GPS-Daten an abgespeichert Kontakte ausgel&ouml;st werden.
Die zwei integrierten Funktionen des Wearables umfassen:
                    <strong>
                        - Quetschen:
                    </strong>
                    negatives Feedback, um Orte zu markieren, die einem missfallen (&ldquo;Dislike&rdquo;), die man Personen oder Institutionen melden m&ouml;chte (Verschmutzungen, Angstorte, Gefahrenzonen, usw. (&Uuml;ber die Bluetoothverbindung wird ein (a) an die App gesendet; rote LED leuchtet als Best&auml;tigung am Wearable)
                    <strong>
                        - Streicheln:
                    </strong>
                    positives Feedback, um Orte zu markieren, die einen auf dem Schulweg ansprechen (&ldquo;Like&rdquo;), die man mit anderen teilen m&ouml;chte oder wo ein Abenteueraufgabe erlebt wurde (&Uuml;ber die Bluetoothverbindung wird ein (b) an die App gesendet; gr&uuml;ne LED leuchtet als Best&auml;tigung am Wearable)
                </p>
                <h2>
                    M&ouml;gliche Erweiterungen des Wearables
                </h2>
                <p>
                    <strong>
                        - Interaktion:
                    </strong>
                    &Uuml;ber den Demonstrator hinaus ist vorstellbar, die Interaktionen noch zu erweitern. Es k&ouml;nnten auch negative Orte (wie Verschmutzungen, schlechte Lichtverh&auml;ltnisse, usw.) auf der Karte durch eine Interaktion mit dem Wearable lokalisiert werden. Die Notfallinteraktion k&ouml;nnte erst durch ein intensives und langes Dr&uuml;cken ausgel&ouml;st werden, um Fehlalarme zu verhindern. Man k&ouml;nnte mit durch Dr&uuml;cken auf dem Wearable ausgel&ouml;sten Morsecodes arbeiten, die unterschiedliche Nachrichten an die Mobile App &uuml;bermitteln.
                    <strong>
                        - Feedforward:
                    </strong>
                    Wichtig ist auch das Element des Feedforwards (Hinweissystem) f&uuml;r das Kind. An den Grenzen des eigenen Reviers k&ouml;nnte es &uuml;ber das Wearable durch Licht-, Vibration- und/oder Soundelemente benachrichtigt werden, diese nicht zu &uuml;berschreiten. Auch in Gefahrensituationen (un&uuml;bersichtlicher Verkehrsknotenpunkt, Unwetterwarnung, Baustelle, Ann&auml;herung eines Autos (Autosensorik)), k&ouml;nnte das Wearable das Kind durch Licht-, Vibration- und/oder Soundelemente warnen.
                    <strong>
                        - Navigation:
                    </strong>
                    Vorstellbar ist, Elemente zur Navigation in das Wearable zu integrieren, die ein Wegeleitsystem f&uuml;r unterwegs z. B. &uuml;ber Vibration erm&ouml;glichen k&ouml;nnten.
                </p>
                <h2>
                    M&ouml;gliche Erweiterungen der gesamten Anwendung
                </h2>
                <p>
                    <strong>
                        - Terminerinnerung:
                    </strong>
                    Die App bzw. das Wearable k&ouml;nnen auf anstehende Termine (z. B. B&uuml;rgeramt) hinweisen. Durch eine Push-Notification oder Vibration kann man erinnert werden, dass es Zeit ist, aufzubrechen.
                    <strong>
                        - Kalender:
                    </strong>
                    Stundenpl&auml;ne und Termine der Kinder k&ouml;nnen in der Anwendung ber&uuml;cksichtigt werden (AI)
                    <strong>
                        - Datenintegration:
                    </strong>
                    Wetter-, Schadstoffbelastungs-, Verkehrs- (&Ouml;PNV; Sharing Services), Stadtplanungsdaten k&ouml;nnen die Kartenansicht und somit die tagesaktuelle Planung der Schulwege bereichern
                    <strong>
                        - Autosensorik:
                    </strong>
                    automobile Sensoren k&ouml;nnten f&uuml;r noch mehr Sicherheit sorgen (Mitfahrten und Gefahrensituationen)
                    <strong>
                        - Zielgrupp:
                    </strong>
                    Die Interaktionen m&uuml;ssen mit der ausgew&auml;hlten Zielgruppe &uuml;berpr&uuml;ft und den genauen Anforderungen angepasst werden.
                    <strong>
                        - Skalierung:
                    </strong>
                    Das System kann Inspiration bzw. Ausgangspunkt f&uuml;r ein umfangreicheres und deutschland- oder weltweites Wegeleitsystem f&uuml;r verschiedene Zielgruppen sein (Arbeitswege, Freizeit, Dienstreise, Urlaub, usw.).
                </p>
                <h2>
                    Anbindung
                </h2>
                <ul>
                    <li>
                        Ansatz f&uuml;r die Anbindung an die Karte von Norderstedt f&uuml;r die Mobile App (&uuml;ber Kotlin und Java); Karte ist mit Google Maps integriert; mithilfe von GeoJSON bzw. Amazon S3 API wird ein Layer &uuml;ber die Karte gelegt
                    </li>
                    <li>
                        Arduino Code f&uuml;r das Wearable
                    </li>
                    <li>
                        Drahtlosverbindung mit Bluetooth Low Energy; zuk&uuml;nftig m&uuml;sste man ein drahtloses WLan-Modul einbauen, weil die Bluetooth-Reichweite nur ca. 10m betr&auml;gt; beide Technologien nutzen das 2,4 gHz Frequenzband
                    </li>
                    <li>
                        Android Studio (mobile application)
                    </li>
                </ul>
                <h2>
                    Motivation (belegt durch Referenzen)
                </h2>
                <p>
                    Viele Anwendungen f&uuml;r Eltern und Kinder arbeiten mit Uhren und Schl&uuml;sselanh&auml;ngern und die Kinder werden dabei vielmals extrem von ihren kontrolliert und &uuml;berwacht. Auch f&uuml;r Haustiere gibt es inzwischen Tracking Devices, die die Tiere lokalisieren k&ouml;nnen. Diese Beispiele missachten die Anforderungen der Kinder, ihre Freiheiten auf dem Schulweg beibehalten zu wollen. Ein Positivbeispiel, das uns als Inspiration diente ist eine Notfalljacke, die durch eine textile Interaktion einen eigenen Kontakt anrufen und so ein Notfallsignal senden kann. In der Sch&uuml;ler-Lutze Applikation wird daher den Kindern die Entscheidung &uuml;berlassen, wann sie lokalisiert werden k&ouml;nnen.
                </p>
                <ul>
                    <li>
                        <a href="http://www.design-research-lab.org/projects/emergency-apparel/" rel="nofollow">
                            Notfalljacke
                        </a>
                    </li>
                    <li>
                        <a href="https://www.safewise.com/resources/wearable-gps-tracking-devices-for-kids-guide/" rel="nofollow">
                            Kindertracking (haupts&auml;chlich Uhren und Schl&uuml;sselanh&auml;nger)
                        </a>
                    </li>
                    <li>
                        <a href="https://www.weenect.com/de/gps-tracker-fur-hunde-weenect-dogs.html?campaignid=828595582&amp;gclid=Cj0KCQiA_s7fBRDrARIsAGEvF8RHJtrMWQ18xDHa8byzs_gBw5qzNQiAoYJKj7SVX8LAjIgQpSmqKWIaAgUcEALw_wcB" rel="nofollow">
                            GPS-Hundehalsband
                        </a>
                    </li>
                </ul>
                <h2>
                    What we learned
                </h2>
                <ul>
                    <li>
                        von der Reihenfolge w&auml;re es sinnvoll gewesen, mit den Hardware-Komponenten anzufangen und daraus den Code zu entwickeln und sich nicht anfangs in den APIs zu verlieren
                    </li>
                    <li>
                        zu Beginn sollte man sich einen Plan machen, um nicht auf Abwege zu geraten
                    </li>
                    <li>
                        erst mit den einfachen Dingen beginnen, damit man auf jeden Fall etwas zeigen kann
                    </li>
                    <li>
                        es muss nicht immer alles funktionieren
                    </li>
                </ul>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/arduino">
                                arduino
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/geojson">
                                geojson
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            kotlin
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/lilypad">
                                lilypad
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            wearable
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/RikeOne/Norderstedt" rel="nofollow" target="_blank" title="https://github.com/RikeOne/Norderstedt">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
