<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="309827" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/309/827/datas/original.png">
                            <img alt="SDS (Sistema de seguridad social) &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/309/827/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Este proyecto surgi&oacute;,por experiencias pasadas de los integrantes del equipo, tomando en cuenta el reto propuesto al inicio del  hackathon, en conjunto expresamos nuestros disgustos ante esta situaci&oacute;n y tratamos  proponer una soluci&oacute;n.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    b&aacute;sicamente lo que esta aplicaci&oacute;n m&oacute;vil hace es brindarle una experiencia m&aacute;s placentera,c&oacute;moda y f&aacute;cil al usuario  en dado caso que surja una emergencia tenga disponibles todos los servicios que la comunidad le brinda como asistencia policiaca, asistencia de rescate (bomberos), asistencia m&eacute;dica. sin que el usuario tenga que esperar para que sea atendido v&iacute;a telef&oacute;nica, permitiendo una comunicaci&oacute;n eficaz y oportuna, para actuar ante estas situaciones.
 ## How I built it
Para el desarrollo de la aplicaci&oacute;n utilizamos como base Android Studio(java) y todos sus complementos como sdk, as&iacute; mismo para crear un servidor REST , se utiliz&oacute; el framework de desarrollo de Ruby on Rails, y para crear la interfaz del usuario dentro de un navegador usamos css3,html5 y javascript. Y as&iacute; mismo como un  HTTP server llamado nginx.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Uno de los principales retos que como equipo encontramos fue el hecho de estar en contra reloj y tener que soportar horas despiertos para poder acabarla con &eacute;xito, para todos fue una experiencia totalmente distinta a lo que est&aacute;bamos acostumbrados en nuestra caja de confort  pero de forma proporcional fue igual de grata.
otro punto, que consideramos sufrieron todos los equipos fue a clarar las ideas y organizarlas a tal punto de poderlas plasmar y cobrar&aacute;n vida, pero para este punto tuvimos que buscar nuevas alternativas que sustituyeran a  los lenguajes a los que est&aacute;bamos acostumbrados  a manejar.
El hecho de estar con personas mayores que varios de nuestros integrantes logro intimidarnos un poco , pero pudimos  superar ese miedo porque sab&iacute;amos que al igual que ellos pod&iacute;amos obtener y desarrollar lo mismo o mejor.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Estamos orgullos porque logramos algo que para el inicio parec&iacute;a imposible, enfrentamos a nuestro Goliat que es el miedo y el estr&eacute;s para poder crear algo bello en conjunto.
de mantenernos 26 horas despiertos m&iacute;nimo.
Conocer nuevos colegas en distintas &aacute;reas  y poder compartir conocimientos que nos serviran para nuestro desarrollo.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Qu&eacute; no dormir es malo :C 
El trabajo de forma colaborativa siempre sera mejor.
Utilizamos y conocimos nueva tecnolog&iacute;a hardware  de amazon.
Aprendimos que si nos salimos de nuestra zona de confort podemos romper paradigmas y podemos crear cosas asombrosas.
El trabajo es duro,pero la satisfaccion te recompensa todo.
                </p>
                <h2>
                    What's next for SDS (Sistema de seguridad social)
                </h2>
                <p>
                    Desarrollar todas las partes propuestas en las ideas  que no plasmamos por falta de tiempo , como un sistema sincronizado en tiempo real.
Esperamos poder realmente implementarlo en nuestro estado y vi&eacute;ndolo de una forma a gran escala el pa&iacute;s.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css3">
                                css3
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mysql">
                                mysql
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/nginx">
                                nginx
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ruby-on-rails">
                                ruby-on-rails
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
