<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/EB2wL7fu4fU?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="895318" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/895/318/datas/original.jpg">
                            <img alt="SensorFlow &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/895/318/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiraci&oacute;n
                </h2>
                <p>
                    Despu&eacute;s de analizar los retos, nos hemos interesado por las tecnolog&iacute;as relacionadas con el IoT por lo que hemos apostado por la creaci&oacute;n de un sistema de monitorizaci&oacute;n a baja escala con la intenci&oacute;n de empezar con un proyecto accesible, pero con mucha capacidad de crecimiento.
                </p>
                <h2>
                    Que hace
                </h2>
                <p>
                    Nuestro sistema mide par&aacute;metros ambientales a nivel de hogar (temperatura y humedad) a trav&eacute;s de sensores conectados a un sistema operativo Raspbian, conectado a su vez con un API alojada en un servidor Web propio. Los datos obtenidos se transmiten a diversos dispositivos. 
En este momento tenemos implementada una integraci&oacute;n con sistemas de asistencia por voz (Amazon Alexa) y con smartphones, con la intenci&oacute;n de otorgar una mayor versatilidad y accesibilidad a los usuarios objetivo. El usuario puede, en funci&oacute;n de la informaci&oacute;n aportada, tomar decisiones para activar sistemas relacionados con los par&aacute;metros tomados. En nuestro caso, tenemos implementado un sistema LED que simula una instalaci&oacute;n de climatizaci&oacute;n a peque&ntilde;a escala.
                </p>
                <h2>
                    Como lo hemos desarrollado
                </h2>
                <p>
                    La Raspberry funciona con su propio sistema Raspbian.
El servidor aloja una API programada con Flask (python). 
El sistema de reconocimiento de voz est&aacute; programado con Lambdas de Alexa para obtener los par&aacute;metros.
                </p>
                <h2>
                    Retos afrontados
                </h2>
                <p>
                    En un principio, no hemos dispuesto de la tecnolog&iacute;a necesaria para el reto, de modo que hemos buscado alternativas para solucionar los deficits y afrontar el reto de la forma mas viable posible. 
Hemos intentado ampliar nuestro sistema con un asistente de voz, por lo que hemos tenido que entender la programaci&oacute;n de Amazon Alexa y hemos implementado un sistema de Machine Learning que, aunque no hemos podido introducir en nuestro Backend, nos ha permitido crear una Red Neuronal para la predicci&oacute;n temporal de Temperaturas.
                </p>
                <h2>
                    Logros
                </h2>
                <p>
                    "Think out the box"
Conexiones hardware con un sistema Raspberry Pi3 (sensor de temperatura/humedad DHT11 y puertos GPIO).
Creaci&oacute;n de skills de Alexa.
Creaci&oacute;n de una peque&ntilde;a red neuronal para predecir Temperaturas en funci&oacute;n de los par&aacute;metros obtenidos.
Conseguir mediante el flujo Alexa/App que los sistemas funcione (en nuestro caso, simulaci&oacute;n con sistema LED).
Construcci&oacute;n de web app multiplataforma para adaptarlo a la mayor&iacute;a de dispositivos del mercado.
                </p>
                <h2>
                    Que hemos aprendido
                </h2>
                <p>
                    Conocimientos adquiridos sobre el sistema de programaci&oacute;n de Alexa y Machine Learning.
Construcci&oacute;n de una arquitectura completa End-to-End con algunas tecnolog&iacute;as con las que no hab&iacute;amos trabajado.
                </p>
                <h2>
                    Posibilidades de futuro
                </h2>
                <p>
                    Todav&iacute;a queda mucho trabajo por delante. La principal idea es introducir el sistema de machine learning para poder predecir, con una buena accuracy, y automatizar los sistemas. Lo ideal ser&iacute;a introducir una mayor diversidad de sensores para una monitorizaci&oacute;n completa.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/amazon-alexa">
                                amazon-alexa
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/flask">
                                flask
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ionic">
                                ionic
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            raspbian
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            tensorflow
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Victomas97/HackEPS" rel="nofollow" target="_blank" title="https://github.com/Victomas97/HackEPS">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
