<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiraci&oacute;n
                </h2>
                <p>
                    Los miembros del equipo tenemos entre nuestros familiares personas dependientes que viven en soledad. Hemos pensado esta skill para que tanto ellos como nosotros podamos vivir mas tranquilos y seguros.
                </p>
                <h2>
                    Equipo
                </h2>
                <ul>
                    <li>
                        Teresa Mart&iacute;nez. Desarrolladora web. Freelance
                    </li>
                    <li>
                        Javier Campos. Desarrollador APPs. Cofundador de Mobilendo
                    </li>
                    <li>
                        Alfonso Tienda. Desarrollador especializado en salud. Gerente de IPROCURATIO CONSULTORES
                    </li>
                </ul>
                <h2>
                    Breve descripci&oacute;n
                </h2>
                <p>
                    Sin miedo es una aplicaci&oacute;n que a trav&eacute;s de Alexa incrementa la seguridad de nuestros mayores a trav&eacute;s de la comunicaci&oacute;n de inicio de algunas tareas que por sus caracter&iacute;sticas pueden tener riesgo para personas con movilidad reducida u otras capacidades afectadas.
                </p>
                <p>
                    La aplicaci&oacute;n informar&aacute; a los familiares en el caso de que no reciba notificaci&oacute;n de finalizaci&oacute;n de estas tareas.
                </p>
                <h2>
                    Caracter&iacute;sticas
                </h2>
                <ul>
                    <li>
                        Esta disponible para pantallas con APL
                    </li>
                </ul>
                <h2>
                    Ejemplo de conversaci&oacute;n
                </h2>
                <p>
                    ** Dependiente **
                </p>
                <p>
                    _ Primera vez _
                </p>
                <ul>
                    <li>
                        (Usuario) Alexa, abre sin miedo
                    </li>
                    <li>
                        (Alexa) Hola "Teresa", gracias por usar la Skill "Sin Miedo". &iquest;Eres cuidador o dependiente?
                    </li>
                    <li>
                        (Usuario) Dependiente
                    </li>
                    <li>
                        (Alexa) Genial dependiente. Di el siguiente c&oacute;digo a tu cuidador para terminar la configuraci&oacute;n. El c&oacute;digo se compone de 4 palabras y es el siguiente: WWW XXX YYY ZZZ. Te lo repito m&aacute;s despacio: www xxx yyy zzz. Vuelve cuando hayas dado el c&oacute;digo a tu cuidador. &iexcl;Hasta luego!
                    </li>
                    <li>
                        (Usuario) Stop
                    </li>
                    <li>
                        (Alexa) &iexcl;Hasta luego!
                    </li>
                </ul>
                <p>
                    _ Segunda y sucesivas veces  _
                </p>
                <ul>
                    <li>
                        (Usuario) Alexa, abre sin miedo
                    </li>
                    <li>
                        (Alexa) Hola Teresa, gracias por usar la Skill "Sin Miedo". &iquest;Qu&eacute; vas a hacer? Dime algo como "Voy a ducharme", para que tu cuidador est&eacute; informado. &iquest;Qu&eacute; vas a hacer?
                    </li>
                    <li>
                        (Usuario) Voy a ducharme
                    </li>
                    <li>
                        (Alexa) &iquest;Cu&aacute;ntos minutos debo esperar antes de preocuparme?
                    </li>
                    <li>
                        (Usuario) XX minutos
                    </li>
                    <li>
                        (Alexa) Acci&oacute;n guardada. Vuelve en m&aacute;ximo XX minutos para que sepa que est&aacute;s bien. &iexcl;Hasta luego!
                    </li>
                </ul>
                <p>
                    _ Vuelve a abrir la skill _
                </p>
                <ul>
                    <li>
                        (Usuario) Alexa, abre sin miedo
                    </li>
                    <li>
                        (Alexa) Me alegro de que est&eacute;s bien. &iquest;Qu&eacute; vas a hacer ahora? Dime algo como "Voy a cocinar" o tambi&eacute;n puedes decir "Salir"
                    </li>
                    <li>
                        (Usuario)
                    </li>
                </ul>
                <p>
                    ** Cuidador **
                </p>
                <p>
                    _ Primera vez _
                </p>
                <ul>
                    <li>
                        (Usuario) Alexa, abre sin miedo
                    </li>
                    <li>
                        (Alexa) Hola "Alfonso", gracias por usar la Skill "Sin Miedo". &iquest;Eres cuidador o dependiente?
                    </li>
                    <li>
                        (Usuario) Cuidador
                    </li>
                    <li>
                        (Alexa) Genial cuidador. Sino lo has hecho ya, abre la skill en el altavoz de la persona que cuidas y sigue los pasos. Para continuar, dime "a&ntilde;adir c&oacute;digo de un familiar" o "salir". &iquest;Qu&eacute; dices?
                    </li>
                    <li>
                        (Usuario) WWW XXX YYY ZZZ
                    </li>
                    <li>
                        (Alexa) El c&oacute;digo escuchado es: primavera amarillo amarillo amarillo &iexcl;Genial! Acabas de a&ntilde;adir a Teresa. Ya puedes escuchar sus acciones y recibir sus avisos. Dime por ejemplo "ver diario". &iquest;Qu&eacute; dices?
                    </li>
                    <li>
                        (Usuario) Salir
                    </li>
                </ul>
                <p>
                    _ Segunda y sucesivas veces  _
                </p>
                <ul>
                    <li>
                        (Usuario) Alexa, abre sin miedo
                    </li>
                    <li>
                        (Alexa) La siguiente acci&oacute;n de Teresa aun est&aacute; activa. Voy a cocinar con tiempo m&aacute;ximo de XX minutos hace Y minutos.
                    </li>
                    <li>
                        O (Alexa) No hay ninguna acci&oacute;n activa de Teresa
                    </li>
                    <li>
                        (Usuario) Salir
                    </li>
                </ul>
                <h2>
                    P&uacute;blico objetivo
                </h2>
                <ul>
                    <li>
                        Nuestros mayores
                    </li>
                    <li>
                        Dependientes
                    </li>
                    <li>
                        Personas que vivan solas
                    </li>
                </ul>
                <h2>
                    Ejemplos casos de uso
                </h2>
                <ul>
                    <li>
                        Anciano de 80 a&ntilde;os que estando solo en casa realiza una actividad peligrosa para su edad (por ejemplo ducharse)
                    </li>
                    <li>
                        Persona de mediana edad que tiene que hacer un tarea en casa que ponga en peligro un integridad f&iacute;sica (por ejemplo subirse a una escalera, cambiar una bombilla, ...)
                    </li>
                    <li>
                        Persona de cualquier edad que realice una actividad peligrosa (por ejemplo abrir la puerta de madrugada a un desconocido)
                    </li>
                </ul>
                <h2>
                    Estado
                </h2>
                <ul>
                    <li>
                        Est&aacute; enviado a certificar
                    </li>
                </ul>
                <h2>
                    Presentaci&oacute;n
                </h2>
                <p>
                    <a href="http://javiercampos.es/proyectos/hackathon-alexa-madrid/sinmiedo.pdf" rel="nofollow">
                        http://javiercampos.es/proyectos/hackathon-alexa-madrid/sinmiedo.pdf
                    </a>
                </p>
                <h2>
                    Futuro de la Skill
                </h2>
                <ul>
                    <li>
                        Utilizar API Remider para avisar al dependiente que ha caducado su aviso (al pasar el tiempo m&aacute;ximo configurado)
                    </li>
                    <li>
                        Env&iacute;o SMS (previo pago con los In-Skill Purchasing)
                    </li>
                    <li>
                        Preguntar por su estado de salud
                    </li>
                    <li>
                        Mejorar la experiencia conversacional
                    </li>
                    <li>
                        Abrir a mas idiomas ademas del espa&ntilde;ol y el ingl&eacute;s
                    </li>
                </ul>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/amazon-dynamodb">
                                amazon-dynamodb
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            apl
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/django">
                                django
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            rest
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            ssml
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
