<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    GPS-Marker werden an zu fertigende Teile gebunden und durchlaufen mit den Teilen diverse Prozesse. F&uuml;r den Gesamtprozess existiert also ein Start- und ein Endzeitpunkt, wobei diese manuell gesetzt werden m&uuml;ssen. Das Setzen der Zeitpunkte wird in der Praxis nicht immer gemacht, was zu fehlerhaften und falschen Daten f&uuml;hrt.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Das Vorhaben l&auml;sst die GPS-Marker "smart" werden und erkennen automatisiert den Endzeitpunkt einer industriellen Prozesskette, sodass diese Information nicht manuell erfasst werden muss und die Datenqualit&auml;t dadurch rapide ansteigt.
                </p>
                <ul>
                    <li>
                        <p>
                            KI: Automatisierte Prediction eines Prozessendes durch Eingabe einer Prozesssequenz eines Markers
                        </p>
                        <ul>
                            <li>
                                Dadurch k&ouml;nnen auch fehlende Endzeitpunkte vorhergesagt werden
                            </li>
                            <li>
                                Erh&ouml;hte Datenqualit&auml;t f&uuml;r andere Datenverarbeitungen und KIs
                            </li>
                            <li>
                                KI kann f&uuml;r Transfer-Learning verwendet werden
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p>
                            Fusions-Algorithmus:
                        </p>
                        <ul>
                            <li>
                                Prozess-Area f&uuml;r jeden Timestamp eines Markers wird durch (x,y)-Koordinaten ermitteln und ein neuer Datensatz f&uuml; die Positions-Historie aller Marker generiert
                            </li>
                            <li>
                                Erstellt Datensatz von Batches f&uuml;r jede vollst&auml;ndig vorhandene Prozessekette aus den Daten, um damit das RNN-Modell zu trainieren
                            </li>
                            <li>
                                Auch Batches f&uuml;r unvollst&auml;ndige Prozessketten
                            </li>
                        </ul>
                    </li>
                </ul>
                <h2>
                    How we built it
                </h2>
                <ul>
                    <li>
                        <p>
                            Tools: Python &amp; torch
                        </p>
                    </li>
                    <li>
                        <p>
                            Verst&auml;ndnis der Daten:
                        </p>
                        <ul>
                            <li>
                                Alle Datenpunkte auf der gegebenen Karte von Trumpf geplottet und interpretiert
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p>
                            Datenaufbereitung:
                        </p>
                        <ul>
                            <li>
                                Positions-Historie um Prozess-Area f&uuml;r jeden Timestamp und Marker erweitert
                            </li>
                            <li>
                                Erreicht bessere Generalisierung
                            </li>
                            <li>
                                Batch-Datensatz zum Trainieren der KI aus den aufbereiteten Datens&auml;tzen generiert und unvollst&auml;ndige Sequenzen verworfen
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p>
                            RNN:
                        </p>
                        <ul>
                            <li>
                                Nutzen f&uuml;r LSTMs f&uuml;r Zustandshaltung von relevanten Prozessschritten
                            </li>
                            <li>
                                Sequence-to-Sequence-Learning
                            </li>
                        </ul>
                    </li>
                </ul>
                <p>
                    <img alt="RNN - Many to One" data-canonical-url="https://i.stack.imgur.com/F7qzk.jpg" src="https://res.cloudinary.com/devpost/image/fetch/s--ok6VLqc7--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://i.stack.imgur.com/F7qzk.jpg">
                    <img alt="LSTM" data-canonical-url="https://i.ytimg.com/vi/kMLl-TKaEnc/maxresdefault.jpg" src="https://res.cloudinary.com/devpost/image/fetch/s--HM5BjEPA--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://i.ytimg.com/vi/kMLl-TKaEnc/maxresdefault.jpg">
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <ul>
                    <li>
                        <p>
                            Relativ wenige Daten f&uuml;r heterogene Prozesse, die umst&auml;ndlich fusioniert, aufbereitet und aussortiert werden mussten
                        </p>
                    </li>
                    <li>
                        <p>
                            Wenig Zeit, um lokal neuronales Netz zu trainieren und zu optimieren
                        </p>
                    </li>
                    <li>
                        <p>
                            Rechenpower
                        </p>
                        <ul>
                            <li>
                                11h Daten-Aufbereitung
                            </li>
                            <li>
                                7h RNN-Training
                            </li>
                        </ul>
                    </li>
                </ul>
                <h2>
                    Accomplishments that we are proud of
                </h2>
                <ul>
                    <li>
                        Fertiges RNN mit LSTMs
                    </li>
                    <li>
                        Durch Fusionieren der Daten und Zusammenf&uuml;hren mehrerer Tabellen deutlich bessere Ergebnisse erzielt
                    </li>
                </ul>
                <h2>
                    What we learned
                </h2>
                <ul>
                    <li>
                        <p>
                            Auslagern von rechenintensiven Operationen wie Trainieren und Aufbereiten von Daten
                        </p>
                    </li>
                    <li>
                        <p>
                            Mehrere Modelle parallel trainieren wirkt kurzer Zeit entgegen und optimiert die KI wenigstens etwas
                        </p>
                    </li>
                </ul>
                <h2>
                    What's next for smart_gps
                </h2>
                <ul>
                    <li>
                        <p>
                            Sammeln von mehreren Samples f&uuml;r &auml;hnliche Prozesse, damit die KI besser generalisiert
                        </p>
                    </li>
                    <li>
                        <p>
                            Optimieren der Aufbereitung der Daten
                        </p>
                    </li>
                    <li>
                        <p>
                            Optimieren der Hyperparameter, vor allem tieferes Netz
                        </p>
                    </li>
                </ul>
                <h3>
                    How to run
                </h3>
                <ul>
                    <li>
                        Um die Datenaufbereitung durchzuf&uuml;hren, m&uuml;ssen die Datens&auml;tze von TRUMPF GmbH + Co. KG in der geforderten Ordnerstruktur vorliegen (
                        <em>
                            siehe data_magic.py &amp; data_merger.py
                        </em>
                        )
                    </li>
                    <li>
                        F&uuml;r Prediction von 5 Testdaten:
                        <code>
                            python rnn.py
                        </code>
                    </li>
                </ul>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/pytorch">
                                pytorch
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/kay-es/deeptech-ai" rel="nofollow" target="_blank" title="https://github.com/kay-es/deeptech-ai">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
