<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    At data er &aring;pne betyr n&oslash;dvendigvis ikke at de er tilgjengelig for alle. Det b&oslash;r v&aelig;re enkelt for alle &aring; bidra og leke med med ideer p&aring; &aring;pne data. I dag kreves det kompetanse i utvikling og programmering for &aring; ta i bruk &aring;pne data. Det gj&oslash;r at ikke alle kan delta.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Firkl&oslash;veren samler &aring;pne data p&aring; ett sted og gj&oslash;r de tilgjengelig for innbyggerne og andre som ikke er spesialister.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Den sentrale datakatalogen er basert p&aring; OpenSource systemet CKAN.org 
For eksperimentering &aring; visualisering har vi benyttet OpenSource programvaren QGIS.org
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    De forskjellige data tilbydere av &aring;pne data har forskjellig formatering av datafelter. For at forskjellige datasett skal kunne sammenlignes m&aring; feks tid og koordinater v&aelig;re likt. Datasett m&aring;tte derfor tilrettelegges for bruk.
                </p>
                <p>
                    <strong>
                        Dato og tid
                    </strong>
                    Forskjellig formatering 2016-09-21 vs 21/09-16 og mange andre. 
Er klokkeslett med eller uten sommertid osv.
                </p>
                <p>
                    <strong>
                        Koordinater i kart
                    </strong>
                    Northing og Easting og ikke latitude og longitude. Antall meter fra "vei-pinne" hos Vegvesenet.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <h2>
                    What we learned
                </h2>
                <p>
                    Vi ser at det er en stor jobb &aring; tilrettelegge &aring;pne datasett slik at de blir tilgjengelige for alle. Men det er langt bedre at jobben med tilrettelegging gj&oslash;res en gang enn at alle som skal bruke de &aring;pne data m&aring; gj&oslash;re det hver for seg.
                </p>
                <h2>
                    What's next for Firkl&oslash;veren
                </h2>
                <p>
                    Vi inviterer de forskjellige tilbyderne av &aring;pne data med &aring; gj&oslash;re &aring;pne data tilgjengelig for alle.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ckan">
                                ckan
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://www.smartbydata.no" rel="nofollow" target="_blank" title="http://www.smartbydata.no">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                www.smartbydata.no
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
