<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiraci&oacute;
                </h2>
                <p>
                    El repte proposat per Origen ens ha motivat a fer aquest projecte perqu&egrave;, ens permet integrar diverses tecnologies que no hav&iacute;em utilitzat fins ara.
                </p>
                <h2>
                    Qu&egrave; fa
                </h2>
                <p>
                    El nostres sistema est&agrave; compost per tres blocs principals, un d'ells que fa servir sensors per llegir la llum que hi ha en una determinada habitaci&oacute;, l'altre &eacute;s l'encarregat de controlar la llum de l'habitaci&oacute; en q&uuml;esti&oacute;, finalment l'&uacute;ltim bloc &eacute;s l'encarregat de gestionar la informaci&oacute; del primer bloc per controlar el segon. Aquest &uacute;ltim bloc, a m&eacute;s a m&eacute;s, et permet veure l'historial de llum ambiental que hi ha hagut en una habitaci&oacute; al llarg del temps.
                </p>
                <h2>
                    Com l'hem constru&iuml;t
                </h2>
                <p>
                    El primer bloc utilitza una placa NodeMCU ja que, t&eacute; un adaptador de Wi-Fi integrat a la placa que fem servir per comunicar al servidor la informaci&oacute; que llegeix del sensor de lluminositat que hi hem connectat.
El segon bloc consisteix &eacute;s un "smart plug" de la marca ZOOZEE, i utilitzem el servei conegut com a IFTTT (IF This Then That) per tal d'activar i desactivar la llum que hi connectem.
                </p>
                <p>
                    Finalment el tercer bloc &eacute;s un sistema de temps real que serveix tant una RestAPI, que es fa servir des del primer bloc per transmetre la informaci&oacute; dels sensors, com un servei web, pel que l'usuari pot visualitzar l'historial que s'actualitza en temps real amb web-sockets, tots aquests serveis estan programats en GoLang, i JavaScript.
                </p>
                <h2>
                    Dificultats que ens hem trobat
                </h2>
                <ul>
                    <li>
                        Inicialment ten&iacute;em la intenci&oacute; d'utilitzar el sensor de temperatura i humitat, al veure que no funcionava i no n'hi havia m&eacute;s de disponibles, vam decidir que utilitzar&iacute;em el seu lloc un sensor de lluminositat.
                    </li>
                    <li>
                        Aconseguir que la placa NodeMCU tingu&eacute;s mem&ograve;ria no vol&agrave;til per tal de no perdre la informaci&oacute; mentre es trobava en mode rep&ograve;s.
                    </li>
                    <li>
                        Hem hagut d'implementar el protocol HTTP/1.1 per a la NodeMCU, concretament la codificaci&oacute; correcte dels JSON i els headers del protocol.
                    </li>
                    <li>
                        Integrar l'actualitzaci&oacute; a temps real dels plots que es mostren a la pagina web. Integrar la base de dades SQLite3 amb el servidor programat en GoLang.
                    </li>
                </ul>
                <h2>
                    Assoliments dels que estem orgullosos
                </h2>
                <ul>
                    <li>
                        De resoldre les dificultats que hem mencionat anteriorment.
                    </li>
                    <li>
                        Poder acabar un projecte que inclou tantes tecnologies diferents i aconseguir que funcionin totes juntes.
                    </li>
                </ul>
                <h2>
                    El que hem apr&egrave;s
                </h2>
                <ul>
                    <li>
                        Utilitzar les bases de dades SQLite3.
                    </li>
                    <li>
                        Creaci&oacute; de gr&agrave;fiques amb D3.js
                    </li>
                    <li>
                        Entendre el protocol HTTP/1.1
                    </li>
                    <li>
                        Utilitzar IFTTT
                    </li>
                </ul>
                <h2>
                    Quin &eacute;s el futur de Smart lights
                </h2>
                <p>
                    Integrar m&eacute;s sensors i endolls per a controlar-los en funci&oacute; dels altres sensors, com per exemple, que quan obris la porta engegui la Nintendo Switch.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/arduino">
                                arduino
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css3">
                                css3
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/d3-js">
                                d3.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/go">
                                go
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            http1.1
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            ifttt
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            smart-live
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/joanvyc/SmartLights" rel="nofollow" target="_blank" title="https://github.com/joanvyc/SmartLights">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
