<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Nous avons pens&eacute; &agrave; utiliser les capacit&eacute;s uniques des villes intelligentes afin de les adapter &agrave; leur environnement. En fait, nous savons tous que les villes ne sont pas tout &agrave; fait adapt&eacute;es aux besoins de la plan&egrave;te et consomment beaucoup trop de ressources. Une fa&ccedil;on de le faire serait de miser sur la capacit&eacute; des citoyens &agrave; r&eacute;duire leur empreinte de carbone. Mais comment faire? C'est ici que notre application web sera utile!
                </p>
                <h2>
                    Ce que l'application fait
                </h2>
                <p>
                    Le logiciel permet &agrave; un utilisateur de mentionner le mod&egrave;le de son v&eacute;hicule et ses itin&eacute;raires fr&eacute;quemment emprunt&eacute;s. Notre logiciel calcule le nombre d'&eacute;mission de carbones utilis&eacute;es afin de lui d&eacute;montrer son empreinte carbone li&eacute;e &agrave; ses d&eacute;placements. Il pourra ensuite voir l'impact de son d&eacute;placement et pourra &eacute;ventuellement, par exemple, consid&eacute;rer de s'acheter une voiture &eacute;lectrique ou prendre son v&eacute;lo plus souvent.
                </p>
                <h2>
                    Comment nous l'avons fait
                </h2>
                <p>
                    Nous avons, de fa&ccedil;on g&eacute;n&eacute;rale, divis&eacute; notre projet en deux parties : Le &ldquo;Front&rdquo;, c&rsquo;est &agrave; dire l&rsquo;interface utilisateur, et le &ldquo;Back&rdquo;, c&rsquo;est &agrave; dire les traitements et calculs n&eacute;cessaires au fonctionnement de l&rsquo;application. Nous utilisons des donn&eacute;es fournies par Environnement Canada indiquant la consommation d'essence de diff&eacute;rents mod&egrave;les de voitures afin de calculer l'&eacute;mission de CO2 effectu&eacute; par les trajets de l'utilisateur.
                </p>
                <h2>
                    Les d&eacute;fis auxquels nous avons fait face
                </h2>
                <p>
                    Nous avons rencontr&eacute; beaucoup d&rsquo;obstacles pour choisir un sujet pertinent de projet. Nous avons aussi eu de la difficult&eacute; &agrave; choisir les technologies &agrave; utiliser.
                </p>
                <h2>
                    Ce qui nous rend fiers
                </h2>
                <p>
                    Nous sommes fiers de notre pers&eacute;v&eacute;rance qui a &eacute;t&eacute; grandement mise &agrave; l&rsquo;&eacute;preuve et des efforts d&eacute;di&eacute;s &agrave; notre passion pour l&rsquo;informatique!
                </p>
                <h2>
                    Ce que nous avons appris
                </h2>
                <p>
                    Nous avons eu l&rsquo;occasion d&rsquo;apprendre et de perfectionner nos connaissances dans plusieurs frameworks : node.js, ruby on rails, meteor, express, postgre, angular, bootstrap.
Nous avons aussi eu l'occasion de mieux comprendre le fonctionnement d'un Hackathon et cela nous sera utile dans de futurs &eacute;v&eacute;nements.
                </p>
                <h2>
                    Quel est la suite pour SmartNebula?
                </h2>
                <p>
                    Notre application se contente actuellement d'estimer l'empreinte de carbone bas&eacute;e sur le transport, mais cela n'est qu'une partie de l'empreinte de carbone totale d'un individu, qui se compl&egrave;te par les d&eacute;placements impos&eacute;s par tous les achats et services re&ccedil;us par cet individu et divers autres activit&eacute;s. De plus, l'empreinte de carbone totale n'est aussi qu'une fraction de l'empreinte &eacute;cologique totale d'une personne. Nous pouvons donc am&eacute;liorer notre application en recueillant d'autres donn&eacute;es afin de mieux &eacute;valuer les impacts &eacute;cologiques de la vie de tous les jours.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/typescript">
                                typescript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Hamelatoire/smartNebula" rel="nofollow" target="_blank" title="https://github.com/Hamelatoire/smartNebula">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
