<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="487133" data-title="Demo" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/487/133/datas/original.jpg">
                            <img alt="Smart Watch Kids &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/487/133/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Demo
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Nuestro proyecto se basa en una aplicaci&oacute;n para un smartwatch, creada especialmente para los ni&ntilde;os que necesitan asistencia en sus actividades diarias para ayudarlos a que vayan aprendiendo a organizarse todos los d&iacute;as y que logren poco a poco hacerse m&aacute;s independientes. La aplicaci&oacute;n consiste en una agenda electr&oacute;nica que va a indicarle a los ni&ntilde;os la hora que es y la actividad que deben realizar en ese momento, para lograr que lo hagan de manera aut&oacute;noma. Este es un proyecto viable y de mucha utilidad para la educaci&oacute;n y formaci&oacute;n de los ni&ntilde;os que requieren asistencia especial. El dise&ntilde;o de la interfaz es creado pensando espec&iacute;ficamente en que los usuarios ser&aacute;n ni&ntilde;os, es por eso que se realiz&oacute; un dise&ntilde;o simple, con im&aacute;genes y poco texto, que d&eacute; a entender lo esencial, como es la actividad y la hora &uacute;nicamente. De esta manera el ni&ntilde;o podr&aacute; identificar de un amanera sencilla lo que debe realizar como siguiente actividad en su itinerario. Una vez que el ni&ntilde;o haya realizado la actividad y actualice su Smartwatch, sus padres recibir&aacute;n la notificaci&oacute;n directo a sus celulares. Esta aplicaci&oacute;n trae muchos beneficios. Facilita a los ni&ntilde;os que organicen su tiempo, que sepan lo que van a hacer a lo largo del d&iacute;a, que aprendan a priorizar actividades, y de esta manera, logren ser m&aacute;s aut&oacute;nomos y puedan llegar a ser independientes. A su vez, ayudar&aacute; a los padres de familia que llevan una vida atareada a estar al pendiente de lo que sus hijos hacen, para disminuir la preocupaci&oacute;n que pudieran llegar a tener, adem&aacute;s de tener la seguridad de que sus ni&ntilde;os est&aacute;n aprendiendo a ser autosuficientes y responsables. El HW utilizado es un Smartwatch Pebble, en el cu&aacute;l se pueden implementar aplicaciones ya sea usando C o Javascript. Una vez listo el proyecto, se puede ejecutar el demo de la aplicaci&oacute;n desarrollada en el Smartwatch utilizando cualquier Smartphone con la aplicaci&oacute;n de Pebble.
                </p>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/elozada95/SmartWatchKids" rel="nofollow" target="_blank" title="https://github.com/elozada95/SmartWatchKids">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
