<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="745265" data-title="User Interface preview" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/265/datas/original.PNG">
                            <img alt="Snow-i &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/265/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                User Interface preview
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Puisque la conduite hivernale peut s&rsquo;av&eacute;rer tr&egrave;s dangereuse et d&eacute;sagr&eacute;able lors de temp&ecirc;te, la demande pour cr&eacute;er une application permettant de faciliter les d&eacute;placements hivernaux et d'optimiser le d&eacute;neigement des chemins routiers
est tr&egrave;s grande.
                </p>
                <p>
                    Snow-i est une application qui offre &agrave; ses utilisateurs de regarder en temps r&eacute;el les d&eacute;neigements des chemins routiers et donc de faire des choix optimis&eacute;s pour leurs d&eacute;placements. Grace &agrave; un syst&egrave;me de puces int&eacute;gr&eacute;es dans les v&eacute;hicules de d&eacute;neigement (non impl&eacute;ment&eacute; au cour du hackathon), Snow-i battit une carte g&eacute;ographique &agrave; l'aide de l'API Google Map afin d'afficher le progr&egrave;s des v&eacute;hicules de d&eacute;neigement. &Eacute;galement, &agrave; l'aide de l'utilisation de donn&eacute;es ouvertes du gouvernement, Snow-i affiche les trajets pr&eacute;vus des v&eacute;hicules de d&eacute;neigement et des stationnements alternatifs ouverts lors de ces op&eacute;rations.
                </p>
                <p>
                    &Agrave; l'aide de l'API de Google Map, nous utilisons les donn&eacute;es de longitude et latitude recueillies des tracteurs afin de construire les trajets parcourus. Notre application est sous forme de page web impl&eacute;ment&eacute;e en Html, CSS et JavaScript.
                </p>
                <p>
                    Malheureusement, un des membres de l'&eacute;quipe est tomb&eacute; malade la veille de l&rsquo;&eacute;v&eacute;nement. Nous avons donc du redoubler d'efforts afin de r&eacute;aliser notre projet dans le temps permis.
                </p>
                <p>
                    Nous sommes fiers d'avoir r&eacute;ussi &agrave; d&eacute;velopper une application web fonctionnelle, &eacute;tant donn&eacute; le fait que deux des membres de l'&eacute;quipe n'avait aucune exp&eacute;rience dans le domaine avant le d&eacute;but du hackathon.
                </p>
                <p>
                    Lors de cet &eacute;v&eacute;nement, nous avons appris &agrave; redoubler d'efforts face aux obstacles et &agrave; d&eacute;velopper une application web.
                </p>
                <p>
                    La prochaine &eacute;tape pour Snow-i est d'analyser l'impl&eacute;mentation d'un syst&egrave;me de g&eacute;olocalisation &agrave; puces et d'int&eacute;grer celui-ci &agrave; notre application web pour avoir un feedback continu des d&eacute;placements des appareils routiers.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/brackets">
                                brackets
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/django">
                                django
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/google-maps">
                                google-maps
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/visual-studio">
                                visual-studio
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/AnKhangC/PolyHacks-Snow-I" rel="nofollow" target="_blank" title="https://github.com/AnKhangC/PolyHacks-Snow-I">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
