<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="487058" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/487/058/datas/original.PNG">
                            <img alt="STAP &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/487/058/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    STAP parte de la premisa de la conectividad de una smart city. Al todos los ciudadanos estar conectados a la misma red, podemos analizar tendencias en los intereses de los mismos y desplegar publicidad dirigida con respecto a la mayor&iacute;a mediante pantallas repartidas en puntos estrat&eacute;gicos de la ciudad. Esto promueve una estrategia de mercado m&aacute;s ajustada a las preferencias de la gente en sectores espec&iacute;ficos, activando as&iacute; la econom&iacute;a local y extranjera.
                </p>
                <p>
                    Nuestros clientes ser&aacute;n las organizaciones que busquen difundir de manera eficaz alg&uacute;n tipo de informaci&oacute;n, ya sean cupones con usos limitados, publicidad comercial m&aacute;s tradicional o inclusive eventos de inter&eacute;s p&uacute;blico a escala metropolitana, como elecciones gubernamentales, ventas nocturnas o campa&ntilde;as de salud. Todo esto sin interferir de manera intrusiva en la vida diaria de los ciudadanos.
                </p>
                <p>
                    Nuestra ventaja comercial es la inclusi&oacute;n de c&oacute;digos promocionales en los anuncios con cierto l&iacute;mite de usos, provocando una necesidad inmediata. Esta publicidad, al ser totalmente din&aacute;mica, puede cambiar en cualquier momento y atacar a diferentes sectores de mercado en la misma zona. Las promociones contempladas involucran descuentos en tiendas comerciales o acceso inmediato a eventos de espect&aacute;culos, o alguna otra promoci&oacute;n definida por el cliente para que se pueda implementar en el sistema.
                </p>
                <p>
                    El software utilizado para la creaci&oacute;n de este sistema fue el framework Laravel, que se usa para las migraciones de la base de datos, simplificaciones en el c&oacute;digo del dise&ntilde;o web y en las instrucciones mismas para la recolecci&oacute;n de informaci&oacute;n.
                </p>
                <p>
                    Creemos firmemente en la escalabilidad del proyecto, as&iacute; como sus beneficios econ&oacute;micos y en la contribuci&oacute;n del sistema a una comunidad m&aacute;s participativa.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            apacheconf
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            vue
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/jorgebeauregard/STAP" rel="nofollow" target="_blank" title="https://github.com/jorgebeauregard/STAP">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
