<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h1>
                    StormGuard
                </h1>
                <h4>
                    Navn p&aring; laget/ l&oslash;sningen:
                </h4>
                <p>
                    <strong>
                        StormGuard
                    </strong>
                </p>
                <h4>
                    Navn p&aring; deltakerne:
                </h4>
                <ul>
                    <li>
                        Magnus Drangev&aring;g
                    </li>
                    <li>
                        Alexander Nissen
                    </li>
                    <li>
                        Ole Martin Ruud
                    </li>
                    <li>
                        Sveinung Aaker Gundersen
                    </li>
                </ul>
                <h4>
                    Kort oppsummering av l&oslash;sningen:
                </h4>
                <p>
                    En app som skreddersyr v&aelig;rvarslinger til hver enkelt bruker. Vi vil pushe varslinger om viktige v&aelig;rendringer som for eksempel f&oslash;rste sn&oslash;fall om h&oslash;sten og dermed gi en anbefaling om &aring; skifte til vinterdekk.
                </p>
                <h4>
                    N&aelig;rmere redegj&oslash;relse for l&oslash;sningen, hva dere har gjort og hvilke valg dere har tatt (f.eks hvilke brukerbehov l&oslash;sningen m&oslash;ter, forretningsmodell, hva er unikt, hva har dere vektlagt, teknologivalg/koding):
                </h4>
                <p>
                    Vi har skrevet en webbasert app som pusher notifikasjoner til brukernesmobiler. Webserveren tar utgangspunkt i noen statiske og dynamiske parametere om brukeren. Statiske parametere sier noe om brukeren har en hytte p&aring; fjellet, kj&oslash;rer bil eller kollektivt til jobben og hvor brukeren bor. Dynamiske parameter hentes fra brukerens kalender og facebook arrangement. Med disse parameterne skal vi skreddersy v&aelig;rvarslinger etter behov til brukeren.
                </p>
                <p>
                    I en tid hvor man f&aring;r notifikasjoner om alt mulig rart burde vi i det minste f&aring; en notifikasjon n&aring;r det skjer noe med v&aelig;ret rundt oss.
Det unike med v&aring;r l&oslash;sning er denne kombinasjonen av at varslingene er skreddersydd til brukeren som f&aring;r den, og at brukeren kun trenger &aring; &aring;pne appen en gang for &aring; legge inn preferanser. Deretter er det appen selv som tar initiativet til &aring; varsle n&aring;r v&aelig;rmeldingen vil p&aring;virke brukerens hverdag.
                </p>
                <p>
                    Applikasjonen er skrevet i ReactJS noe som gj&oslash;r at den b&aring;de er skalerbar og enkel &aring; deployere som en cross-platform applikasjon. Til n&aring; er det ikke implementert Redux i frontenden. I backenden er det ogs&aring; mulighet for &aring; videreutvikle algoritmer for &aring; velge ut data bedre for brukeren.
                </p>
                <h4>
                    Hvilke data er brukt:
                </h4>
                <p>
                    Yr json-api er implementert i prototype og planlagte datasett er
NVE: flom, nedb&oslash;r, temperatur, skred
Metrologisk institutt: b&oslash;lger, vind, skydekke
Statens vegvesen: Veimeldinger
                </p>
                <h4>
                    Lenke(r) til evnt. mockup/ demo el.l.:
                </h4>
                <p>
                    <a href="http://www.drangevagdesign.no" rel="nofollow">
                        http://www.drangevagdesign.no
                    </a>
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react">
                                react
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://drangevagdesign.no" rel="nofollow" target="_blank" title="https://drangevagdesign.no">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                drangevagdesign.no
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://github.com/magnusdr/stormguard" rel="nofollow" target="_blank" title="https://github.com/magnusdr/stormguard">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
