<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="487751" data-title="Parce que ta s&eacute;curit&eacute; nous tiens &agrave; coeur" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/487/751/datas/original.png">
                            <img alt="22 - Ta Route &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/487/751/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Parce que ta s&eacute;curit&eacute; nous tiens &agrave; coeur
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Apr&egrave;s avoir manipul&eacute; plusieurs jeux de donn&eacute;es de Donn&eacute;esQu&eacute;bec, notre attention s'est attard&eacute;e sur les rapports relatifs aux accidents de la circulation, et quel effroi quand nous avons, apr&egrave;s plusieurs recherches, appris qu'en 2016 le nombre de d&eacute;c&egrave;s li&eacute;s aux accidents de la route a augment&eacute; de 12% par rapport &agrave; l'ann&eacute;e 2015. 
Une envie de changer les choses est alors n&eacute;e en nous, et c'est ainsi que "Ta Route" naqu&icirc;t.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Ta Route est un outil de recherche d'itin&eacute;raires selon un niveau de risque relatif &agrave; la fr&eacute;quence d'accident dans un secteur donn&eacute;. Le trajet le plus s&eacute;curitaire est propos&eacute; &agrave; l'utilisateur en contournant les zones &agrave; risque.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    L'application est b&acirc;tie sur une architecture multitier et multiplateforme, les donn&eacute;es sont toutes g&eacute;r&eacute;es dans une
                    <em>
                        couche
                    </em>
                    de donn&eacute;es.
                </p>
                <p>
                    Le front-end est compos&eacute; d'un m&eacute;lange d'HTML/CSS et de JavaScript, le back-end repose enti&egrave;rement sur JavaScript avec l'utilisation de Node.Js et d'Express.Js pour assurer la partie serveur et communications HTTP.
                </p>
                <p>
                    Nous avons d&eacute;velopp&eacute; un Web API RESTful OData4 pour centraliser toutes les donn&eacute;es (provenance donn&eacute;es Qu&eacute;bec et Crowdsourcing de notre application). La raison de ceci est la facilit&eacute; d'acc&egrave;s aux donn&eacute;es ainsi que toutes les options qu'OData nous offre. Un autre avantage d'utiliser un API C# est le caching, ce qui nous donne une latitude de performance quand on touche &agrave; de plus gros fichiers.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Le fichier d'accidents ne comporte pas de point g&eacute;ographique, mais seulement des emplacements, donc nous avons du g&eacute;olocaliser les accidents poss&eacute;dant des num&eacute;ros ainsi que des noms de rue.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Toutes les donn&eacute;es recueillies sont accessibles dans l'API, donc nous gardons le concept de donn&eacute;es ouvertes, en temps r&eacute;el, facilement consultable par les municipalit&eacute;s, en format JSON.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Nous sommes une &eacute;quipe form&eacute;e sur place, donc nous avons d&ucirc; orienter notre fin de semaine selon les comp&eacute;tences et les connaissances de chacun.
                </p>
                <h2>
                    What's next for Ta Route
                </h2>
                <p>
                    Ta Route a pour objectif de devenir une plateforme de crowdsourcing permettant aux gouvernements et soci&eacute;t&eacute; de transport d'acc&eacute;der aux statistiques d'utilisation des transport des citoyens.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            api
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/express-js">
                                express.js
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/json">
                                json
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/node-js">
                                node.js
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://www.github.com/Freezky/taroute" rel="nofollow" target="_blank" title="http://www.github.com/Freezky/taroute">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                www.github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
