<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/jM9VCFcJf-A?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="788483" data-title="Logo" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/788/483/datas/original.png">
                            <img alt="17: TEAM &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/788/483/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Logo
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    <strong>
                        bold
                    </strong>
                    _ italics _
                </p>
                <blockquote>
                    <p>
                        Sabemos que a trav&eacute;s de la tecnolog&iacute;a podemos transformar el mundo. Por eso decidimos abordar una de las principales problem&aacute;ticas que afectan actualmente no solo a las mujeres sino a toda la sociedad. Estamos seguros que con el dise&ntilde;o y puesta en marcha de ideas eficientes podremos vivir muy pronto en un mundo completamente equitativo y justo.
                    </p>
                </blockquote>
                <h2>
                    What it does
                </h2>
                <p>
                    <strong>
                        bold
                    </strong>
                </p>
                <blockquote>
                    <p>
                        TEAM, se compone de 2 elementos principales: 1.
                        <a href="Red%20de%20organizaciones%20centralizada" rel="nofollow">
                            ROC
                        </a>
                        , 2. [Una aplicaci&oacute;n para smartphones ]
En general, Team crea una red de organizaciones centralizada, para la anal&iacute;tica y procesamiento de datos, la cual tiene un papel importante en la app. Team app cuenta con una funcionalidad que permite al usuario comunicarse con  Sof&iacute;a (asistente virtual que incorpora inteligencia artificial-Watson) la cual identifica tus emociones y te da un consejo de adecuado para hacerte sentir mejor si lo necesitas. Del mismo modo, cuenta con una red de apoyo que son personas que est&aacute;n cerca de ti y/o en la misma posici&oacute;n de vulnerabilidad necesitando un apoyo m&aacute;s consciente de su situaci&oacute;n. De esta manera cuenta con un espacio an&oacute;nimo para publicar sus sentimientos y sus estados de &aacute;nimo  permitiendo que otras personas tanto expertas como v&iacute;ctimas puedan dar un consejo reforzando las habilidades emp&aacute;ticas. Tambi&eacute;n, cuenta con un calendario preventivo con fechas importantes donde se contar&aacute; con campa&ntilde;as, de empoderamiento social, a nivel psicol&oacute;gico y emocional, inmersivas para concientizar y defensa personal.
                    </p>
                </blockquote>
                <h2>
                    How we built it
                </h2>
                <p>
                    <strong>
                        bold
                    </strong>
                </p>
                <blockquote>
                    <p>
                        Luego de un proceso de an&aacute;lisis de las tem&aacute;ticas, b&uacute;squeda de informaci&oacute;n e ideaci&oacute;n, se procedi&oacute; a realizar un mockup para representar las funcionalidades y el dise&ntilde;o en general del aplicativo. Por otra parte se desarrollaron e implementaron los servicios web que consumir&aacute; la aplicaci&oacute;n y el servicio del asistente virtual (Watson)
                    </p>
                </blockquote>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    <strong>
                        bold
                    </strong>
                </p>
                <blockquote>
                    <p>
                        Dado que estamos en otro pa&iacute;s, fue complejo entender el contexto y el manejo de la informaci&oacute;n en M&eacute;xico, por otra parte tambi&eacute;n se nos dificult&oacute; la integraci&oacute;n de las diferentes tecnolog&iacute;as que quer&iacute;amos implementar en nuestra soluci&oacute;n.
                    </p>
                </blockquote>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    <strong>
                        bold
                    </strong>
                </p>
                <blockquote>
                    <p>
                        Descubrimos que nuestro proyecto tiene un gran y extenso contexto y que de llevarse a cabo podr&iacute;a beneficiar a miles de personas, nos sentimos orgullosos de poder demostar nuestro talento a nivel internacional, participando en este evento.
                    </p>
                </blockquote>
                <h2>
                    What we learned
                </h2>
                <p>
                    <strong>
                        bold
                    </strong>
                </p>
                <blockquote>
                    <p>
                        Como Colombianos, lo m&aacute;s importante que aprendimos fue interactuar y conocer otra cultura, otras costumbres y sobre todo a otras personas con las que podemos crear lazos y tejer redes que nos servir&aacute;n para nuestro futuro profesional.
                    </p>
                </blockquote>
                <h2>
                    What's next for TEAM
                </h2>
                <p>
                    <strong>
                        bold
                    </strong>
                </p>
                <blockquote>
                    <p>
                        Establecer contactos para el desarrollo y puesta en marcha del proyecto en diferentes zonas de Colombia y M&eacute;xico. Por otra parte, descubrimos que nuestras ideas pueden superar fronteras, ahora sabemos que podemos escalar la idea de TEAM y expandirla y adaptarla a los diferentes contextos internacionales.
                    </p>
                </blockquote>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/adobe-illustrator">
                                adobe-illustrator
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            business-inteligence
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            cloud
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css3">
                                css3
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            ia
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ibm-watson">
                                ibm-watson
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mysql">
                                mysql
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            web-server
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://prezi.com/view/YJd0CVjCP2Ux6cmbzykd/" rel="nofollow" target="_blank" title="https://prezi.com/view/YJd0CVjCP2Ux6cmbzykd/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                prezi.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
