<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="788356" data-title="logo" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/788/356/datas/original.jpeg">
                            <img alt="Tech My Way &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/788/356/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                logo
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Todos hemos pasado por aquel momento en el que quer&iacute;amos aprender much&iacute;simas cosas; pero no import&oacute; a cuantos cursos nos inscribieramos, no los terminamos.
Hay much&iacute;simos recursos en l&iacute;nea, la mayor&iacute;a gratuitos; hacer una p&aacute;gina m&aacute;s sobre c&oacute;mo aprender a hacer algo est&aacute; de m&aacute;s...
Necesitamos una que nos gu&iacute;e.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Nuestra aplicaci&oacute;n web busca conectar a los j&oacute;venes (12-17 a&ntilde;os) con los recursos correctos en l&iacute;nea. A trav&eacute;s de un primer filtrado, se conocen los intereses del usuario y se propone un camino principal. Un asistente inteligente (bot) se encarga de gu&iacute;ar al usuario a trav&eacute;s de ese camino que cuenta con recursos y retos.
Dependiendo de la interacci&oacute;n tanto de la plataforma, como del bot, el camino sigue avanzando.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Dise&ntilde;amos un prototipo sencillo que trabaja con bootstrap, e idealmente una base de datos local.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Nuestra idea empez&oacute; sencilla, pero conforme iba pasando el tiempo ven&iacute;amos con m&aacute;s cosas y empez&oacute; a volverse m&aacute;s compleja.
No pudimos hacer m&aacute;s all&aacute; de un prototipo ya que no sab&iacute;amos c&oacute;mo trabajar con un servidor web (aunque intentamos desde AWS hasta DigitalOcean).
Al final decidimos hacerlo local, pero PHP nos complic&oacute; la conexi&oacute;n con la base de datos.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Creamos nuestro primer dominio (estamos participando en el dominio m&aacute;s original con
                    <a href="http://www.techmyway.net" rel="nofollow">
                        www.techmyway.net
                    </a>
                    ).
Apŕendimos a utilizar desde PHP y HTML, hasta Github.
Pero lo que m&aacute;s nos enorgullece es nuestra idea, porque no hay algo similar hasta ahora.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Siempre hay que ponerse de acuerdo desde un inicio: tuvimos algunos problemas de organizaci&oacute;n y perdimos mucho tiempo. Como desconoc&iacute;amos c&oacute;mo trabajar con aplicaciones web, ir&oacute;nicamente no supimos por d&oacute;nde empezar. Nos llevamos la tarea de seguir aprendiendo diferentes tecnolog&iacute;as.
                </p>
                <h2>
                    What's next for techmyway
                </h2>
                <p>
                    Aunque dentro del Hack no tuvimos la oportunidad de crear algo m&aacute;s grande, estamos determinadas a llevar a cabo la idea. Esperamos pronto tener la aplicaci&oacute;n disponible.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css3">
                                css3
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://drive.google.com/open?id=1zUrIGD4QRpSAIwH60y_fEkTKw5fzN7TS" rel="nofollow" target="_blank" title="https://drive.google.com/open?id=1zUrIGD4QRpSAIwH60y_fEkTKw5fzN7TS">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                drive.google.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
