<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="266019" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/266/019/datas/original.jpg">
                            <img alt="Teknocar &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/266/019/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    TekCar  Business Model
                </p>
                <p>
                    Integrantes
Asesor de Negocios: Oscar Adri&aacute;n Ochoa Priego
Programador de m&oacute;dulo arduino GPS/GSM: Rodrigo Gonz&aacute;lez Tello
Dise&ntilde;o y diagrama electr&oacute;nico: Luis Eduardo Suarez Nava
Programador de modulo corta corriente y sensores RFID: Miguel &Aacute;ngel Rom&aacute;n Reveles
Conexi&oacute;n serial app-raspberry: Fabi&aacute;n Mauricio Duque Rojas
Programador de APP IOS &amp; Android: Juan Francisco Mart&iacute;nez Arzola
Programador de reconocimiento Facial: Miguel &Aacute;ngel Hern&aacute;ndez Venegas
Programador de reconocimiento Facial: Lucia Negrete Morales
Programador de Raspberry Pi 2: Naxhely Arlette Moreno Gonz&aacute;lez
                </p>
                <p>
                    Con el sistema de reconocimiento de rostros podemos validar la identidad de quien acceda a la unidad y hacer una comparaci&oacute;n a trav&eacute;s de la imagen guardada en la base de datos 
Con el m&oacute;dulo RFID se abarca un mercado m&aacute;s grande ya que hay m&aacute;s autos de este tipo y es con un simple validador que se adhiere como llavero al carro y su costo es muy accesible para todo el p&uacute;blico en general, generalmente es una soluci&oacute;n que abarca un gran mercado y previene del robo de nuestros veh&iacute;culos con un simple dispositivo integrado en todas sus partes 
Con el sistema GPS y GSM, el modulo rastreador env&iacute;a la informaci&oacute;n de la ubicaci&oacute;n Actual a trav&eacute;s de GPRS al servidor de Internet, para que el usuario acceda a la app con su usuario y la contrase&ntilde;a asignada a trav&eacute;s de cualquier dispositivo m&oacute;vil tanto IOS como Android
                </p>
                <p>
                    Usted puede visualizar su veh&iacute;culo personal, y activar la funci&oacute;n anti-secuestro.
FUNCIONES ESPECIALES
&bull; C&aacute;mara: Es para hacer el reconocimiento Facial 
&bull; Raspberry: hace la interfaz con el arduino y la c&aacute;mara para el reconocimiento de im&aacute;genes
&bull; Arduino Mega: realiza la funci&oacute;n de cortes de energ&iacute;a en el sistema automotriz
&bull; M&oacute;dulo GSM/GPS: Realiza la funci&oacute;n de geolocalizaci&oacute;n del veh&iacute;culo y recepci&oacute;n de SMS
&bull; Micr&oacute;fono: Escucha el interior del veh&iacute;culo. (opcional)
&bull; Altavoz: potente parlante que permitir&aacute; tener una comunicaci&oacute;n con el chofer del veh&iacute;culo siniestrado en caso de problemas. (opcional)
&bull; Bloqueo de motor (*): Con un simple mensaje de texto podr&aacute;s, cortar la corriente del veh&iacute;culo a distancia, impidiendo que se mueva por sus propios medios. 
&bull; Bater&iacute;a de respaldo con duraci&oacute;n de un m&aacute;ximo de 3 d&iacute;as
                </p>
                <p>
                    &iquest;Cu&aacute;l es su funci&oacute;n?
La funci&oacute;n del inmovilizador del veh&iacute;culo es, como su nombre bien indica, inmovilizar o bloquear el veh&iacute;culo para que &eacute;ste se detenga o no pueda ser arrancado en caso de robo. Es importante destacar que, por seguridad, el veh&iacute;culo nunca es bloqueado en plena marcha, puesto que esto pondr&iacute;a en peligro la vida de las personas. El mecanismo es mucho m&aacute;s sencillo y seguro: cuando se manda al localizador la orden de bloquear el veh&iacute;culo, &eacute;ste espera primero a que se quite el contacto del veh&iacute;culo (es decir, que est&eacute; parado) y cuando esto se produce, bloque el motor de arranque. De esta forma, una vez se ha quitado el contacto, no es posible volver a arrancar  el veh&iacute;culo. Tremendamente eficaz para que el veh&iacute;culo no se pueda llevar muy lejos ni al extranjero.
Descripci&oacute;n de la funci&oacute;n inmovilizador
La mayor&iacute;a de los localizadores alarma GPS suelen incorporar esta funcionalidad. Es importante destacar que para que esta funcionalidad pueda ser usada, es necesario instalar el inmovilizador conjuntamente con el localizador.
El inmovilizador es operado por una APP para bloquearlo y otro para desbloquearlo. Tambi&eacute;n existe la opci&oacute;n de bloqueo autom&aacute;tico en caso de que alguna alarma del localizador se active, en este caso es el usuario el que debe desbloquearlo posteriormente a trav&eacute;s de la APP.
Resumiendo existen dos opciones para bloquear el veh&iacute;culo:
&bull; Bloqueo mediante SMS por la APP (mandando una orden de corte de bater&iacute;a al arduino).
&bull; Bloqueo autom&aacute;tico a los 10 min  al detectarse que no es un rostro conocido y validar con el censor que hay en el carro
                </p>
                <p>
                    Casos de uso
La funci&oacute;n principal del localizador que es el bloqueo por el usuario funciona de manera similar a cuando se enciende o apaga una luz. Sin embargo la funci&oacute;n auto bloqueo debe ser activada previamente para que est&eacute; operativa.
&bull; El usuario es avisado por medio de la aplicaci&oacute;n ya que mandara notificaciones  de una alarma en su veh&iacute;culo y con los comandos adecuados detecta que es un robo. Autom&aacute;ticamente el usuario puede a trav&eacute;s de la APP para bloquear el veh&iacute;culo, este se detendr&aacute; cuando el veh&iacute;culo no est&eacute; en movimiento.
                </p>
                <p>
                    &bull; Si el  veh&iacute;culo est&aacute; estacionado y el auto bloqueo activado. En el hipot&eacute;tico caso que se acerque un ladr&oacute;n al veh&iacute;culo y se active alguna alarma, el localizador autom&aacute;ticamente bloquear&aacute; el veh&iacute;culo avisando al usuario a trav&eacute;s de las notificaciones de la APP. Por "bloquear" entendemos que no se podr&aacute; arrancar el motor.
La funci&oacute;n de auto bloqueo es muy eficaz, ya que si el ladr&oacute;n llevara un inhibidor GSM, tampoco podr&iacute;a robar el veh&iacute;culo puesto que &eacute;ste se auto bloquear&iacute;a y no podr&iacute;a ser puesto en marcha.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/arduino">
                                arduino
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/c">
                                c
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ios">
                                ios
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/netbeans">
                                netbeans
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/opencv">
                                opencv
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            rasberry-pi
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/raspberry-pi">
                                raspberry-pi
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            rfid
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
