<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="725333" data-title="H&uuml;tchenspiel: Welches ist echt? Eine Aufnahme aus der Testphase der AR L&ouml;sung." href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/333/datas/original.PNG">
                            <img alt="tempor&auml;res-halteverbot &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/333/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                H&uuml;tchenspiel: Welches ist echt? Eine Aufnahme aus der Testphase der AR L&ouml;sung.
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="725319" data-title='Der Sachbearbeitersicht: ein offener Antrag erg&auml;nzt um "Situation vor Ort"' href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/319/datas/original.png">
                            <img alt="tempor&auml;res-halteverbot &ndash; screenshot 2" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/319/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Der Sachbearbeitersicht: ein offener Antrag erg&auml;nzt um "Situation vor Ort"
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="725324" data-title="Ein B&uuml;rger beantragt ein Halteverbot durch Zeichnen einer Linie auf der Karte." href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/324/datas/original.PNG">
                            <img alt="tempor&auml;res-halteverbot &ndash; screenshot 3" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/324/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Ein B&uuml;rger beantragt ein Halteverbot durch Zeichnen einer Linie auf der Karte.
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="725322" data-title="Ein B&uuml;rger abonniert einen Bereich, um &uuml;ber neue Halteverbote informiert zu werden." href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/322/datas/original.jpeg">
                            <img alt="tempor&auml;res-halteverbot &ndash; screenshot 4" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/322/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Ein B&uuml;rger abonniert einen Bereich, um &uuml;ber neue Halteverbote informiert zu werden.
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="725314" data-title="AR in action! Der B&uuml;rger markiert den gew&uuml;nschten Bereich im 3 Dimensionalen Raum." href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/314/datas/original.jpeg">
                            <img alt="tempor&auml;res-halteverbot &ndash; screenshot 5" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/314/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                AR in action! Der B&uuml;rger markiert den gew&uuml;nschten Bereich im 3 Dimensionalen Raum.
                            </i>
                        </p>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="725323" data-title="Der B&uuml;rger hat eine &Uuml;bersicht &uuml;ber seine beantragen Halteverbote." href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/323/datas/original.jpeg">
                            <img alt="tempor&auml;res-halteverbot &ndash; screenshot 6" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/725/323/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Der B&uuml;rger hat eine &Uuml;bersicht &uuml;ber seine beantragen Halteverbote.
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Tempor&auml;re Halteverbote z.B. f&uuml;r einen Umzug oder eine Bauma&szlig;nahme sind eine praktische Sache. Leider sind die aktuellen Prozesse in vielen Kommunen bei diesem Thema hier noch nicht wirklich im digitalen Zeitalter angekommen. Papierformulare, handgezeichnete Skizzen, langwierige und unklare Vergabeprozesse - allein die Beantragung des Verbots bietet viel Potential f&uuml;r Verbesserung. Als Gro&szlig;stadtbewohner kennen wir aber auch die andere Seite der Medaille: Nach allgemeiner Rechtsauffassung muss ein tempor&auml;res Halteverbot 48-72 Stunden im Voraus angek&uuml;ndigt werden - nach zwei Wochen Urlaub kann das Auto also durchaus mal weg sein.
                </p>
                <p>
                    All das hat uns dazu inspiriert, das TzbP - Team zeitlich begrenztes Parkverbot zu gr&uuml;nden. Wir wollen uns damit besch&auml;ftigen, wie man tempor&auml;re Halteverbote f&uuml;r alle Beteiligten komfortabler gestalten kann.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Die TzbP Plattform beginnt ganz nah beim B&uuml;rger, n&auml;mlich auf seinem Smartphone. Die App unterst&uuml;tzt B&uuml;rger bei der Beantragung eines Halteverbotes. Der B&uuml;rger kann die Halteverbotszone bequem auf einer Karte ausw&auml;hlen oder per Augmented Reality einfach &uuml;ber die Kamera seines Smartphones festlegen. Zus&auml;tzlich ben&ouml;tigte Daten (z.B. Zeitraum, Begr&uuml;ndung f&uuml;r den Bedarf) werden ebenfalls online per Smartphone erfasst. Aber auch f&uuml;r B&uuml;rger die kein Halteverbot beantragen wollen, ist die App eine Hilfe - sie k&ouml;nnen die Abo Funktion nutzen. Interessierte B&uuml;rger k&ouml;nnen sich ein Abonnement f&uuml;r ihre Wohngegend einrichten und erfahren dann automatisch, wenn in der N&auml;he neue Halteverbote bevorstehen. Dies hilft z.B. bei der Urlaubsplanung.
                </p>
                <p>
                    Der n&auml;chste Schritt des Prozesses ist die Sichtung des Antrags durch einen Sachbearbeiter. Unsere Analyse hat ergeben, dass die Sachbearbeiter heutzutage nicht immer &uuml;ber die n&ouml;tigen Werkzeuge verf&uuml;gen, um die Auswirkungen eines Antrages zu beurteilen. Das TzbP Sachbearbeiter Portal stellt die Antrage &uuml;bersichtlich auf einer Karte da. Der Sachbearbeiter sieht so, ob in der N&auml;he im gleichen Zeitraum bereits Halteverbote genehmigt oder abgelehnt wurden und kann die Begr&uuml;ndungen hierf&uuml;r einsehen. Desweiteren wird der Sachbearbeiter direkt an seinem Schreibtisch &uuml;ber die "Situation vor Ort" informiert: Mittels der API von ParkAI werden ihm die durchschnittliche Parkplatzauslastung in der Umgebung des Antrags, typische Auslastungen im Tagesverlauf an den beantragten Tagen und Arten der zehn n&auml;chsten Parkm&ouml;glichkeiten (Parkh&auml;user, Parken an der Stra&szlig;e, kostenlos, kostenpflichtig..) angezeigt. Der Sachbearbeiter hat hierdurch nicht nur die M&ouml;glichkeit seine Erfahrung durch messbare Fakten zu unterst&uuml;tzen, sondern kann sogar Alternativvorschl&auml;ge (z.B. eine andere Tageszeit mit geringerer Auslastung) an den B&uuml;rger senden. In einer n&auml;chsten Ausbaustufe w&auml;re es denkbar, noch weitere OpenData Quellen (z.B. Veranstaltungskalender, Einwohnerdaten, ...) mit in das Sachbearbeiterportal zu integrieren.
                </p>
                <p>
                    Der ideale letzte Schritt des Prozesses ist die Genehmigung eines Antrags. &Uuml;ber die TzbP Plattform kann der B&uuml;rger das Ergebnis komfortabel innerhalb der App nachvollziehen. Nutzer mit einem Abonnement f&uuml;r die entsprechende Gegend werden auf ihrem Handy benachrichtigt und k&ouml;nnen sich so bereits vor Aufstellung der Schilder vorbereiten. Auch hier sind bereits weitere Ausbaustufen angedacht: Die Abo Funktion k&ouml;nnte per Open Data API f&uuml;r Dritte zug&auml;nglich gemacht werden, so k&ouml;nnten z.B. car-sharing Unternehmen automatisch benachrichtigt werden, wenn eines ihrer Fahrzeuge in einem zuk&uuml;nftigen Halteverbot steht.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Das TbzP Portal basiert auf einem zentralen Backend, in dem alle Antr&auml;ge gespeichert werden. Auch die Abos der B&uuml;rger und die Benachrichtigen Funktion werden im Backend abgebildet. Das Backend ist in Kotlin programmiert.
Die B&uuml;rger App ist im Rahmen des Hackathons f&uuml;r iOS mit Swift entwickelt wurden. Die AR Funktion basiert auf Apple ARKit.
Das Sachbearbeiter Frontend basiert auf HTML und Javascript (webpack), nennenswert ist hier vor allem die Einbindung der AIParking API und der Google Maps API. Chart.js wird verwendet um interaktive Diagramme einzublenden.
                </p>
                <h2>
                    Welche City Challenges / API Partners haben wir bearbeitet?
                </h2>
                <p>
                    Unsere L&ouml;sung ist anwendbar auf die ITDZ Terminbuchung Challenge und die Landeshauptstadt M&uuml;nchen Innovative mobile B&uuml;rgerservices Challenge. In Berlin wartet man aktuell ca. 4 Wochen auf die Genehmigung eines tempor&auml;ren Halteverbotes - diese Zeit k&ouml;nnte mit unserer L&ouml;sung verk&uuml;rzt werden. In M&uuml;nchen gibt es bereits einen Online Antrag f&uuml;r das Halteverbot. Wenn die dort erhobenen Daten &uuml;ber eine Schnittstelle verf&uuml;gbar gemacht werden, k&ouml;nnen diese Daten f&uuml;r den Abo Teil unserer App verwendet werden.
                </p>
                <p>
                    Als API Partner haben wir uns f&uuml;r AIPark entschieden. Die dort verf&uuml;gbar gemachten Daten passen genau zu unserem Anwendungszweck.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Uns war es wichtig, eine L&ouml;sung zu pr&auml;sentieren, die zumindest Proof-of-Concept-artig alle Prozessschritte einmal abbildet - das bedeutet ein funktionierendes Backend, ein Web-Frontend und eine mobile App. Durch unser relativ kleines Team (2 Personen), hat sich dies als herausfordernd dargestellt. Schlussendlich konnten wir es nur durch eine Nachtschicht schaffen :-)
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    AR! Wir freuen uns, dass wir neben dem "Standardprozess" auch noch ein innovatives Add-On implementieren konnten.
                </p>
                <h2>
                    What's next for tempor&auml;res-halteverbot
                </h2>
                <p>
                    Wir sind bereit! Einer Integration in bestehende Kommunen Apps steht nichts im Wege, auch ein Release als Stand-Alone L&ouml;sung w&auml;re denkbar.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag">
                            arkit
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/geojson">
                                geojson
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ios">
                                ios
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            kotlin
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/swift">
                                swift
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            webpack
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://187747ad.ngrok.io/dist/" rel="nofollow" target="_blank" title="https://187747ad.ngrok.io/dist/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                187747ad.ngrok.io
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://github.com/TZP-Smartcountry" rel="nofollow" target="_blank" title="https://github.com/TZP-Smartcountry">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
