<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="434267" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/434/267/datas/original.jpg">
                            <img alt="Termo-higr&oacute;metro diferencial &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/434/267/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Existen en el mercado actual algunos productos para sensar humedad y controlar el sistema de riego en diferentes sistemas de producci&oacute;n agr&iacute;colas pero con el inconveniente de un alto costo y una disponibilidad insuficiente en el mercado nacional. Nuestra propuesta es un dispositivo encargado de la medici&oacute;n y almacenamiento de informaci&oacute;n relevante para el control de los sistemas de irrigaci&oacute;n agr&iacute;colas con una gran adaptabilidad a los requerimientos del cliente ya que es un sistema modular f&aacute;cilmente escalable para la medici&oacute;n de otras cantidades f&iacute;sicas importantes para el cliente. Adem&aacute;s se tiene la posibilidad de construir bases de datos de las mediciones obtenidas y almacenadas con el dispositivo, mediante la red con una interfaz propia gestionada en linea.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Mediante sensores basados en semiconductor se obtienen mediciones peri&oacute;dicas y confiables de temperatura y humedad (entre otras). En base a la informaci&oacute;n obtenida, el dispositivo puede controlar sistemas de irrigaci&oacute;n o extracci&oacute;n para mantener un equilibrio en las condiciones del cultivo y evitar as&iacute; la proliferaci&oacute;n de hongos o bacterias.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    Para la construcci&oacute;n del dispositivo se emple&oacute; una tarjeta de desarrollo "arduino uno" para desarrollo r&aacute;pido. Ademas los sensores y circuitos adicionales para el uso de la pantalla se montaron en un proto-board para obtener un primer prototipo de la idea en cuesti&oacute;n.
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    Uno de los primeros retos fue el control y sincronizaci&oacute;n de los sistemas de medici&oacute;n y almacenamiento usados en el dispositivo. Otro reto importante fue el desarrollo de las interfaces para la gesti&oacute;n de las bases de datos generadas con el hardware prototipo.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    El primer logro es que logramos en un tiempo corto un prototipo funcional y bien depurado. Adem&aacute;s se logr&oacute; terminar  la interfaz de gesti&oacute;n basada en html5 y php.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Aprendimos a comunicarnos con personas de otras &aacute;reas de la ciencia y tecnolog&iacute;a y obtener un bien com&uacute;n reflejado en un prototipo con diversas aplicaciones. Tambi&eacute;n aprendimos a trabajar bajo presi&oacute;n en un tiempo bastante reducido cumpliendo los objetivos iniciales del proyecto.
                </p>
                <h2>
                    What's next for Termo-higr&oacute;metro diferencial
                </h2>
                <p>
                    Ya que se tiene el primer prototipo de la idea, el siguiente paso es la implementaci&oacute;n de un prototipo de prueba para su uso en el campo. Para ello se pueden utilizar diferentes materiales para fabricar un chasis resistente a la intemperie y condiciones extremas de  temperaturay humedad. Adem&aacute;s es posible con este primer prototipo el estudio de viabilidad del uso de la comunicaci&oacute;n inal&aacute;mbrica en el campo. As&iacute; como estudiar otra de sus posibles aplicaciones tales como el control de proceso de curtido de pieles que es una de las principales actividades econ&oacute;micas de Le&oacute;n Guanajuato.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/arduino">
                                arduino
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/c">
                                c
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/mysql">
                                mysql
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
