<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Les parents laissent les enfants avec leurs tablettes et leurs jeux pour &ecirc;tre tranquilles et ces derniers sont absorb&eacute;s par leurs &eacute;crans et ratent toutes les exp&eacute;riences de la vie quotidienne dans leur environnement et avec leurs familles, d'une part.L&agrave; est l'aspect n&eacute;gatif que l'on veut r&eacute;soudre. L'aspect positif que l'on veut exploiter c'est que les enfants sont plus dispos&eacute;s que les adultes &agrave; acqu&eacute;rir des habitudes.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    L'application permet d'ouvrir deux types de sessions : parents et enfants.
Les parents s'inscrivent et enregistrent la liste de leurs enfants. Pour chaque enfant ils ouvrent une session d&eacute;crite par une r&eacute;compense de fin de session (discut&eacute;e entre le parent et l'enfant) et un nombre de points que l'enfant doit cumuler pendant une certaine dur&eacute;e pour l'atteindre. Ainsi qu'une liste d'habitudes qu'ils veulent que son enfant apprenne.
En entrant dans la session d'un enfant ,le parent peut lancer un challenge &agrave; son enfant en utilisant un smart device ou bien lister les habitudes (ranger sa chambre , d&eacute;barrasser son assiette, arroser les plantes de son jardins &hellip;etc.) et le progr&egrave;s de l'enfant les parents veillent eux m&ecirc;me sur le processus de validation des taches et des challenges, le point le plus captivant de cette id&eacute;e est le fait d&rsquo;avoir un syst&egrave;me de bonus sur lequel on peut avoir des rajouts si l&rsquo;enfant accomplie le challenge et des malus si l&rsquo;enfant ne l&rsquo;accomplie pas.
                </p>
                <p>
                    La session par d&eacute;faut de l&rsquo;application est la session de l&rsquo;enfant, afin que le parent acc&egrave;de &agrave; sa session il doit s&rsquo;authentifier.
                </p>
                <p>
                    La premi&egrave;re page qui s&rsquo;affiche est une page &agrave; deux boutons :
                </p>
                <ul>
                    <li>
                        un bouton pour afficher et &eacute;valuer le progr&egrave;s des habitudes de l&rsquo;enfant : elle se pr&eacute;sente sous forme d&rsquo;une liste qui s&rsquo;affiche dans une fen&ecirc;tre popup ou chaque habitudes a un checkBox.
                    </li>
                </ul>
                <p>
                    -un  deuxi&egrave;me bouton  pour lancer un challenge &agrave; l&rsquo;enfant qui aura un bonus si le challenge est effectu&eacute; au temps voulu, et un malus dans le cas contraire.
                </p>
                <h2>
                    How we built it
                </h2>
                <h2>
                    Challenges we ran into
                </h2>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <h2>
                    What we learned
                </h2>
                <h2>
                    What's next for TiflUp
                </h2>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/bootstrap">
                                bootstrap
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/css">
                                css
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html">
                                html
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
