<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="638493" data-title="Maps" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/638/493/datas/original.png">
                            <img alt="Tourismap &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/638/493/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                Maps
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Ce projet est &agrave; l&rsquo;intention des touristes. Nous sommes all&eacute;s chercher des inspirations &agrave; partir de deux applications majeures dans leur domaine: SoundCloud et Pokemon Go.
                </p>
                <p>
                    L'objectif est de r&eacute;aliser un site web divis&eacute; en deux parties, tout d'abord une discussion sous forme de questions/ r&eacute;ponses entre un chatbot et l'utilisateur pour avoir une id&eacute;e sur les go&ucirc;ts de l'utilisateur afin de mieux r&eacute;pondre &agrave; ses besoins en mati&egrave;re de lieux &agrave; visiter (un peu comme pour l'application SoundClound).
Une fois que l'utilisateur a r&eacute;pondu aux questions, nous lui mettrons &agrave; sa disposition une map par rapport &agrave; sa position qui lui montrera les points d'int&eacute;r&ecirc;ts touristiques principaux en rapport avec ses besoins (d&eacute;duits &agrave; partir des r&eacute;ponses qu'il aurait donn&eacute; au bot pr&eacute;c&eacute;demment).
                </p>
                <p>
                    Nous avons choisi d'afficher les points d'int&eacute;r&ecirc;ts pour les sites touristiques suivants: 
Les parcs / Architectures / Restaurants / Mus&eacute;es.
L'utilisateur pourra tr&egrave;s bien par la suite ajouter certains types de points suppl&eacute;mentaires si ce que nous lui proposons ne lui convient pas.
                </p>
                <p>
                    Si les points mis &agrave; sa disposition lui conviennent, l'utilisateur pourrait cr&eacute;er ses propres itin&eacute;raires mais nous lui fournirons les itin&eacute;raires conseill&eacute;s en rapport avec ces centres d'int&eacute;r&ecirc;t (les itin&eacute;raires favoris des autres utilisateurs ayant le m&ecirc;me profil).
Ces "itin&eacute;raires conseill&eacute;s" s'auto-adapteront aux conditions actuelles de la ville comme les bouchons, &eacute;v&eacute;nements sportifs, m&eacute;t&eacute;o, gr&egrave;ves...
Si dans la ville le service est disponible, l'utilisateur pourrait aussi acheter directement ses tickets en ligne pour les moyens de transport qu'il comptera utiliser.
                </p>
                <p>
                    Les technologies utilis&eacute;es sont : Python Flask, l'api Google Maps et IBM Watson Assistant pour le chat bot et IBM Watson Studio pour le syst&egrave;me de suggestions.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/flask">
                                flask
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/google-maps">
                                google-maps
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ibm-watson">
                                ibm-watson
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
