<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Cecilia Moncada es una Abogada que gracias a ejecutivo ha encontrado una nueva manera de generar ingresos, c&oacute;moda y segura. Ella no quiere ser la &uacute;nica beneficiada de la tecnolog&iacute;a y su nuevo trabajo, tambi&eacute;n quiere crear una empresa de taxistas mujeres que sean capaces de ganar dinero con un trabajo digno. Su mayor reto y dificultad es crear una aplicaci&oacute;n propia, ya que considera que su mejor beneficio al usar usar la aplicaci&oacute;n ejecutivo es la seguridad.
                </p>
                <p>
                    As&iacute; tenemos la tecnolog&iacute;a como impulsor y generador de empleos para los ciudadanos, resolviendo el problema del transporte en la regi&oacute;n y d&aacute;ndole un empleo m&aacute;s sistematizado a los taxistas.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Haciendo uso de la econom&iacute;a compartida, permite a los ciudadanos brindar un servicio de transporte digno y de calidad; y a los taxistas acortar la brecha de innovaci&oacute;n y permitirles hacer su trabajo de una manera m&aacute;s eficiente y seguro.
                </p>
                <h2>
                    How we built it
                </h2>
                <p>
                    React Native + firebase
                </p>
                <h2>
                    Challenges we ran into
                </h2>
                <p>
                    La capacitaci&oacute;n continua de los taxistas son la brecha m&aacute;s costosa, pero la que genera m&aacute;s beneficios.
                </p>
                <h2>
                    Accomplishments that we're proud of
                </h2>
                <p>
                    Ser capaces de crear una aplicaci&oacute;n con altos est&aacute;ndares de ingenier&iacute;a que sea capaz de cumplir con nuestro objetivo.
                </p>
                <h2>
                    What we learned
                </h2>
                <p>
                    Entre tecnolog&iacute;as, trabajo en equipo, estrategias innovaci&oacute;n y marketing, entre otros.
                </p>
                <h2>
                    What's next for Transportame
                </h2>
                <p>
                    Hagamos mejor ingenier&iacute;a, hag&aacute;moslo escalable y ech&eacute;moslo a rodar.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/firebase">
                                firebase
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/react-native">
                                react-native
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/transportame/user-app" rel="nofollow" target="_blank" title="https://github.com/transportame/user-app">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
