<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    L'id&eacute;e
                </h2>
                <p>
                    La population de la grande r&eacute;gion de Qu&eacute;bec fait face &agrave; un probl&egrave;me de congestionnement des acc&egrave;s routier aux centres urbains. Devant ce probl&egrave;me, diff&eacute;rentes pistes de solutions ont &eacute;t&eacute; &eacute;tudi&eacute;es et envisag&eacute;es, dont celle du troisi&egrave;me lien. L'analyse d'experts d&eacute;montre cependant qu'un troisi&egrave;me lien entre L&eacute;vis et Qu&eacute;bec ne ferait que d&eacute;placer le probl&egrave;me de congestion.
                </p>
                <p>
                    Notre &eacute;quipe est d'avis qu'il faut r&eacute;gler le probl&egrave;me &agrave; la source, et diminuer le nombre de voiture sur le r&eacute;seau routier.
                </p>
                <p>
                    Pour se faire, nous proposons Trili, une solution innovante qui facilite l'organisation de covoiturage pour les d&eacute;placements quotidiens.
                </p>
                <h2>
                    Le concept
                </h2>
                <p>
                    Trili offre aux automobilistes une solution simple pour remplir les si&egrave;ges vides de leur voiture. Gr&acirc;ce aux donn&eacute;es publiques de la Ville de Qu&eacute;bec et &agrave; l'intelligence artificielle, l'application d&eacute;termine un point de rencontre id&eacute;al entre le conducteur et le passager.
                </p>
                <p>
                    Un point de rencontre id&eacute;al, c'est un point de rencontre public (lieu public ou arr&ecirc;t de bus) situ&eacute; &agrave; proximit&eacute; du passager, et qui &eacute;vite au conducteur d'avoir &agrave; faire un d&eacute;tour.
                </p>
                <h2>
                    Les technos
                </h2>
                <p>
                    RestAPI
React
PHP
Sass
Python
                </p>
                <h2>
                    Notre fiert&eacute;
                </h2>
                <p>
                    &Agrave; l'issue du HackQc, bien que nous ne soyons pas en mesure de pr&eacute;senter le prototype fonctionnel requis pour la qualification, nous sommes convaincu du potentiel de notre projet. Tous les morceaux y &eacute;taient : exp&eacute;rience utilisateur simple, fonctionnalit&eacute;s &agrave; valeur ajout&eacute;e, potentiel d'optimisation par des algorithme d'apprentissage profond, potentiel de d&eacute;ploiement sur plusieurs villes. Bref, au-del&agrave; du prototype fonctionnel, nous sommes fier du concept Trili, qui propose plus qu'une application, mais un v&eacute;ritable projet de soci&eacute;t&eacute;.
                </p>
                <h2>
                    Nos apprentissages
                </h2>
                <p>
                    Nous avons r&eacute;alis&eacute; l'importance de la communication et de la vision d'ensemble dans une &eacute;quipe. Dans un projet aux d&eacute;lais aussi serr&eacute;s, il est important que toute l'&eacute;quipe travaille dans la m&ecirc;me direction.
                </p>
                <h2>
                    La suite
                </h2>
                <p>
                    Pour Trili, il est certain que le projet ne s'arr&ecirc;tera pas au HackQc ! &Agrave; court terme, nous souhaitons r&eacute;aliser une premi&egrave;re version fonctionnelle de l'application afin de la tester sur un march&eacute; restreint. Nous esp&eacute;rons attirer l'attention de la Ville de Qu&eacute;bec, ou autres organismes d'influence, qui pourront nous apporter leur support dans la mise en place d'un tel projet.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/html5">
                                html5
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/python">
                                python
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/sass">
                                sass
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/trili-org" rel="nofollow" target="_blank" title="https://github.com/trili-org">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://www.figma.com/proto/SJglWEpyscuVzbveWWpDv5T4/HackQc?node-id=38%3A102&amp;scaling=scale-down" rel="nofollow" target="_blank" title="https://www.figma.com/proto/SJglWEpyscuVzbveWWpDv5T4/HackQc?node-id=38%3A102&amp;scaling=scale-down">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                www.figma.com
                            </span>
                        </a>
                    </li>
                    <li>
                        <a href="https://paper.dropbox.com/doc/Trili-Document-de-travail--AZAtS0uvRq3EQHggstXG5W~nAQ-IqmBYUhGF6ilTkoEMoOuU" rel="nofollow" target="_blank" title="https://paper.dropbox.com/doc/Trili-Document-de-travail--AZAtS0uvRq3EQHggstXG5W~nAQ-IqmBYUhGF6ilTkoEMoOuU">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                paper.dropbox.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
