<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="705512" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/705/512/datas/original.png">
                            <img alt="TryOuts &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/705/512/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    TryOuts
                </p>
                <ul>
                    <li>
                        Din karriere
                    </li>
                </ul>
                <p>
                    Et prosjekt av Rada Labs AS
Vi er Rada Labs, en oppstartsbedrift som er p&aring; vei opp i verden. Tre av v&aring;re ansatte var tilstede p&aring; Hack4NO i fjor med v&aring;rt hjertebarn Joober (dav&aelig;rende Jobeer) og kom til finalen med appid&eacute;en. N&aring; er vi tilbake med v&aring;rt nye prosjekt, TryOuts.
TryOuts er en tjeneste som skal la folk pr&oslash;ve seg ute i jobb hos en bedrift. Id&eacute;en er basert p&aring; det Amerikanske begrepet som g&aring;r ut p&aring; at idrettslag og lignende grupper holder &ldquo;tryouts&rdquo; der potensielle medlemmer kommer inn en dag og viser hva de kan. Vi &oslash;nsker med TryOuts &aring; revolusjonere m&aring;ten folk kommer seg ut i arbeidslivet p&aring;, ved &aring; introdusere arbeidstakere og arbeidsgivere for hverandre p&aring; en plattform som oppfordrer folk til &aring; pr&oslash;ve.
                </p>
                <p>
                    I TryOuts fokuserer vi arbeidet p&aring; f&oslash;lgende problemstillinger.
                </p>
                <ol>
                    <li>
                        Flere unge er usikre p&aring; sitt fremtidige karrierevalg
                    </li>
                    <li>
                        Flere blir uf&oslash;retrygdet og er usikker p&aring; jobbmuligheter
                    </li>
                    <li>
                        Det g&aring;r ikke an &aring; pr&oslash;ve en jobb f&oslash;r du blir ansatt
                    </li>
                    <li>
                        Behov for IA-tilpassing
                    </li>
                </ol>
                <h2>
                    What it does
                </h2>
                <p>
                    Vi skal gj&oslash;re arbeidstrening og praksis kult.
                </p>
                <p>
                    TryOuts er en web-basert plattform der bedrifter kan laste opp s&aring;kalte &laquo;TryOuts&raquo; som du som privatperson kan s&oslash;ke p&aring;.
En TryOut er en jobb som du kan pr&oslash;ve. Hvor lenge du er p&aring; en TryOut varierer, men som regel mellom 1 dag til en uke. Bruker du TryOuts med arbeidstrening gjennom NAV kan en TryOut vare i m&aring;neder.
                </p>
                <p>
                    TryOuts er en plattform for deg som:
                </p>
                <ol>
                    <li>
                        Er VGS-elev eller student som s&oslash;ker praksisplass.
                    </li>
                    <li>
                        Har behov for arbeidstrening.
                        <br>
                    </li>
                    <li>
                        &Oslash;nsker en helt ny karriere.
                    </li>
                    <li>
                        Trenger referanser og et nettverk.
                    </li>
                    <li>
                        Har behov for tilpassing mot IA (Inkluderende arbeidsliv).
                    </li>
                    <li>
                        Er uf&oslash;retrygdet og &oslash;nsker &aring; se hvilken jobb som fungerer for deg.
                    </li>
                </ol>
                <p>
                    Marked:
9,8% av Norges befolkning er uf&oslash;retrygd. Det er om lag 332 100 personer og dette har &oslash;kt med 3,2% siden forrige &aring;r. Mange av disse menneskene &oslash;nsker &aring; jobbe. TryOuts &oslash;nsker &aring; gi disse en mulighet til &aring; kunne teste hvilken jobb som fungerer ut fra personens vansker.
Hentet fra artikkelen &laquo;40.000 unge faller helt utenfor samfunnet&raquo; Publisert 8. des. 2014 kl. 06:10 - NRK
&laquo;I alderen 18 til 30 &aring;r finnes det 40.000 som Assad. Unge som verken studerer, f&aring;r hjelp fra Nav eller som har registrert inntekt. De overlever enten ved &aring; f&aring; penger hjemmefra eller via svart arbeid eller annen kriminalitet.&raquo;
I f&oslash;lge artikkelen kan vi se at det ogs&aring; finnes et stort marked hos unge.
                </p>
                <p>
                    I f&oslash;lge en unders&oslash;kelse av SSB i 2009 ser vi at dr&oslash;yt en av fire sysselsatte har planer om &aring; bytte jobb eller starte ny virksomhet i l&oslash;pet av de n&aelig;rmeste tre &aring;rene. Disse planene varierer med hvor godt den enkelte trives i n&aring;v&aelig;rende jobb.
                </p>
                <p>
                    Unders&oslash;kelsene viser et stort behov for en plattform som TryOuts.
                </p>
                <p>
                    Pengestr&oslash;m:
Annonseinntekter fra bedrifter som laster opp en s&aring;kalt TryOut
                </p>
                <p>
                    Hospiteringsbransjen er positive. Vi har v&aelig;rt i kontakt med et selskap som &oslash;nsker en samarbeidsavtale ved lansering.
                </p>
                <p>
                    NAV er veldig positive til plattformen. Vi vil ta et m&oslash;te med NAV om framtide samarbeid, eventuelt en lisensavtale til &aring; kunne bruke plattformen til arbeidstrening.
                </p>
                <p>
                    Vi kommer eventuelt til &aring; ha reklame p&aring; plattformen.
                </p>
                <p>
                    St&oslash;rste kostnader:
Utvikling, jurist, markedsf&oslash;ring
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Vi tok utgangspunkt I &aring; levere en nettside som bruker .NET framework og asp.NET. V&aring;r webserver kj&oslash;rer i skyen og vi bruker Azure fra Microsoft.
Webapplikasjonen lagrer bruker og bedriftsdata i Azure og vi kj&oslash;rer her Micrsoft SQL.
Vi henter v&aring;r info om bedriftene via Brreg sitt API for enhetsregister.
Fra dette API hentes adresseinfo om bedriftene som registrer seg, disse dataene matches opp mot HERE sitt JavaScript API og da spesifikk Geocoding som l&oslash;ser adresse til kartkoordinater som kan brukes b&aring;de til Kartverket sin leaflet-integrasjon og ogs&aring; HERE sine tjenester.
Vi bruker ogs&aring; flere andre data hentet fra Brreg sitt API
Prosjektet tar i bruk data fra NAV da spesielt trender innenfor arbeidsmarkedet.
V&aring;r applikasjon vil kj&oslash;re serverless code og bruke Azure functions
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    N&aring;r vi skulle sl&aring; sammen koden p&aring; 3 ulike prosjekt.
                </p>
                <p>
                    Mye research om APIer og frontend-koding da tiden har v&aelig;rt kort.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Teamarbeidet!
                </p>
                <p>
                    Frontend og design
                </p>
                <p>
                    Den store interessen for prosjektet fra NAV sin side samt fra en bedrift innenfor hospiteringsbransjen.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Keep it simple!
                </p>
                <p>
                    Det er viktig &aring; snakke sammen.
                </p>
                <h2>
                    What's next for TryOuts
                </h2>
                <p>
                    Videreutvikling av plattform, prate med jurist om lovverk rundt det &aring; teste en jobb, beta-testing p&aring; USN Campus Vestfold, markedsf&oslash;ring og lansering.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/net">
                                .net
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/azure">
                                azure
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            boot
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            brreg-api
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/c--2">
                                c#
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            kartverket-data
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag">
                            nav-api
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://tryouts.azurewebsites.net/" rel="nofollow" target="_blank" title="https://tryouts.azurewebsites.net/">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                tryouts.azurewebsites.net
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
