<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Cada uno de los miembros de Tulup es distinto y tiene sus motivos personales, sin embargo coincidimos en algo, todos mejoramos d&iacute;a a d&iacute;a y eso significa a la vez mejorar el entorno donde vivimos.
                </p>
                <p>
                    Sabemos que la alimentaci&oacute;n es una parte fundamental de la salud y esta es una parte importante de la vida, por eso queremos llevar nuestro proyecto a todas las personas para que mejoren su salud, con lo que a la vez mejoraran su calidad de vida.
                </p>
                <p>
                    En Tulup somos una empresa cuyo objetivo es  incentivar y asesorar a las personas para que aprendan a realizar sus propios hidrocultivos ya sea para consumo propio y/o para volverse productores locales.  Consiguiendo darles un grado de autonom&iacute;a y un mayor control sobre la calidad de alimentos que consumen.
                </p>
                <p>
                    Contamos con una plataforma en la que mostramos talleres y cursos sobre hidrocultivos gratuitos, si el cliente as&iacute; lo desea le podemos dar asesor&iacute;a personalizada v&iacute;a online en la que lo asistiremos paso a paso para que obtenga todas las habilidades necesarias para crear un hidrocultivo.
                </p>
                <p>
                    A la vez crearemos conexiones en las que productores locales ya establecidos puedan ofrecer sus productos  y a la vez aconsejar a  los productores nuevos.
                </p>
                <p>
                    Uno de los principales desaf&iacute;os fue el crear una plataforma que captar&aacute; r&aacute;pidamente la atenci&oacute;n del cliente en pocos segundos y este pueda darse cuenta de las maravillas de los hidrocultivos.
                </p>
                <p>
                    Uno de los m&aacute;s logros m&aacute;s grandes por el que nos sentimos orgullosos es el aprendizaje que hemos obtenido a lo largo de este camino, porque al final sabemos que el &uacute;nico fracaso que existe es el no aprender de tu fracaso, ya que cuando tienes pasi&oacute;n por algo y te enfocas en mejorar tus habilidades la pregunta ya no es si tendr&aacute;s &eacute;xito o no, sino cuando.
                </p>
                <p>
                    Todos hemos aprendido diversas habilidades desde programaci&oacute;n, uso de photoshop hasta lograr hacer la validaci&oacute;n de tu producto, pero creemos que lo m&aacute;s importante de este aprendizaje es ir a campo y probar si tu idea funciona, al final de todo la acci&oacute;n supera  a la perfecci&oacute;n
Lo que viene despu&eacute;s, es ir a comunidades ind&iacute;genas e implementar nuestro modelo de negocio
                </p>
                <p>
                    Los datos y el proyecto con mayor detalle se puede encontrar en :
                </p>
                <p>
                    <a href="https://docs.google.com/document/d/1rxKDnqVBbvGhfMLNKvG1ifl4foskH8U0xIJeRkdtg4k/edit?usp=sharing" rel="nofollow">
                        https://docs.google.com/document/d/1rxKDnqVBbvGhfMLNKvG1ifl4foskH8U0xIJeRkdtg4k/edit?usp=sharing
                    </a>
                </p>
                <p>
                    <a href="http://prezi.com/boecyuqkiblq/?utm_campaign=share&amp;utm_medium=copy&amp;rc=ex0share" rel="nofollow">
                        http://prezi.com/boecyuqkiblq/?utm_campaign=share&amp;utm_medium=copy&amp;rc=ex0share
                    </a>
                </p>
                <h1>
                    Tulupeate
                </h1>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/javascript">
                                javascript
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/Hackamano2016/tulup.git" rel="nofollow" target="_blank" title="https://github.com/Hackamano2016/tulup.git">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
