<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    Partimos de la idea que al viajar a diferentes ciudades, muchas veces no se conoce cu&aacute;les son los sitios de inter&eacute;s que hay que conocer.
                </p>
                <h2>
                    What it does
                </h2>
                <p>
                    Al entrar en la aplicaci&oacute;n detecta tu ubicaci&oacute;n y muestra cu&aacute;les son algunas de las ciudades interesantes para visitar m&aacute;s cerca de ti, as&iacute; mismo puedes escoger manualmente tu ciudad de inter&eacute;s.
                </p>
                <h2>
                    How I built it
                </h2>
                <p>
                    Utilizamos Android Studio, Java, php, xml, y json para construir la aplicaci&oacute;n, adem&aacute;s utilizamos photoshop para toda la parte visual, as&iacute; como el logo y los iconos de la aplicaci&oacute;n.
                </p>
                <h2>
                    Challenges I ran into
                </h2>
                <p>
                    Uno de los retos m&aacute;s grandes a los que nos enfrentamos fue que algunos de los miembros del equipo no sab&iacute;an utilizar la plataforma que est&aacute;bamos utilizando.
                </p>
                <h2>
                    Accomplishments that I'm proud of
                </h2>
                <p>
                    Podemos estar orgullosos de que a pesar de que muchas veces no logr&aacute;bamos hacer lo que quer&iacute;amos, pero seguimos intentando y encontramos diferentes maneras de hacerlo.
                </p>
                <h2>
                    What I learned
                </h2>
                <p>
                    Aprendimos a trabajar bien como equipo, a tener una buena comunicaci&oacute;n, y a desarrollar cosas nuevas.
                </p>
                <h2>
                    What's next for TuriTown
                </h2>
                <p>
                    Lo que nos gustar&iacute;a lograr para nuestra aplicaci&oacute;n es agregar m&aacute;s ciudades, as&iacute; como m&aacute;s informaci&oacute;n acerca de los sitios de inter&eacute;s y agregar tambi&eacute;n m&aacute;s ciudades. Tambi&eacute;n nos gustar&iacute;a seguir desarroll&aacute;ndola y agregar funcionalidades para as&iacute; poder publicarla dentro de la PlayStore.
                </p>
                <h2>
                    Built With
                </h2>
                <p>
                    java
android-studio
xml
php
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/java">
                                java
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/php">
                                php
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/xml">
                                xml
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://www.breakingjava.com/TuriTown2.zip" rel="nofollow" target="_blank" title="http://www.breakingjava.com/TuriTown2.zip">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                www.breakingjava.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
