<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <h2>
                    Inspiration
                </h2>
                <p>
                    L'inspiration pour cette application vient du 375e anniversaire de Montr&eacute;al. Cet &eacute;v&eacute;nement a apporter beaucoup d'attention sur la ville, et ainsi beaucoup de touristes. C'est en pensant &agrave; cela que nous avons eu l'id&eacute;e de faire une application permettant d'utiliser les nouvelles technologies afin de d&eacute;tecter les monuments importants et en proposer d'autres.
                </p>
                <h2>
                    But du projet
                </h2>
                <p>
                    Vision Tourisme permet &agrave; n'importe qui de photographier un monument devant lequel il se trouve, et de re&ccedil;evoir instantan&eacute;ment de l'information sur celui-ci. De plus, cette application Android permet de d&eacute;tecter d'autres monuments populaires &agrave; proximit&eacute;! Ceci est rendu possible gr&acirc;ce au Machine Learning qui nous permet de d&eacute;terminer le monument re&ccedil;u par la capture prise avec un t&eacute;l&eacute;phone intelligent.
                </p>
                <h2>
                    Comment l'avons nous d&eacute;velopp&eacute;?
                </h2>
                <p>
                    Cette application a &eacute;t&eacute; con&ccedil;ue avec Xamarin.Android (C# et .AXML). Machine Learning.
                </p>
                <h2>
                    Probl&egrave;mes rencontr&eacute;s
                </h2>
                <p>
                    Nous avons eu quelques probl&egrave;mes particuli&egrave;rement au niveau de l'interface utilisateur. &Eacute;tant une nouvelle technologie nous avons tent&eacute; de faire des prouesses qui finalement semblaient non-r&eacute;alisables, du moins par des novices de cette technologie dans un intervalle de 24 heures.
                </p>
                <h2>
                    Accomplissements dont nous sommes fiers
                </h2>
                <p>
                    L'impl&eacute;mentation d'une reconnaissance de monuments par machine learning.
                </p>
                <h2>
                    Ce que nous avons appris
                </h2>
                <p>
                    Nous avons tous appris comment fonctionne Xamarin.Android, consid&eacute;rant qu'aucun des membres de l'&eacute;quipe avait de l'exp&eacute;rience avec cette technologie. De plus, nous avons r&eacute;alis&eacute; qu'il est important de se concentrer sur une seule fonctionnalit&eacute; lors du d&eacute;veloppement d'une application lors d'un &eacute;v&eacute;nement de 24 heures.
                </p>
                <h2>
                    Projets futurs pour Vision Tourisme
                </h2>
                <p>
                    L'application serait en mesure de recevoir de nouvelles fonctionnalit&eacute;s qui pourrait s'av&eacute;rer int&eacute;ressante, la premi&egrave;re &eacute;tant par exemple une sorte de Scavenger Hunt dans la ville de Montr&eacute;al, proposant aux touristes des itin&eacute;raires relatifs &agrave; certains monuments afin qu'ils d&eacute;couvrent la ville tout en cherchant certaines attractions particuli&egrave;res.
De plus, nous nous sommes concentr&eacute;s sur l'impl&eacute;mentation de monuments connus autour de nous (donc &agrave; Montr&eacute;al), mais il serait int&eacute;ressant d'&eacute;tendre cette superficie afin de toucher grandes villes autant que petits villages.
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android">
                                android
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/c--2">
                                c#
                            </a>
                        </span>
                    </li>
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/xamarin">
                                xamarin
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/frankilepro/Hackatown" rel="nofollow" target="_blank" title="https://github.com/frankilepro/Hackatown">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
