<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li>
                        <div class="flex-video">
                            <iframe allowfullscreen="allowfullscreen" allowscriptaccess="always" class="video-embed" frameborder="0" height="371" mode="transparent" src="https://www.youtube.com/embed/88TeAvKYz6o?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent" type="text/html" webkitallowfullscreen="true" width="660" wmode="transparent">
                            </iframe>
                        </div>
                    </li>
                    <li class="text-center">
                        <a data-lightbox="282482" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/282/482/datas/original.png">
                            <img alt="Vita &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/282/482/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <h2>
                    1. Resumo:
                </h2>
                <p>
                    O aplicativo Vita &eacute; um agente pessoal que auxilia na escolha mais eficiente do meio de transporte a ser utilizado. Ele armazena o hist&oacute;rico detalhado de todos os trajetos percorridos pelo usu&aacute;rio, permitindo realizar uma an&aacute;lise inteligente da informa&ccedil;&atilde;o de seu transporte de maneira centralizada. Ele &eacute; um meio de coleta de informa&ccedil;&otilde;es sobre o tr&acirc;nsito, concentrando o hist&oacute;rico dos trajetos de todos os usu&aacute;rios em um &uacute;nico lugar. Ele possibilita o planejamento do tr&acirc;nsito com dados reais, detalhados e em tempo real, sendo de grande utilidade para as prefeituras. Ele permite diminuir os congestionamentos atrav&eacute;s da orienta&ccedil;&atilde;o dos motoristas, pedestres, caroneiros, ciclistas e passageiros de t&aacute;xi e transporte p&uacute;blico, que recebem incentivos ao utilizarem os meios de transporte mais indicados conforme dia e hor&aacute;rio, atualizados em tempo real. O aplicativo Vita &eacute; a plataforma mais completa j&aacute; criada que possui potencial real para a redu&ccedil;&atilde;o dos congestionamentos, trazendo sa&uacute;de e benef&iacute;cios econ&ocirc;micos para a popula&ccedil;&atilde;o e as cidades. Somente com caronas, &eacute; poss&iacute;vel reduzir em torno de 8% o n&uacute;mero de carros nas vias da grande S&atilde;o Paulo.
                </p>
                <h2>
                    2. Cadastre-se:
                </h2>
                <p>
                    Cadastre-se para receber atualiza&ccedil;&otilde;es do projeto e seja o primeiro a utiliz&aacute;-lo quando for lan&ccedil;ado comercialmente!
                    <a href="http://goo.gl/forms/b2hLuLa9OL" rel="nofollow">
                        http://goo.gl/forms/b2hLuLa9OL
                    </a>
                </p>
                <h2>
                    3. Problema:
                </h2>
                <p>
                    Os meios de transporte urbano podem ser classificados em n&atilde;o motorizados (bicicleta, a p&eacute;), motorizados individuais (carro, t&aacute;xi, motocicleta) e motorizados coletivos (metr&ocirc;, trem, &ocirc;nibus). Em 2012, a regi&atilde;o metropolitana de S&atilde;o Paulo registrou um total de 43,7 milh&otilde;es de trajetos, com 68% destes tendo sido realizados por transportes motorizados. Dentre os transportes motorizados, os individuais representam 45,7% dos trajetos, realizados por 4,6 milh&otilde;es de carros e motocicletas, enquanto os coletivos representam 54,3% (Fonte: [2]).
                </p>
                <p>
                    Apesar de transportes motorizados individuais e transportes motorizados coletivos realizarem quantidades de trajetos relativamente pr&oacute;ximas, grandes diferen&ccedil;as podem ser vistas entre estes dois modelos de transporte do ponto de vista econ&ocirc;mico. Em 2008, um estudo mostrou que os transportes individuais geravam um custo de R$ 4,8 bilh&otilde;es em emiss&otilde;es de poluentes, contra R$ 1,9 bilh&otilde;es gerados por transporte coletivo (Fonte:[3]) Ainda, o valor de patrim&ocirc;nio necess&aacute;rio (infra-estrutura e valores de ve&iacute;culos) para o transporte individual se mostra enormemente superior ao necess&aacute;rio para o transporte coletivo, na ordem de 1,44 trilh&otilde;es contra 207,5 bilh&otilde;es, respectivamente. (Fonte: [4]). Da mesma forma, os custos de manuten&ccedil;&atilde;o tamb&eacute;m s&atilde;o maiores para o transporte individual, de 104,1 bilh&otilde;es de reais, contra 25 bilh&otilde;es de reais referente ao transporte coletivo (Fonte: [5]).  &Eacute; f&aacute;cil notar que o custo para se manter o transporte individual motorizado &eacute; imensamente superior ao custo para se manter o transporte coletivo motorizado, tanto para os indiv&iacute;duos que utilizam tais transportes quanto para o poder p&uacute;blico.
                </p>
                <p>
                    Al&eacute;m do aspecto financeiro, o transporte coletivo ganha do individual tamb&eacute;m no aspecto ambiental. Todos os meios de transporte motorizados somados geram cerca de 28,1 milh&otilde;es de toneladas de polui&ccedil;&atilde;o, com 61% desse valor vindo apenas dos carros (Fonte: [6]). Portanto, uma substitui&ccedil;&atilde;o de trajetos em transportes motorizados individuais por trajetos em transportes motorizados coletivos ou, melhor ainda, trajetos em transportes n&atilde;o motorizados proporciona n&atilde;o s&oacute; uma grande diminui&ccedil;&atilde;o de gastos como tamb&eacute;m uma grande diminui&ccedil;&atilde;o da polui&ccedil;&atilde;o no meio ambiente.
                </p>
                <p>
                    Por&eacute;m, como podemos ver nesta passagem: &ldquo;O colapso da mobilidade tamb&eacute;m afeta os transportes coletivos. No metr&ocirc; e nos trens urbanos, a ocupa&ccedil;&atilde;o chega a at&eacute; nove passageiros por metro quadrado em hor&aacute;rios de pico, que agora se estendem das 7h &agrave;s 9h, das 11h &agrave;s 13h e das 18h &agrave;s 21h. Nesses hor&aacute;rios, at&eacute; mesmo &ocirc;nibus em corredores exclusivos s&atilde;o afetados: a velocidade cai sensivelmente e longas filas de ve&iacute;culos se formam nas plataformas de embarque e desembarque&rdquo; (Fonte: [7]).
                </p>
                <p>
                    Em m&eacute;dia, cada comuta&ccedil;&atilde;o, ou seja, trajeto de um ponto at&eacute; outro, em S&atilde;o Paulo leva 1 hora e meia, totalizando no m&iacute;nimo 3 horas disperdi&ccedil;adas no tr&acirc;nsito por dia para quem vai e volta do trabalho ou da escola. Em um ano, isto representa 45 dias inteiros parado dentro de um ve&iacute;culo respirando ar polu&iacute;do (Fonte: [8]).
                </p>
                <p>
                    Resumindo, os malef&iacute;cios da m&aacute; gest&atilde;o e escolha do meio de transporte principal das metr&oacute;poles n&atilde;o s&atilde;o apenas financeiros e temporais, tamb&eacute;m afetam a sa&uacute;de pela polui&ccedil;&atilde;o, estresse e sedentarismo (medidos neste aplicativo pela gera&ccedil;&atilde;o de CO&sup2;, tempo perdido no tr&acirc;nsito, estresse e gasto de calorias). Ainda, o transporte p&uacute;blico n&atilde;o atinge a capacidade em n&uacute;mero de pessoas e nem as expectativas de conforto e seguran&ccedil;a necess&aacute;rias para encorajar um n&uacute;mero suficiente de pessoas a utilizarem este modelo de uma forma que descongestione as vias da metr&oacute;pole.
                </p>
                <p>
                    Ent&atilde;o, qual ser&aacute; a solu&ccedil;&atilde;o para os quil&ocirc;metros e mais quil&ocirc;metros de congestionamentos?
                </p>
                <h2>
                    4. Solu&ccedil;&atilde;o:
                </h2>
                <p>
                    Antes de montar um plano para solucionar um problema, sempre deve-se observ&aacute;-lo de forma criteriosa, classificando seus pontos em comum e suas peculiaridades. Por&eacute;m, como observar o tr&acirc;nsito que possui milhares de entidades particulares independentes e que n&atilde;o seguem padr&otilde;es? O ideal &eacute; coletar os dados de cada entidade, junt&aacute;-los em um &uacute;nico lugar e ent&atilde;o agrup&aacute;-los conforme similaridades. Foi pensando nisso e na vontade de criar uma solu&ccedil;&atilde;o integrada para todos os tipos de transporte, que criamos o Vita. Muito mais do que um aplicativo, &eacute; uma plataforma que coleta informa&ccedil;&otilde;es, permite a sua an&aacute;lise, planejamento de solu&ccedil;&otilde;es vi&aacute;veis para os engarrafamentos e serve de canal de orienta&ccedil;&atilde;o para cada usu&aacute;rio do tr&acirc;nsito, como uma central de comando de tr&aacute;fego.
                </p>
                <p>
                    Este aplicativo funciona como um banco de dados para todo deslocamento realizado pelo usu&aacute;rio. O principal valor do aplicativo se encontra no armazenamento de todos os trajetos realizados pelo usu&aacute;rio, incluindo a data, hora e local de partida e de chegada, o meio de transporte utilizado, custo do transporte, emiss&atilde;o de CO&sup2; gerada, tempo gasto e mais alguns detalhes importantes do deslocamento. No caso de um motorista, tamb&eacute;m s&atilde;o colhidos os dados de m&eacute;dia de consumo de combust&iacute;vel do ve&iacute;culo, valor m&eacute;dio pago por litro de combust&iacute;vel, n&uacute;mero de acompanhantes e capacidade de ocupantes do ve&iacute;culo. O aplicativo calcula as calorias gastas em cada trajeto a partir dos dados de peso, sexo e idade do usu&aacute;rio. Todas estas informa&ccedil;&otilde;es s&atilde;o guardadas e podem ser acessadas a qualquer momento, permitindo uma an&aacute;lise sobre os benef&iacute;cios e malef&iacute;cios de cada tipo de transporte, para que o usu&aacute;rio tenha lucidez, fa&ccedil;a uma an&aacute;lise de dados reais e possa escolher qual &eacute; o comportamento mais saud&aacute;vel tanto para si, quanto para a sociedade e a natureza.
                </p>
                <p>
                    Do lado da gest&atilde;o do tr&acirc;nsito, tem-se os dados de milhares de usu&aacute;rios centralizados, atualizados em tempo real e detalhados. Dados estes que atualmente s&atilde;o adquiridos a cada 10 anos com pesquisas de porta em porta, como a Pesquisa de Mobilidade da Regi&atilde;o Metropolitana de S&atilde;o Paulo, que teve sua &uacute;ltima atualiza&ccedil;&atilde;o no ano de 2012. Atrav&eacute;s destes dados centralizados pode-se entender o comportamento anonimamente dos usu&aacute;rios, de uma forma customizada e massiva ao mesmo tempo. Uma vez possuindo estes dados precisos e combinados, abre-se um leque de oportunidades: a) estudo de comportamento de usu&aacute;rios do tr&acirc;nsito; b) conscientiza&ccedil;&atilde;o customizada sobre m&aacute;s op&ccedil;&otilde;es e h&aacute;bitos de transporte; c) melhoria do transporte a partir de pol&iacute;ticas p&uacute;blicas embasadas em dados reais e atuais; d) possibilidade de coordenar a popula&ccedil;&atilde;o em prol de uma reordena&ccedil;&atilde;o do tr&acirc;nsito com a&ccedil;&otilde;es combinadas, concomitantes a partir de um gerenciamento centralizado (pode-se fazer aqui uma analogia &agrave; uma esta&ccedil;&atilde;o de controle de v&ocirc;o de um aeroporto, que j&aacute; tem resultados garantidos de uma maior efici&ecirc;ncia e seguran&ccedil;a do tr&aacute;fego); e ainda e) reduzir o n&uacute;mero de ve&iacute;culos nas ruas pela conscientiza&ccedil;&atilde;o dos malef&iacute;cios do transporte motorizado individual (carros) e ao conectar pessoas que possuem uma migra&ccedil;&atilde;o pendular similar, para que realizem estes trajetos frequentes compartilhando um meio de transporte.
                </p>
                <p>
                    O usu&aacute;rio, por sua vez, possui os benef&iacute;cios de salvar o hist&oacute;rico detalhado de seus trajetos, classificados separadamente por meio de transporte utilizado. Isto permite ao usu&aacute;rio um controle centralizado dos custos e h&aacute;bitos de transporte. O usu&aacute;rio recebe automaticamente indica&ccedil;&otilde;es de meios de transporte mais eficientes do que o utilizado, possui acesso aos seus dados individuais de custos, emiss&otilde;es de poluentes, tempo no tr&acirc;nsito, n&iacute;veis de estresse e sa&uacute;de, e pode inclusive comparar com a m&eacute;dia geral dos usu&aacute;rios. Como um benef&iacute;cio adicional, o usu&aacute;rio ainda acumula pontos a cada km trafegado, podendo trocar por caronas, descontos em lojas e servi&ccedil;os de empresas parceiras e pr&ecirc;mios promocionais.
                </p>
                <h2>
                    5. Diferenciais:
                </h2>
                <p>
                    Os diferenciais deste aplicativo est&atilde;o no armazenamento de hist&oacute;rico das viagens de todos os usu&aacute;rios em um &uacute;nico local e no canal de comunica&ccedil;&atilde;o que permite a coordena&ccedil;&atilde;o do tr&acirc;nsito. O hist&oacute;rico individual re&uacute;ne informa&ccedil;&otilde;es essenciais para uma escolha do meio de transporte eficiente e l&uacute;cida; O hist&oacute;rico centralizado de todos os usu&aacute;rios permite a an&aacute;lise e planejamento de solu&ccedil;&otilde;es para o tr&acirc;nsito; E o canal de comunica&ccedil;&otilde;es viabiliza uma coordena&ccedil;&atilde;o de cada agente do tr&acirc;nsito (usu&aacute;rio), habilitando uma execu&ccedil;&atilde;o do plano de descongestionamento das vias. Ainda, este canal de comunica&ccedil;&otilde;es possui uma via de envio de reclama&ccedil;&otilde;es do usu&aacute;rio para a central.
                </p>
                <p>
                    Somando a estes diferenciais, o Vita j&aacute; inclui um m&eacute;todo autom&aacute;tico para diminuir o n&uacute;mero de ve&iacute;culos nas ruas, que &eacute; a possibilidade de caronas seguras. Esta funcionalidade &eacute; &uacute;nica porque ela permite a conex&atilde;o de duas pessoas com trajetos similares somente quando estas realmente realizam os trajetos, coletando os dados a partir das suas posi&ccedil;&otilde;es reais, provindas dos seus GPS.
                </p>
                <p>
                    Por final, o Vita traz algumas funcionalidades simples, por&eacute;m com grande valor para algumas situa&ccedil;&otilde;es, como por exemplo: Sempre que &eacute; realizado um trajeto de t&aacute;xi, ao final da corrida o aplicativo salva o n&uacute;mero do t&aacute;xi, para caso o usu&aacute;rio perca algum pertence pessoal em seu interior.
                </p>
                <h2>
                    6. Resultados Poss&iacute;veis:
                </h2>
                <p>
                    Conforme dados retirados da WRI, World Resources Institute, na grande S&atilde;o Paulo s&atilde;o realizados 43.715.000 trajetos por dia. Destes, 22.934.000 s&atilde;o trajetos pendulares por motivo de trabalho ou estudo, ou seja, trajetos que possuem a mesma frequ&ecirc;ncia de dias da semana e hor&aacute;rio, portanto, trajetos regulares, chamados aqui de pendulares.O n&uacute;mero total de trajetos para ida e volta do trabalho &eacute; de 15.872.000, divididos em 9.014.000 realizados por meios de transporte coletivo, e 6.858.000 por meio de transporte motorizado individual (motos e carros). Retirando o n&uacute;mero de trajetos para o trabalho realizado com motos (aproximadamente 500.000), obtemos o n&uacute;mero de trajetos pendulares realizados por carros individualmente: 6.358.000. Aplicando a redu&ccedil;&atilde;o de 17% obtida no projeto TDM, temos um total de trajetos realizados por carros reduzido em 1.080.860, o que representa uma redu&ccedil;&atilde;o de 7,95% do n&uacute;mero total de trajetos realizados por carro na Grande S&atilde;o Paulo, ou ainda, 540.430 carros a menos nas ruas todos os dias &uacute;teis.
(Fonte: [8])
                </p>
                <p>
                    Entendemos que muito al&eacute;m de somente dados estat&iacute;sticos do transporte de uma regi&atilde;o com uma popula&ccedil;&atilde;o gigantesca, como a de S&atilde;o Paulo, &eacute; necess&aacute;rio criar ferramentas que consigam orientar cada indiv&iacute;duo componente do tr&acirc;nsito para ocorrer uma efetiva melhora. Para orient&aacute;-lo &eacute; necess&aacute;rio primeiro inform&aacute;-lo e educ&aacute;-lo de quais s&atilde;o as consequ&ecirc;ncias de seu comportamento e qual &eacute; o seu papel dentro da sociedade. Ap&oacute;s isto, deve-se criar um meio de orient&aacute;-lo a como colaborar e diminuir o impacto negativo, e incentiv&aacute;-lo a tomar as melhores decis&otilde;es. Se poss&iacute;vel, recompensando-o por cada uma delas. E, por final, mostrar os resultados globais destas a&ccedil;&otilde;es coordenadas e executadas em conjunto de todos.
                </p>
                <p>
                    Com base nestes conceitos, o aplicativo Vita surge como esta ferramenta de conex&atilde;o entre todos os usu&aacute;rios, centraliza&ccedil;&atilde;o da informa&ccedil;&atilde;o em tempo real, fonte de informa&ccedil;&atilde;o e educa&ccedil;&atilde;o, orienta&ccedil;&atilde;o para o usu&aacute;rio com sistema de incentivos e recompensas, e, por fim, um term&ocirc;metro automatizado, aberto ao p&uacute;blico, e em tempo real para medi&ccedil;&atilde;o e fonte de informa&ccedil;&atilde;o dos resultados de cada a&ccedil;&atilde;o realizada em prol de um tr&acirc;nsito mais eficiente.
                </p>
                <h2>
                    7. Fontes
                </h2>
                <p>
                    ([1] -
                    <a href="http://www.papodehomem.com.br/solucoes-para-o-transito-transporte-publico-gratuito-a-loucura-que-ja-existe/" rel="nofollow">
                        http://www.papodehomem.com.br/solucoes-para-o-transito-transporte-publico-gratuito-a-loucura-que-ja-existe/
                    </a>
                    )
                </p>
                <p>
                    [2] -
                    <a href="http://www.metro.sp.gov.br/metro/arquivos/mobilidade-2012/relatorio-sintese-pesquisa-mobilidade-2012.pdf" rel="nofollow">
                        http://www.metro.sp.gov.br/metro/arquivos/mobilidade-2012/relatorio-sintese-pesquisa-mobilidade-2012.pdf
                    </a>
                </p>
                <p>
                    [3] -
                    <a href="http://www.mobilize.org.br/estatisticas/9/custos-da-emissao-de-poluentes-e-dos-acidentes-de-transito-por-modo.html" rel="nofollow">
                        http://www.mobilize.org.br/estatisticas/9/custos-da-emissao-de-poluentes-e-dos-acidentes-de-transito-por-modo.html
                    </a>
                </p>
                <p>
                    [4] -
                    <a href="http://www.mobilize.org.br/estatisticas/10/valores-de-patrimonio-envolvido-na-mobilidade-2008.html" rel="nofollow">
                        http://www.mobilize.org.br/estatisticas/10/valores-de-patrimonio-envolvido-na-mobilidade-2008.html
                    </a>
                </p>
                <p>
                    [5] -
                    <a href="http://www.mobilize.org.br/estatisticas/8/custos-individuais-e-sociais-da-mobilidade-2008.html" rel="nofollow">
                        http://www.mobilize.org.br/estatisticas/8/custos-individuais-e-sociais-da-mobilidade-2008.html
                    </a>
                </p>
                <p>
                    [6] -
                    <a href="http://www.mobilize.org.br/estatisticas/6/poluentes-emitidos-pelos-veiculos-por-modo-2008.html" rel="nofollow">
                        http://www.mobilize.org.br/estatisticas/6/poluentes-emitidos-pelos-veiculos-por-modo-2008.html
                    </a>
                </p>
                <p>
                    [7] -
                    <a href="http://www.mobilize.org.br/midias/pesquisas/estudo-mobilize-20111.pdf" rel="nofollow">
                        http://www.mobilize.org.br/midias/pesquisas/estudo-mobilize-20111.pdf
                    </a>
                    , p&aacute;gina 61.
                </p>
                <p>
                    [8] -
                    <a href="http://www.wri.org/blog/2015/03/3-ways-sao-paulos-companies-helped-curb-traffic-congestion" rel="nofollow">
                        http://www.wri.org/blog/2015/03/3-ways-sao-paulos-companies-helped-curb-traffic-congestion
                    </a>
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/ios">
                                ios
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="http://goo.gl/forms/b2hLuLa9OL" rel="nofollow" target="_blank" title="http://goo.gl/forms/b2hLuLa9OL">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                goo.gl
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
