<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div>
                <p>
                    Hiện nay m&ocirc;i trường đang ng&agrave;y c&agrave;ng xuống cấp trầm trọng hơn do một phần lớn &yacute; thức người d&acirc;n c&ograve;n chưa cao. Tuy vậy, những người c&oacute; nhu cầu được t&igrave;m hiểu, được kh&aacute;m ph&aacute; về m&ocirc;i trường lại kh&ocirc;ng được cung cấp những th&ocirc;ng tin đầy đủ v&agrave; ch&iacute;nh x&aacute;c. Đ&oacute; cũng ch&iacute;nh l&agrave; mục ti&ecirc;u của ch&uacute;ng t&ocirc;i, website mang t&ecirc;n We Clean đ&atilde; được ra đời. Đ&acirc;y sẽ l&agrave; một người bạn đồng h&agrave;nh c&oacute; thể cho ch&uacute;ng ta những th&ocirc;ng tin hữu &iacute;ch v&agrave; những trải nghiệm th&uacute; vị. 
We Clean mong muốn c&oacute; thể mang đến một bức tranh to&agrave;n cảnh , ch&acirc;n thực về thực trạng m&ocirc;i trường. Hơn thế nữa, đ&acirc;y c&ograve;n l&agrave; một mạng kết nối bạn v&agrave; những "đồng minh" kh&aacute;c nhằm lan toả c&aacute;c th&ocirc;ng điệp, c&aacute;c vấn đề mới nhất về m&ocirc;i trường. We Clean trao cho người d&ugrave;ng cơ hội được l&agrave; một phần của những kế hoạch bảo vệ m&ocirc;i trường trong khu vực bạn đang sống. Đ&acirc;y ch&iacute;nh l&agrave; cơ hội để bạn trau dồi v&agrave; tạo n&ecirc;n tầm ảnh hưởng của bản th&acirc;n đối với m&ocirc;i trường. H&atilde;y chung tay trở th&agrave;nh "người thuần ho&aacute;" r&aacute;c thải, loại bỏ ch&uacute;ng khỏi những cảnh quan đẹp đẽ của ch&uacute;ng ta, cũng c&oacute; thể biến ch&uacute;ng trở th&agrave;nh những vật liệu hữu &iacute;ch trong cuộc sống của ch&uacute;ng ta. Bạn c&oacute; thể g&oacute;p h&agrave;ng chục vi&ecirc;n gạch cho dự &aacute;n Ecobrick (sử dụng r&aacute;c thải nhựa l&agrave;m vật liệu x&acirc;y nh&agrave;) với mỗi hoạt động vệ sinh m&ocirc;i trường.
&ldquo;We clean, go green!&rdquo;
H&atilde;y c&ugrave;ng ch&uacute;ng t&ocirc;i x&acirc;y dựng một &ldquo;h&agrave;nh tinh xanh&rdquo; đ&uacute;ng nghĩa!
                </p>
            </div>
            <nav class="app-links section">
                <h2>
                    Try it out
                </h2>
                <ul class="no-bullet" data-role="software-urls">
                    <li>
                        <a href="https://github.com/ngnganha/shecodes-Hackathon" rel="nofollow" target="_blank" title="https://github.com/ngnganha/shecodes-Hackathon">
                            <i class="ss-icon ss-link">
                            </i>
                            <span>
                                github.com
                            </span>
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </body>
</html>
