<html>
    <head>
    </head>
    <body>
        <div class="large-9 columns" id="app-details-left">
            <div id="gallery">
                <ul>
                    <li class="text-center">
                        <a data-lightbox="378670" data-title="woof!" href="https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/378/670/datas/original.jpg">
                            <img alt="woof! &ndash; screenshot 1" class="software_photo_image image-replacement" onerror="this.onerror=null;this.src='https://devpost-challengepost.netdna-ssl.com/assets/defaults/thumbnail-placeholder-42bcab8d8178b413922ae2877d8b0868.gif';" src="//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/378/670/datas/gallery.jpg">
                        </a>
                        <span class="expand-tag">
                            <i class="fas fa-expand">
                            </i>
                        </span>
                        <p>
                            <i>
                                woof!
                            </i>
                        </p>
                    </li>
                </ul>
            </div>
            <div>
                <p>
                    Nombre del proyecto: proyecto woof!
Integrantes: Dante Santiago, Rodolfo, Bryan, Ismael, juan Manuel.
Inspiraci&oacute;n: &ldquo;Aplicaci&oacute;n para ayudar a los perros de la calle a encontrar un hogar&rdquo;.
                    <br>
                    Ayudar a los perros de la calle a encontrar un hogar  a trav&eacute;s de una plataforma digital nos inspir&oacute; a analizar dicha problem&aacute;tica y presentar woof!
&iquest;Qu&eacute; es lo que hace?
La idea principal es que el usuario en medio de su vida cotidiana al encontrar un perro en la calle sin acompa&ntilde;ante. A trav&eacute;s de publicaciones (fotos y ficha descriptiva) en dicha plataforma se compartir&aacute; la apariencia y ubicaci&oacute;n del can. 
Se propone un registro inicial al usuario en el que este compartir&aacute; un perfil con su mascota en el caso de tener; de esta forma si alg&uacute;n usuario extravi&oacute; a su perro, podr&iacute;a indagar el caso de que alguien encuentre a su canino y lo haya reportado. De no ser el caso los usuarios interesados podr&iacute;an aspirar a adquirir a la mascota en la que se hallan interesado.
                </p>
                <p>
                    &iquest;C&oacute;mo seleccionar al mejor due&ntilde;o para el perrito extraviado?
El perfil del usuario ser&aacute; una ventana para que los dem&aacute;s usuarios eval&uacute;en al observar las publicaciones si el usuario es apto para merecer un compa&ntilde;ero. Esto se evaluara mediante woof&acute;s! (algo similar al tan conocido &ldquo;like&rdquo;) al visitar el perfil los visitantes dar&aacute;n o restaran solo un woof! , Al momento en el que el usuario acumule cierta cantidad de estos, el usuario ir&aacute; acumulando lo que como l&iacute;mite le mostrar&aacute; cinco woof&acute;s! , de lo que se considerar&aacute; por la cantidad de estos si es o no un due&ntilde;o responsable.
                </p>
                <p>
                    Modelo de negocio
Para que la plataforma pueda mantenerse se considerar&aacute; dejar el software como libre para que &eacute;ste presente mejoras muy constantemente. Se tomara en cuenta, antirr&aacute;bicas y refugios temporales para los canes; se manejara publicidad y donaciones para buscar sustento econ&oacute;mico temporal para los perros hasta encontrarles un hogar.
&iquest;En que tecnolog&iacute;a est&aacute; desarrollado el proyecto?
Android studio.  :v
                </p>
            </div>
            <div class="" id="built-with">
                <h2>
                    Built With
                </h2>
                <ul class="no-bullet inline-list">
                    <li>
                        <span class="cp-tag recognized-tag">
                            <a href="https://devpost.com/software/built-with/android-studio">
                                android-studio
                            </a>
                        </span>
                    </li>
                </ul>
            </div>
        </div>
    </body>
</html>
